[{"key":"CSD 306K","name":"Introduction to Communication Disorders","description":"Introduction to the study of processes and disorders of speech, language, and hearing; observation in the University Speech and Hearing Center. Three lecture hours a week for one semester.","upper":false},{"key":"CSD 308K","name":"Perspectives on Deafness","description":"Examination of deafness from a number of perspectives: social and psychological meanings of deafness, the deaf community, education of deaf children, sign languages, and historical trends. Three lecture hours a week for one semester. Fulfills the communication and culture requirement in the College of Communication.","upper":false},{"key":"CSD 311K","name":"Phonetic Description of Speech","description":"Speech production, physiological analysis and description of speech sounds, voice quality, and voice dynamics; notation; phonetic theory; applications of phonetics. Three lecture hours a week for one semester.","upper":false},{"key":"CSD 313L","name":"Hearing Science","description":"Acoustical, physiological, and psychological bases of normal human hearing; theories of audition; laboratory techniques in hearing science research. Three lecture hours a week for one semester.","upper":false},{"key":"CSD 314L","name":"Sociocultural Bases of Communication","description":"An introduction to the influences of social and cultural factors, such as ethnicity, socioeconomic status, and geographic region, on communication acquisition and use, with a focus on cross-cultural communication issues in a diverse society. Three lecture hours a week for one semester.","upper":false},{"key":"CSD 318K","name":"Acquisition of Communicative Abilities in Children","description":"Introduction to assessment procedures and treatment strategies for children with speech and language disorders. Three lecture hours a week for one semester. Prerequisite: Communication Sciences and Disorders 306K or 308K with a grade of at least C, and Communication Sciences and Disorders 311K with a grade of at least C.","upper":false},{"key":"CSD 118L","name":"Acquisition of Communicative Abilities in Children: Laboratory","description":"Clinical laboratory experience in child language. One lecture hour a week for one semester. Prerequisite: Communication Sciences and Disorders 306K or 308K with a grade of at least C, and Communication Sciences and Disorders 311K with a grade of at least C.","upper":false},{"key":"CSD 140L","name":"Professional Issues in Communication Disorders","description":"Restricted to communication sciences and disorders majors. Issues in ethics, licensure, certification, and professional practice in communication disorders. One lecture hour a week for one semester. May not be counted toward a degree. Offered on the pass/fail basis only. Prerequisite: Upper-division standing and twelve semester hours of coursework in communication sciences and disorders.","upper":true},{"key":"CSD 341","name":"Principles of Audiology","description":"Causes of hearing disorders; diagnostic procedures and treatment. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, a University grade point average of at least 2.25, and Communication Sciences and Disorders 313L with a grade of at least C.","upper":true},{"key":"CSD 350","name":"Language and the Brain","description":"Same as Linguistics 350 (Topic 1: Language and the Brain).  Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CSD 358","name":"Anatomy and Physiology of the Speech and Hearing Mechanism","description":"In-depth study of the anatomy and physiology of structures involved in speech, language, hearing, and swallowing. Includes anatomical and physiological mechanisms of respiration, phonation, articulation, and hearing; and the central nervous system and blood supply to the speech and hearing mechanism. Three lecture hours a week for one semester. Communication Sciences and Disorders 358 and 393E (Topic 8: Anatomy and Physiology of the Speech and Hearing Mechanism)may not both be counted. Prerequisite: Upper-division standing, Communication Sciences and Disorders 311K with a grade of at least C, and a University grade point average of at least 2.25.","upper":true},{"key":"CSD 358S","name":"Fundamentals of Speech Science","description":"Same as Linguistics 358S. Neurophysiological mechanisms underlying the encoding and decoding of speech. Three lecture hours a week for one semester. Only one of the following may be counted: Communication Sciences and Disorders 358S, 396N, Linguistics 358S. Prerequisite: Upper-division standing and a University grade point average of at least 2.25; for Communication Sciences and Disorders majors, Communication Sciences and Disorders 313L and 358 with a grade of at least C in each.","upper":true},{"key":"CSD 359H","name":"Honors Tutorial Course: Reading","description":"Restricted to senior communication sciences and disorders majors. Intensive reading and research as planned by the departmental honors committee. Individual instruction. Prerequisite: Upper-division standing; twenty-four semester hours of coursework in communication sciences and disorders, twelve of which must be upper-division; and admission to the Communication Sciences and Disorders Honors Program.","upper":true},{"key":"CSD 360M","name":"Communication and Deaf People","description":"Forms of face-to-face communication used with deaf people, including speech/listening, systems of manual communication, and natural sign language. Emphasis is on child development issues and the use of different methods in educational practice. Three lecture hours a week for one semester. Fulfills the communication and culture requirement in the College of Communication. Prerequisite: Upper-division standing, Communication Sciences and Disorders 308K with a grade of at least C, and a University grade point average of at least 2.25.","upper":true},{"key":"CSD 367","name":"Topics in Communication Sciences and Disorders","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"CSD 367K","name":"Introduction to Speech and Language Disorders Assessment and Treatment in Children","description":"Restricted to senior communication sciences and disorders majors. Introduction to assessment procedures and treatment strategies for children with speech and language disorders. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, a University grade point average of at least 2.25, and the following coursework with a grade of at least C in each course: Communication Sciences and Disorders 306K or 308K; 311K and 313L; 318K and 118L (or 368K and 168L); 358 and 358S (or 315S).","upper":true},{"key":"CSD 367R","name":"Clinical Research in Speech/Language Pathology","description":"Three lecture hours a week for one semester. Communication Sciences and Disorders 367 (Topic 2: Clinical Research in Speech Language Pathology) and 367R may not both be counted. Prerequisite: Upper-division standing, Communication Sciences and Disorders 358S with a grade of at least C, and a University grade point average of at least 2.25.","upper":true},{"key":"CSD 371","name":"Introduction to Speech and Language Disorders Assessment and Treatment in Adults","description":"Restricted to senior communication sciences and disorders majors. Introduction to assessment procedures and treatment strategies for adults with speech and language disorders. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, a University grade point average of at least 2.25, and the following coursework with a grade of at least C in each course: Communication Sciences and Disorders 306K or 308K; 311K, 313L, and 350; and 358 and 358S (or 315S).","upper":true},{"key":"CSD 373","name":"Principles of Aural Rehabilitation","description":"Rationale, methods, materials, procedures, and criteria for aural rehabilitation for hearing-impaired persons. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; the following coursework with a grade of at least C in each: Communication Sciences and Disorders 306K or 308K, 311K, 313L, 341, 358, and 358S; and a University grade point average of at least 2.25.","upper":true},{"key":"CSD 175N","name":"Deaf Education Seminar","description":"Discussion of selected topics in social, political, and educational aspects of deafness. One lecture hour a week for one semester. Communication sciences and disorders majors specializing in education of the deaf/hearing-impaired may count no more than four semester hours in this course toward the degree; communication sciences and disorders majors specializing in audiology or specializing in speech/language pathology may count no more than two semester hours in this course toward the degree; other students with majors in the College of Communication may count no more than one semester hour in this course toward the degree. May be repeated for credit. Prerequisite: Upper-division standing.","upper":true},{"key":"CSD 378","name":"Clinical Audiology","description":"Differential diagnostic procedures for evaluation of auditory disorders--theoretical concepts and clinical applications. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and Communication Sciences and Disorders 341.","upper":true},{"key":"CSD 178L","name":"Clinical Audiology Laboratory","description":"Clinical laboratory experience in audiology. One lecture hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CSD 379H","name":"Honors Tutorial Course: Special Project","description":"Restricted to senior communication sciences and disorders majors. The writing of a thesis or the presentation of a creative project; final comprehensive examination. Individual instruction. Prerequisite: Communication Sciences and Disorders 359H.","upper":true}]