[{"key":"GSD 301","name":"Introduction to the Study of Northern Europe","description":"Introduces significant moments in and monuments from the cultural histories of the German-speaking, Scandinavian, and Dutch nations from their beginnings to the present. Designed to discuss representative problems in research and analysis in cultural studies and the humanities. Three lecture hours a week for one semester.","upper":false},{"key":"GSD 310","name":"Introductory Topics on Northern Europe","description":"Introduction to important topics in the history of Northern Europe's culture, including areas from history, the arts, film studies, language and linguistics, and literature. Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: German, Scandinavian, and Dutch Studies 310, Germanic Civilization 301, and Scandinavian 302. May be repeated for credit when the topics vary.","upper":false},{"key":"GSD 311C","name":"Movies Go To War","description":"Same as American Studies 315C, Comparative Literature 305 (Topic 3), and European Studies 307 (Topic 4). A comparison of films from various nations about major twentieth century wars to the historical facts of the conflicts as practicums in critical comparative analysis of histories as representations. Only one of the following may be counted: American Studies 315 (Topic: Movies Go to War, World War I to Vietnam), 315C, Comparative Literature 305 (Topic: Movies Go to War, World War I to Vietnam), 305 (Topic 3), European Studies 307 (Topic: Movies Go to War, World War I to Vietnam), 307 (Topic 4), German, Scandinavian, and Dutch Studies 311C, Germanic Civilization 311 (Topic 2: Movies Go to War, World War I to Vietnam).","upper":false},{"key":"GSD 311D","name":"Race and Gender Stereotypes in Germany","description":"Same as European Studies 306 (Topic 1). Examination of pseudoscientific popular theories of \"race\" and gender that developed in Germany and elsewhere in Europe in the nineteenth century, and how these affected the lives of millions and shaped current thinking about \"racial\" and gender differences. Three lecture hours a week for one semester. Only one of the following may be counted: European Studies 306 (Topic: Bad Blood), 306 (Topic 1), German, Scandinavian, and Dutch Studies 311D, Germanic Civilization 301 (Topic: Bad Blood).","upper":false},{"key":"GSD 321W","name":"German Cultural History","description":"Restricted to students enrolled in the University of Wuerzburg Summer Program. Excursions, local research, and exposure to a German viewpoint on contemporary European affairs. The equivalent of three lecture hours a week for one semester. Taught in Wuerzburg, Germany. German, Scandinavian, and Dutch Studies 321W and Germanic Civilization 327E (Topic 7: German Cultural History) may not both be counted.","upper":true},{"key":"GSD 330","name":"Topics in Film and Media","description":"In-depth explorations of topics and problems in film and media studies from the perspective of one or more of the nations of Northern Europe and/or in relation to Northern Europe's cultural nexuses. Three lecture hours a week for one semester. Some topics may require additional hours for film screenings. Only one of the following may be counted unless the topics vary: German, Scandinavian, and Dutch Studies 330, Germanic Civilization 361E, and Scandinavian 327. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 331C","name":"Films of Ingmar Bergman","description":"Same as Comparative Literature 323 (Topic 11) and European Studies 347 (Topic 13). An introduction to the films of Ingmar Bergman. Only one of the following may be counted: Comparative Literature 323 (Topic: Films of Ingmar Bergman), 323 (Topic 11), English 322 (Topic 18), European Studies 347 (Topic: Films of Ingmar Bergman), 347 (Topic 13), German, Scandinavian, and Dutch Studies 331C, Scandinavian 327 (Topic 9). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 340","name":"Topics in Narrative and Textual Studies","description":"Examination of significant case studies, often literary, on how narratives and other text-types are constructed (as art and/or material culture), circulated, and understood by readers and on how they work in and between various national traditions in Northern Europe and/or in relation to its cultural nexuses. Only one of the following may be counted unless the topics vary: German, Scandinavian, and Dutch Studies 340, Germanic Civilization 323E, 362E, Scandinavian 323, 373. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 341C","name":"European Folktale","description":"Same as European Studies 347 (Topic 21). Examination of a wide selection of collected Indo-European folktales as well as numerous perspectives for understanding, interpreting, and applying these tales. Frameworks for analysis ed include formalist and structuralist; nationalist and aesthetic; mythic and archetypal; socio-historical; psychoanalytical and therapeutic; and feminist and gender studies. Three lecture hours a week for one semester. Only one of the following may be counted: Anthropology 310L (Topic: European Folktale), European Studies 307 (Topic: European Folktale), 347 (Topic 21), German, Scandinavian, and Dutch Studies 341C, Germanic Civilization 301 (Topic: European Folktale), Scandinavian 302 (Topic: European Folktale). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 341D","name":"Social Dramas of Henrik Ibsen","description":"Same as Comparative Literature 323 (Topic 17), English 322 (Topic 17), European Studies 347 (Topic 12),  and Women's and Gender Studies 345 (Topic 14). A detailed introduction to Ibsen's social dramas (1877-1899), emphasizing their unity as a prolonged commentary on the society of his era and the variety of its human problems. Special emphasis on topics such as: the family and the home; the public world of reputation, work, and citizenship; the predicaments of men and women in a male-dominated society; and the motives of our interventions into the lives of others. Only one of the following may be counted: Comparative Literature 323 (Topic: Social Dramas of Henrik Ibsen), 323 (Topic 17), English 322 (Topic 17), European Studies 347 (Topic: Social Dramas of Henrik Ibsen), 347 (Topic 12), German, Scandinavian, and Dutch Studies 341D, Scandinavian 323 (Topic 2), Women's and Gender Studies 345 (Topic 14). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 341E","name":"Hans Christian Andersen","description":"Same as Comparative Literature 323 (Topic 12) and European Studies 347 (Topic 14). Introduction to such Hans Christian Andersen tales as \"The Little Mermaid,\" \"The Ugly Duckling,\" and \"The Emperor's New Clothes.\" Examination of their author and the romantic period in which they were written, as well as their historical, philosophical, and literary context. Only one of the following may be counted: Comparative Literature 323 (Topic: Hans Christian Andersen), 323 (Topic 12), English 322 (Topic 19), European Studies 347 (Topic: Hans Christian Andersen), 347 (Topic 14), German, Scandinavian, and Dutch Studies 341E, Germanic Civilization 323E (Topic 4), Scandinavian 373 (Topic 4). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 341F","name":"Women and the Holocaust","description":"Same as Comparative Literature 323 (Topic 19), European Studies 346 (Topic 10), Jewish Studies 363 (Topic 11),  and Women's and Gender Studies 340 (Topic 50). Introduction to both the history of Jewish and German women during World War II and the Holocaust, and to women's narratives and self-representations of this period. Historical sources, memoirs, films, and interviews will be used as source material. Three lecture hours a week for one semester. Only one of the following may be counted: Comparative Literature 323 (Topic: Women's Narratives of the Holocaust and World War II), 323 (Topic 19), European Studies 346 (Topic: Women's Narratives of the Holocaust and World War II), 346 (Topic 10), German, Scandinavian, and Dutch Studies 341F, Germanic Civilization 323E (Topic: Women's Narratives of the Holocaust and World War II), Jewish Studies 363 (Topic 11), Women's and Gender Studies 340 (Topic: Women's Narratives of the Holocaust and World War II), 340 (Topic 50). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 341G","name":"Isak Dinesen/Karen Blixen","description":"Same as Comparative Literature 323 (Topic 14), European Studies 347 (Topic 15),  and Women's and Gender Studies 345 (Topic 13). An introduction to the twentieth-century Danish author Karen Blixen, focusing on her major themes such as gender and destiny, and examining her role as a literary figure. Only one of the following may be counted: Comparative Literature 323 (Topic: Isak Dinesen/Karen Blixen), 323 (Topic 14), European Studies 347 (Topic: Isak Dinesen/Karen Blixen), 347 (Topic 15), German, Scandinavian, and Dutch Studies 341G, Germanic Civilization 323E (Topic 1), Scandinavian 373 (Topic 6), Women's and Gender Studies 345 (Topic 13). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 341J","name":"Contemporary Scandinavian Stories","description":"Same as Comparative Literature 323 (Topic 10) and European Studies 347 (Topic 16). An analysis of contemporary Scandinavian literature and films, how they reflect Scandinavian reality, and how Scandinavian identity is created through sports, food, and politics. Only one of the following may be counted: Comparative Literature 323 (Topic: Contemporary Scandinavian Stories), 323 (Topic 10), European Studies 347 (Topic: Contemporary Scandinavian Stories), 347 (Topic 16), German, Scandinavian, and Dutch Studies 341J, Germanic Civilization 323E (Topic: Contemporary Scandinavian Stories), Scandinavian 373 (Topic: Contemporary Scandinavian Stories). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 341K","name":"The Scandinavian Contribution to World Literature","description":"Same as Comparative Literature 323 (Topic 16) and European Studies 347 (Topic 17). Close readings of the most influential Scandinavian texts, including works by Nobel Prize-winning authors such as Knut Hamsun and Selma Lagerlof, as well as the playwrights August Strindberg and Henrik Ibsen while addressing important themes caused by the revolutionary transition to modernity in Scandinavia around 1900, including emancipation of women and sexuality. Only one of the following may be counted: Comparative Literature 323 (Topic: The Scandinavian Contribution to World Literature), 323 (Topic 16), European Studies 347 (Topic: The Scandinavian Contribution to World Literature), 347 (Topic 17), German, Scandinavian, and Dutch Studies 341K, Germanic Civilization 323E (Topic: The Scandinavian Contribution to World Literature), Scandinavian 373 (Topic: The Scandinavian Contribution to World Literature). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 350","name":"Topics in Linguistics","description":"In-depth explorations in contemporary and historical topics and problems associated with linguistics and the systematic study of languages in Northern Europe and related regions. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 360","name":"Topics in Culture and Society","description":"In-depth explorations of contemporary and historical moments in the cultures, social relations, cultural histories, and intellectual histories of the nations in Northern Europe and its cultural networks. Three lecture hours a week for one semester. Additional hours may be required for some topics. Only one of the following may be counted unless the topics vary: German, Scandinavian, and Dutch Studies 360, Germanic Civilization 327E, 340E, 360E, 362E, Scandinavian 327, and 335. Some sections offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 361C","name":"Introduction to Germanic Religion and Myth","description":"Same as European Studies 347 (Topic 3) and Religious Studies 357 (Topic 17). Survey of the sources and main features of Germanic religion and of the transition from paganism to Christianity in northern Europe and the Germanic territories of western Europe. Subjects include cosmogonic myths; the origin of man and of society; the concept of the soul; gods and goddesses and their mythology; and the organization of worship. Three lecture hours a week for one semester. Only one of the following may be counted: English 322 (Topic 2), European Studies 347 (Topic 3), German, Scandinavian, and Dutch Studies 361C, Germanic Civilization 340E (Topic 1), Religious Studies 365 (Topic 2), Religious Studies 357 (Topic 17). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 361E","name":"Tolerance in Dutch Culture","description":"Same as European Studies 347 (Topic 19) and Women's and Gender Studies 340 (Topic 37). The historical roots of Dutch \"tolerance\" and how it plays a role in current Dutch culture and attitudes towards religious, gender, and sexual differences, as well as drug use, prostitution, and euthanasia. Exploration of the stereotypes and the actuality of these Dutch attitudes and policies from an international comparative perspective. Only one of the following may be counted: European Studies 347 (Topic: Dutch Culture: Too tolerant?), 347 (Topic 19), German, Scandinavian, and Dutch Studies 361E, Germanic Civilization 327E (Topic: Dutch Culture: Too tolerant?), Women's and Gender Studies 340 (Topic: Dutch Culture: Too tolerant?), 340 (Topic 37). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 361F","name":"Squaring the Vienna Circle","description":"Same as Comparative Literature 323 (Topic 18) and European Studies 347 (Topic 20). Traces the origin of the Vienna Circle of Logical Empiricism in nineteenth-century Europe, and introduces central texts and problems of intellectual history and historical epistemology at the roots of today's analytic philosophy. Only one of the following may be counted: Comparative Literature 323 (Topic: Squaring the Vienna Circle), 323 (Topic 18), European Studies 347 (Topic: Squaring the Vienna Circle), 347 (Topic 20), German, Scandinavian, and Dutch Studies 361F, Germanic Civilization 362E (Topic: Squaring the Vienna Circle), Philosophy 327 (Topic: Squaring the Vienna Circle), 354 (Topic: Squaring the Vienna Circle). Prerequisite: Upper-division standing.","upper":true},{"key":"GSD 679H","name":"Honors Tutorial Course","description":"Supervised individual research on a literary or linguistic problem, culminating in an honors paper of some length. The equivalent of three lecture hours a week for two semesters. Prerequisite: For 679HA, upper-division standing, six semester hours of upper-division coursework in German, Scandinavian, and Dutch Studies, a University grade point average of at least 3.00, a grade point average in German, Scandinavian, and Dutch Studies of at least 3.50, and admission to the German, Scandinavian, and Dutch Studies Honors Program; for 679HB, German, Scandinavian, and Dutch Studies 679HA.","upper":true}]