[{"key":"GER 301","name":"German for Graduate Students in Other Departments","description":"No auditors. Beginning reading course for students preparing to fulfill language requirement for advanced degrees. Emphasis on grammar, vocabulary, and translation. Three lecture hours a week for one semester. May not be used to fulfill the undergraduate foreign language requirement. Offered on the credit/no credit basis only. Prerequisite: Graduate standing.","upper":false},{"key":"GER 601C","name":"Beginning German","description":"Not open to native speakers of German. An introduction to the German language and the cultures of the German-speaking countries. Focuses on development of vocabulary, grammatical knowledge, reading, writing, listening, and speaking abilities in a contemporary cultural context. Six lecture hours a week for one semester. Only one of the following may be counted: German 601C, 604, 506. Only one of the following may be counted: German 601C, 604, 507, 507R, 508K.","upper":false},{"key":"GER 604","name":"Accelerated First-Year German","description":"Covers the same material as German 506 and 507. Six lecture hours a week for one semester, with optional laboratory available. Only one of the following may be counted: German 601C, 604, 506. Only one of the following may be counted: German 601C, 604, 507, 507R, 508K. Prerequisite: Two high school units or the equivalent in another foreign language, or consent of instructor.","upper":false},{"key":"GER 305","name":"German for Graduate Students in Other Departments","description":"No auditors. Advanced reading. Emphasis on grammar, vocabulary, and translation. Three lecture hours a week for one semester. Fulfills the foreign language requirement for the Doctor of Philosophy degree in some departments. May not be used to fulfill the undergraduate foreign language requirement. Offered on the credit/no credit basis only. Prerequisite: Graduate standing, and German 301 or equivalent knowledge.","upper":false},{"key":"GER 506 (TCCN: GERM 1511)","name":"First-Year German I","description":"Basic training in grammatical patterns and usage of modern German. Five lecture hours a week for one semester. Only one of the following may be counted: German 601C, 604, 506.","upper":false},{"key":"GER 507 (TCCN: GERM 1512)","name":"First-Year German II","description":"Advanced training in grammatical patterns and usage of modern German. Five lecture hours a week for one semester. Only one of the following may be counted: German 601C, 604, 507, 507R, 508K. Prerequisite: German 506 with a grade of at least C.","upper":false},{"key":"GER 507R","name":"Intensive First-Year German II","description":"German 507R covers the same material as 507 but is offered only in the spring as part of the Intensive German Program. Students in this program must take German 507R, 312R, and 312S during the same spring semester; they must register for all three courses at or before the beginning of the semester and must earn a grade of at least C in each course to take the next course in the sequence. Credit is given for each course in the sequence only if the student completes the entire sequence. The Intensive German Program meets for eleven hours a week for one semester. Only one of the following may be counted: German 601C, 604, 507, 507R, 508K. Prerequisite: Completion in residence of German 506 and consent of the undergraduate adviser.","upper":false},{"key":"GER 508K","name":"Alternate First-Year German II","description":"Reviews grammar, pronunciation, and reading skills; for students with beginning preparation below the average provided by German 506. Five lecture hours a week for one semester. Only one of the following may be counted: German 601C, 604, 507, 507R, 508K. Prerequisite: Two high school units of German or transfer credit for German 506, and appropriate score on the placement test.","upper":false},{"key":"GER 310","name":"Conversation and Composition","description":"Conducted in German. Intended to develop the ability to use German correctly and idiomatically in conversation and in compositions of gradually increasing difficulty. Three class hours a week for one semester. Fulfills fourth-semester language proficiency requirement. Prerequisite: German 312K or 312V with a grade of at least C. With consent of the German undergraduate adviser, may be taken concurrently with German 312K or 312V.","upper":false},{"key":"GER 611C","name":"Intermediate German","description":"Not open to native speakers of German. Continuation of German 601C. Development of vocabulary, grammatical knowledge, and reading, writing, listening, and speaking abilities in a contemporary cultural context. Six lecture hours a week for one semester. Only one of the following may be counted: German 611C, 612, 312K, 312R, 312V. Only one of the following may be counted: German 611C, 612, 312L, 312S, 312W. Prerequisite: German 601C, 604, 507, or 508K with a grade of at least C.","upper":false},{"key":"GER 612","name":"Accelerated Second-Year German: Readings in Modern German","description":"Grammar review, composition, readings and recitation, discussion of literary works, and German culture. Six lecture hours a week for one semester. Only one of the following may be counted: German 611C, 612, 312K, 312R, 312V. Only one of the following may be counted: German 611C, 612, 312L, 312S, 312W. Prerequisite: German 604, 507, or 508K with a grade of at least C.","upper":false},{"key":"GER 312K (TCCN: GERM 2311)","name":"Second-Year German I: Readings in Humanities and Social Sciences","description":"Three lecture hours a week for one semester. Only one of the following may be counted: German 611C, 612, 312K, 312R, 312V. Prerequisite: German 604, 507, or 508K with a grade of at least C.","upper":false},{"key":"GER 312L (TCCN: GERM 2312)","name":"Second-Year German II: Readings in Humanities and Social Sciences","description":"Three lecture hours a week for one semester. Only one of the following may be counted: German 611C, 612, 312L, 312S, 312W. Prerequisite: German 312K or 312V with a grade of at least C.","upper":false},{"key":"GER 312R","name":"Intensive Second-Year German: Oral and Written Expression and Reading Skill","description":"German 312R covers the same material as 312K but is offered only in the spring as part of the Intensive German Program. Students in this program must take German 507R, 312R, and 312S during the same spring semester; they must register for all three courses at or before the beginning of the semester and must earn a grade of at least C in each course to take the next course in the sequence. Credit is given for each course in the sequence only if the student completes the entire sequence. The Intensive German Program meets for eleven hours a week for one semester. Only one of the following may be counted: German 611C, 612, 312K, 312R, 312V. Prerequisite: Completion in residence of German 506 and consent of the undergraduate adviser.","upper":false},{"key":"GER 312S","name":"Intensive Second-Year German II: Readings in Humanities and Social Sciences","description":"German 312S covers the same material as 312L but is offered only in the spring as part of the Intensive German Program. Students in this program must take German 507R, 312R, and 312S during the same spring semester; they must register for all three courses at or before the beginning of the semester and must earn a grade of at least C in each course to take the next course in the sequence. Credit is given for each course in the sequence only if the student completes the entire sequence. The Intensive German Program meets for eleven hours a week for one semester. Only one of the following may be counted: German 611C, 612, 312L, 312S, 312W. Prerequisite: Completion in residence of German 506 and consent of the undergraduate adviser.","upper":false},{"key":"GER 312V","name":"Second-Year German I: Business German","description":"German 312V covers the same material as 312K, but with readings, discussions, and exercises that focus on the business world. Emphasis on practical, career-oriented competence. Three lecture hours a week for one semester. Only one of the following may be counted: German 611C, 612, 312K, 312R, 312V. Prerequisite: German 604, 507, or 508K with a grade of at least C.","upper":false},{"key":"GER 312W","name":"Second-Year German II: Business German","description":"German 312W covers the same material as 312L, but with readings, discussions, and exercises that focus on the business world. Emphasis on practical, career-oriented competence. Three lecture hours a week for one semester. Only one of the following may be counted: German 611C, 612, 312L, 312S, 312W. Prerequisite: German 312K or 312V with a grade of at least C.","upper":false},{"key":"GER 317C","name":"Advanced Intermediate German","description":"Not open to native speakers of German. Designed to prepare students with credit for German 611C for upper-division German language courses. Special focus on text and media literacy, advanced oral language practice, debate and writing, and accuracy. Three lecture hours a week for one semester. Prerequisite: German 611C with a grade of at least C.","upper":false},{"key":"GER 328","name":"Advanced German Grammar","description":"Description of German sounds, grammatical structures, pronunciation, word formation. Three lecture hours a week for one semester. Prerequisite: German 310, 612, 312L, 312S, 312W, or 317C with a grade of at least C.","upper":true},{"key":"GER 330C","name":"Advanced Conversation and Composition: Culture","description":"German cultural material from print and visual media provides the basis for advanced conversation and composition, with considerable practice in the writing of short essays in German. Three lecture hours a week for one semester. Only one of the following may be counted: German 330C or 331L. Prerequisite: German 310, 612, 312L, 312S, 312W, or 317C with a grade of at least C.","upper":true},{"key":"GER 130D","name":"German across Disciplines","description":"Students read and discuss German language materials related to the subject matter of another designated course. One lecture hour a week for one semester.  May be repeated for credit. Prerequisite: Three semester hours of upper-division coursework in German with a grade of at least C.","upper":true},{"key":"GER 331L","name":"Advanced Conversation and Composition: Literature","description":"German literary material from print and visual media provides the basis for advanced conversation and composition, with considerable practice in the writing of short essays in German. Three lecture hours a week for one semester. Only one of the following may be counted: German 330C or 331L. Prerequisite: German 310, 612, 312L, 312S, 312W, or 317C with a grade of at least C.","upper":true},{"key":"GER 336W","name":"Advanced Business German I","description":"Development of proficiency through readings, discussions, and assignments based on materials dealing with the German economic system and Germany's role in international trade. Emphasis on practical, job-related competence in business German. Taught in German. Three lecture hours a week for one semester. Normally meets with International Business 372 (Topic 7: Advanced Business German). Only one of the following may be counted: German 336W, or International Business 372 (Topic 7: Advanced Business German). Prerequisite: German 310, 612, 312L, 312S, 312W, or 317C with a grade of at least C.","upper":true},{"key":"GER 340C","name":"Historical Backgrounds of German Civilization","description":"Cultural, social, and literary history of German-speaking Europe of the Middle Ages. Studies humanism, the Reformation, absolutism, and the early Enlightenment (between 1200 and 1750). Taught in German. Three lecture hours a week for one semester. Prerequisite: Three semester hours of upper-division coursework in German with a grade of at least C.","upper":true},{"key":"GER 343C","name":"Contemporary German Civilization","description":"Cultural, social, and literary history of Germany between 1900 and reunification. Taught in German. Three lecture hours a week for one semester. Prerequisite: Three semester hours of upper-division coursework in German with a grade of at least C.","upper":true},{"key":"GER 345L","name":"German Literature between the Beginnings and the Baroque","description":"Three lecture hours a week for one semester. Prerequisite: Six semester hours of upper-division coursework in German.","upper":true},{"key":"GER 346L","name":"German Literature between the Enlightenment and the Present","description":"Cultural, social, and literary history of German-speaking Europe between 1750 and 1900. Taught in German. Three lecture hours a week for one semester. Prerequisite: Three semester hours of upper-division coursework in German with a grade of at least C.","upper":true},{"key":"GER 347L","name":"Language and Society in the German-speaking Countries","description":"Uses language and linguistics to study the culture and society of the German-speaking countries. Taught in German. Three lecture hours a week for one semester. Prerequisite: Three semester hours of upper-division coursework in German with a grade of at least C.","upper":true},{"key":"GER 348D","name":"German Play: Student Production","description":"Discussion, staging, and production of a German play. Three hours of lecture or laboratory a week for one semester. Prerequisite: German 310, 612, 312L, or the equivalent with a grade of at least C.","upper":true},{"key":"GER 356W","name":"Advanced Business German II","description":"Readings, discussions, and assignments based on material dealing with key areas of German business such as management and corporate hierarchies. Preparation for the German Certificate for Professional Purposes. Recommended for students planning a career in international business. Taught in German. Three lecture hours a week for one semester. German 356W and International Business 372 (Topic 6: Business German) may not both be counted. Prerequisite: Three semester hours of upper-division coursework in German with a grade of at least C.","upper":true},{"key":"GER 363K","name":"Topics in German Culture","description":"Study of selected aspects of Germanic civilization, such as science and philosophy, fine arts, film, history, social institutions. Conducted in German. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in German.","upper":true},{"key":"GER 366K","name":"Practicum in German Stylistics","description":"Three lecture hours a week for one semester. Prerequisite: German 328 (or 356), and three additional semester hours of upper-division coursework in German.","upper":true},{"key":"GER 369","name":"Topics in Germanic Languages","description":"Introduction to the phonology, morphology, syntax, dialectology, or lexicography of individual Germanic languages. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"GER 373","name":"Topics in Germanic Literature","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in German.","upper":true},{"key":"GER 679H","name":"Honors Tutorial Course","description":"Supervised individual research on a literary or linguistic problem, culminating in an honors paper of some length. Conference course for two semesters. Prerequisite: For 679HA, upper-division standing, six semester hours of upper-division German, a University grade point average of at least 3.00, a grade point average in German of at least 3.50, and admission to the Germanic Studies Honors Program; for 679HB, German 679HA.","upper":true}]