[{"key":"AST 301 (TCCN: ASTR 1303)","name":"Introduction to Astronomy","description":"General introduction to astronomy for nonscience majors. The solar system, stars, galaxies, and cosmology. Three lecture hours a week for one semester. Only one of the following may be counted: Astronomy 301, 302, 303, 307. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"AST 101L","name":"Astronomy Discovery Laboratory","description":"For nonscience majors. Hands-on projects in observational astronomy and related laboratory disciplines. Students work in small groups. Three laboratory hours a week for one semester. May not be counted by students with credit for Astronomy 103L. Prerequisite: Credit or registration for Astronomy 301.","upper":false},{"key":"AST 302","name":"Self-Paced Introduction to Astronomy","description":"General, self-paced introduction to astronomy for nonscience majors. The solar system, stars, galaxies, and cosmology. Self-paced. Only one of the following may be counted: Astronomy 301, 302, 303, 307. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"AST 303","name":"Introduction to Astronomy with Celestial Observations","description":"General introduction to astronomy for nonscience majors. The solar system, stars, galaxies, and cosmology. Introduces students to the night sky and includes some observational activities. Three lecture hours a week for one semester. Only one of the following may be counted: Astronomy 301, 302, 303, 307. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"AST 103L (TCCN: ASTR 1103)","name":"Astronomical Observations","description":"For nonscience majors. Observations of the night sky with the naked eye and small telescopes; indoor laboratory activities. Two laboratory hours a week for one semester. May not be counted by students with credit for Astronomy 101L, 302, or 303. Prerequisite: Credit or registration for Astronomy 301 or 307.","upper":false},{"key":"AST 104","name":"Undergraduate Astronomy Seminar","description":"Designed for astronomy majors. Discussions about current astronomical research, with different topics emphasized each semester. One lecture hour a week for one semester. May be repeated twice for credit when the topics vary. Offered on the pass/fail basis only.","upper":false},{"key":"AST 307","name":"Introductory Astronomy","description":"Introduction to astronomy for science and engineering students. The solar system, stars, galaxies, and cosmology. Three lecture hours a week for one semester. Only one of the following may be counted: Astronomy 301, 302, 303, 307. Prerequisite: Mathematics 305G or the equivalent or consent of instructor; high school trigonometry and physics are recommended.","upper":false},{"key":"AST 309 (TCCN: ASTR 1304)","name":"Topics in Astronomy for Nonscience Students","description":"Selected topics in modern astronomy: solar system, galaxies, peculiar stars, cosmology, and others. Three lecture hours a week for one semester. May not be counted toward a degree in the College of Natural Sciences. May be repeated for credit when the topics vary. Prerequisite: Astronomy 301, 302, 303, or consent of instructor.","upper":false},{"key":"AST 309G","name":"Popular Astronomy for Nonscience Students","description":"Restricted to non-College of Natural Science majors. Survey of topics of interest to the public and the media, including new planets, neutron stars, supernovae, gamma-ray bursts, black holes, dark matter, dark energy, and the origin of the universe. Three lecture hours a week for one semester. Only one of the following may be counted: Astronomy 309 (Topic 1), 309G. May not be counted toward a degree in the College of Natural Sciences. Prerequisite: One of the following: Astronomy 301, 302, 303, or consent of instructor.","upper":false},{"key":"AST 309L","name":"Search for Extraterrestrial Life","description":"For nonscience majors. Origin of life in the solar system, existence of other planetary systems, possibilities and techniques for detection of and communication with other intelligences. Three lecture hours a week for one semester. May not be counted toward a degree in the College of Natural Sciences. Prerequisite: Astronomy 301, 302, 303, or consent of instructor. Students must register for this course with the coordinator in the department's Student Office.","upper":false},{"key":"AST 309N","name":"Lives and Deaths of Stars","description":"For nonscience majors. How stars live and die; extremes of stars and their life cycles. Exotic objects such as white dwarfs, supernovae, neutron stars, pulsars, and black holes. Specific topics may vary with instructor. Three lecture hours a week for one semester. Astronomy 309N and 309Q may not both be counted. May not be counted toward a degree in the College of Natural Sciences. Prerequisite: Astronomy 301, 302, 303, or consent of instructor.","upper":false},{"key":"AST 309P","name":"Astronomy in Science Fiction","description":"The use of astronomy and other sciences in science fiction literature. Critical analysis of selected novels as to the validity of the astronomy used. Three lecture hours a week for one semester. Prerequisite: Astronomy 301, 302, 303, or consent of instructor.","upper":false},{"key":"AST 309Q","name":"Time and the Cosmos","description":"For nonscience majors. From the beginning of time in the Big Bang to the end of time in the black hole. Includes the early universe, the formation and evolution of single and double stars, and the supercompact objects they eventually become: white dwarfs, pulsars, and black holes. Three lecture hours a week for one semester. Astronomy 309N and 309Q may not both be counted; Astronomy 309Q and 309R may both be counted. May not be counted toward a degree in the College of Natural Sciences. Prerequisite: Astronomy 301, 302, 303, or consent of instructor.","upper":false},{"key":"AST 309S","name":"The Solar System","description":"For nonscience majors. The nature, origin, and evolution of our solar system, including planets, moons, and other bodies. Three lecture hours a week for one semester. May not be counted toward a degree in the College of Natural Sciences. Prerequisite: Astronomy 301, 302, 303, or consent of instructor.","upper":false},{"key":"AST 309T","name":"The Milky Way Galaxy","description":"Our spiral system of stars, gas, and dust; star formation. Three lecture hours a week for one semester. Prerequisite: Astronomy 301, 302, 303, or consent of instructor.","upper":false},{"key":"AST 321","name":"Current Problems in Astronomy","description":"For nonscience majors.  Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; and Astronomy 301, 302, 303, or consent of instructor.","upper":true},{"key":"AST 350L","name":"History and Philosophy of Astronomy","description":"Historical influence of astronomical concepts on social, economic, literary, and scientific life; the place of astronomy in society. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; and Astronomy 301, 302, 303, or consent of instructor.","upper":true},{"key":"AST 351","name":"Astronomical Instrumentation","description":"A hands-on course in computer-controlled optical instrumentation. Intended for natural science and engineering students interested in the practical aspects of instrument design and construction. Includes optics and optical design, electronics, machining and mechanical design, and computer interfacing. Students work in groups and as teams to design a computer-controlled optical instrument. The equivalent of three lecture hours a week for one semester. Prerequisite: Upper-division standing in the College of Natural Sciences or the Cockrell School of Engineering, or consent of instructor.","upper":true},{"key":"AST 352K","name":"Stellar Astronomy","description":"Properties of stars and starlight: principles of radiation; interpretation of stellar spectra. Observational techniques such as photometry, spectroscopy, and telescopes and detectors; variable stars; binary stars. Three lecture hours a week for one semester. Prerequisite: Physics 316 and 116L.","upper":true},{"key":"AST 152M","name":"Stellar Astronomy Laboratory","description":"An introduction to practical observational techniques in astronomy, designed for astronomy majors or advanced students in a physical science. Exercises on the spectroscopy, photometry, and positions of stars using a sixteen-inch telescope on campus. Three laboratory hours a week for one semester. With consent of instructor, may be repeated for credit. Prerequisite: Physics 316 and 116L; credit or registration for Astronomy 352K is recommended.","upper":true},{"key":"AST 353","name":"Astrophysics","description":"Survey of the physics of stellar and nonstellar radiation laws, stellar atmospheres and interiors; high-energy astrophysics. Three lecture hours a week for one semester. Prerequisite: Physics 316 and 116L.","upper":true},{"key":"AST 358","name":"Galaxies and the Universe","description":"Our galaxy and its constituents; stars and interstellar matter. Properties of other galaxies; galaxy interactions and mergers; expansion and evolution of the universe. Three lecture hours a week for one semester. Prerequisite: A major in science or engineering, or consent of instructor; and Physics 316 or the equivalent. Astronomy 307 or 352K is recommended.","upper":true},{"key":"AST 364","name":"Solar System Astronomy","description":"Modern studies of the solar system, including properties of the planets and smaller bodies, and the origin of planetary systems. Three lecture hours a week for one semester. Prerequisite: Physics 316 and 116L.","upper":true},{"key":"AST 367M","name":"Physical Science: Methods of Astronomy","description":"Same as Physical Science 367M. An introductory, self-paced course in the methods of astronomy that emphasizes learning astronomical principles through observations. Six laboratory hours a week for one semester. May not be counted toward the Bachelor of Arts, Plan I, degree with a major in astronomy. Prerequisite: Upper-division standing and nine semester hours of coursework in mathematics and/or science, including one of the following: Physical Science 303, 304, Astronomy 301, 302, 303. Equivalent preparation in mathematics, physics, chemistry, or earth sciences may be substituted with written approval of the instructor.","upper":true},{"key":"AST 376","name":"Special Topics in Advanced Astronomy","description":"Designed for science majors.  Three lecture hours a week for one semester. Up to six semester hours may be counted toward the major requirement for the Bachelor of Arts with a major in astronomy. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and consent of instructor. Additional prerequisites vary with the topic.","upper":true},{"key":"AST 376R","name":"A Practical Introduction to Research Methods","description":"Restricted to science and engineering majors. Practical exercises including analysis of imaging data, visualization, programming exercises with IDL, statistical analyses, and training for papers and oral presentations. Three lecture hours a week for one semester. Astronomy 376 (Topic: Practical Intro to Research) and 376R may not both be counted. Prerequisite: Upper-division standing, or consent of adviser, or participation in the College of Natural Sciences Freshman Research Initiative program; and Mathematics 305G, or the equivalent, or consent of instructor; prior computing experience and an introductory astronomy course are recommended.","upper":true},{"key":"AST 379H","name":"Honors Tutorial Course","description":"Restricted to science majors approved to graduate with honors. Research project and thesis for students electing to take the honors program in astronomy. Conference course. May be repeated once for credit. Prerequisite: Consent of the departmental honors adviser.","upper":true}]