[{"key":"ARA 601C","name":"Intensive Arabic I","description":"Not open to native speakers of Arabic. First semester of intensive Arabic language instruction. Six lecture hours a week for one semester. Only one of the following may be counted: Arabic 601C, 506, 508. Arabic 601C and 106C may not both be counted.","upper":false},{"key":"ARA 305","name":"Arabic Tutorial","description":"The basics of the Arabic language. Individual instruction. May not be used to fulfill the foreign language requirement for any bachelor's degree. Prerequisite: Consent of the faculty coordinator.","upper":false},{"key":"ARA 506 (TCCN: ARAB 1511)","name":"First-Year Arabic I","description":"Not open to native speakers of Arabic. First semester of Arabic language instruction. Five lecture hours a week for one semester. Only one of the following may be counted: Arabic 601C, 506, 508. Prerequisite: Credit or registration for Arabic 106C.","upper":false},{"key":"ARA 106C","name":"Conversation for First-Year Arabic I","description":"Not open to native speakers of Arabic.  One lecture hour a week for one semester. Arabic 601C and 106C may not both be counted. Prerequisite: Credit or registration for Arabic 506.","upper":false},{"key":"ARA 507 (TCCN: ARAB 1512)","name":"First-Year Arabic II","description":"Not open to native speakers of Arabic. Continuation of Arabic 506. Five lecture hours a week for one semester. Only one of the following may be counted: Arabic 507, 509, 611C. Prerequisite: Arabic 506 and 106C with a grade of at least C in each, and credit or registration for Arabic 107C.","upper":false},{"key":"ARA 107C","name":"Conversation for First-Year Arabic II","description":"Not open to native speakers of Arabic.  One lecture hour a week for one semester. Arabic 107C and 611C may not both be counted. Prerequisite: Arabic 506 and 106C with a grade of at least C in each, and credit or registration for Arabic 507.","upper":false},{"key":"ARA 508","name":"Modern Standard Arabic I","description":"Designed to provide students with basic competence in Modern Standard Arabic, targeting the skills of speaking, reading, writing, and listening. Five lecture hours a week for one semester. Only one of the following may be counted: Arabic 601C, 506, 508.","upper":false},{"key":"ARA 509","name":"Modern Standard Arabic II","description":"Continuation of Arabic 508. Five lecture hours a week for one semester. Only one of the following may be counted: Arabic 507, 509, 611C. Prerequisite: Arabic 508 with a grade of at least C.","upper":false},{"key":"ARA 611C","name":"Intensive Arabic II","description":"Not open to native speakers of Arabic.  Six lecture hours a week for one semester. Arabic 611C and 512K may not both be counted. If taken in residence, only one of the following may be counted: Arabic 507, 509, 611C. If taken in residence, Arabic 107C and 611C may not both be counted. Prerequisite: Arabic 601C with a grade of at least C.","upper":false},{"key":"ARA 112C","name":"Conversation for Second-Year Arabic I","description":"Not open to native speakers of Arabic.  One lecture hour a week for one semester. Arabic 112C and 621K may not both be counted. Prerequisite: Arabic 507 and 107C with a grade of at least C in each, and credit or registration for Arabic 512K.","upper":false},{"key":"ARA 112D","name":"Conversation for Second-Year Arabic II","description":"Not open to native speakers of Arabic.  One lecture hour a week for one semester. Arabic 112D and 621L may not both be counted. Prerequisite: Arabic 112C and 512K with a grade of at least C in each, and credit or registration for Arabic 512L.","upper":false},{"key":"ARA 512K","name":"Second-Year Arabic I","description":"Not open to native speakers of Arabic.  Five lecture hours a week for one semester. Only one of the following may be counted: Arabic 512K, 413, 621K. Prerequisite: Arabic 507 and 107C with a grade of at least C in each, and credit or registration for Arabic 112C.","upper":false},{"key":"ARA 512L","name":"Second-Year Arabic II","description":"Not open to native speakers of Arabic. Continuation of Arabic 512K. Five lecture hours a week for one semester. Only one of the following may be counted: Arabic 512L, 414, 621L. Prerequisite: Arabic 112C and 512K with a grade of at least C in each, and credit or registration for Arabic 112D.","upper":false},{"key":"ARA 321","name":"Introduction to Arabic Dialects","description":"Introduction to Arabic as spoken throughout the Arab world. Three lecture hours a week for one semester. Prerequisite: Arabic 420K (or 320K) with a grade of at least C.","upper":true},{"key":"ARA 621K","name":"Intensive Arabic III","description":"Not open to native speakers of Arabic.  Six lecture hours a week for one semester. If taken in residence, only one of the following may be counted: Arabic 512K, 413, 621K. Arabic 112C and 621K may not both be counted. Prerequisite: Arabic 611C with a grade of at least C.","upper":true},{"key":"ARA 621L","name":"Intensive Arabic IV","description":"Not open to native speakers of Arabic.  Six lecture hours a week for one semester. If taken in residence, only one of the following may be counted: Arabic 512L, 414, 621L. Arabic 112D and 621L may not both be counted. Prerequisite: Arabic 621K with a grade of at least C.","upper":true},{"key":"ARA 322K","name":"Levantine Arabic","description":"Not open to native speakers of Arabic.  Three lecture hours a week for one semester. Prerequisite: Arabic 512L or 621L with a grade of at least C.","upper":true},{"key":"ARA 325K","name":"Egyptian Arabic","description":"Not open to native speakers of Arabic. Introduction to the Egyptian dialect of Arabic. Three lecture hours a week for one semester. Prerequisite: Arabic 512L or 621L with a grade of at least C.","upper":true},{"key":"ARA 327K","name":"Advanced Spoken Media Arabic I","description":"Development of the specialized vocabulary and skills needed in the media or public policy sectors of the Arab-speaking world. Three lecture hours a week for one semester. Prerequisite: Arabic 420L or 531L with a grade of at least B-.","upper":true},{"key":"ARA 327L","name":"Advanced Spoken Media Arabic II","description":"Development of the specialized vocabulary and skills needed in the media or public policy sectors of the Arab-speaking world. Three lecture hours a week for one semester. Prerequisite: Arabic 327K with a grade of at least B-.","upper":true},{"key":"ARA 130D","name":"Arabic across Disciplines","description":"Students read and discuss Arabic language materials related to the subject matter of another designated course. One lecture hour a week for one semester. No more than three semester hours may be counted toward the major in either Middle Eastern Studies or Middle Eastern Languages and Culture. May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"ARA 531K","name":"Intensive Arabic V","description":"Not open to native speakers of Arabic.  Five lecture hours a week for one semester. Arabic 320K, 420K and 531K may not both be counted. Arabic 120C and 531K may not both be counted. Prerequisite: Arabic 112D and 512L with a grade of at least C in each, or Arabic 621L with a grade of at least C.","upper":true},{"key":"ARA 531L","name":"Intensive Arabic VI","description":"Not open to native speakers of Arabic. Sixth semester of intensive Arabic language instruction. Five lecture hours a week for one semester. Arabic 320L, 420L and 531L may not both be counted. Arabic 120D and 531L may not both be counted. Prerequisite: Arabic 120C and 420K (or 320K) with a grade of at least C in each, or Arabic 531K with a grade of at least C.","upper":true},{"key":"ARA 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, followed by research and writing to produce a substantial paper. Conference course for two semesters. Prerequisite: For 679HA, admission to the Arabic Language and Literature Honors Program; for 679HB, Arabic 679HA.","upper":true}]