[{"key":"HEB 601C","name":"Intensive Hebrew I","description":"First semester of intensive Hebrew language instruction. Six lecture hours a week for one semester. Hebrew 601C and 506 may not both be counted. Hebrew 601C and 507 may not both be counted.","upper":false},{"key":"HEB 602C","name":"Intensive Biblical Hebrew I","description":"Introduction to biblical Hebrew, including basic lexicon and grammar. Emphasis on reading the Hebrew Bible; selected texts may include the Creation, the Tower of Babel, the binding of Isaac, the Joseph story, and the David and Goliath story. Six lecture hours a week for one semester. Hebrew 602C and 508 may not both be counted. Hebrew 602C and 509 may not both be counted.","upper":false},{"key":"HEB 506","name":"First-Year Hebrew I","description":"Not open to native speakers of Hebrew. Modern Israeli Hebrew, including the writing system, basic sentence structure, vocabulary, and simple conversation. Five lecture hours a week for one semester. Hebrew 601C and 506 may not both be counted.","upper":false},{"key":"HEB 507","name":"First-Year Hebrew II","description":"Not open to native speakers of Hebrew. Continuation of Hebrew 506. Five lecture hours a week for one semester. Hebrew 601C and 507 may not both be counted. Prerequisite: Hebrew 506 with a grade of at least C.","upper":false},{"key":"HEB 611C","name":"Intensive Hebrew II","description":"Second semester of intensive Hebrew language instruction. Six lecture hours a week for one semester. Hebrew 611C and 412K may not both be counted. Hebrew 611C and 412L may not both be counted. Prerequisite: Hebrew 601C or 507 with a grade of at least C.","upper":false},{"key":"HEB 612C","name":"Intensive Biblical Hebrew II","description":"Builds on material covered in Hebrew 602C. A thorough study of biblical Hebrew grammar, with emphasis on the verb system and the rules of sentence structure. Selected texts include biblical chapters of a poetic, legal, and prophetic nature such as: the Ten Commandments; chapters from the Book of Leviticus; Psalms 23, 27, and 121; Proverbs 8 and 10; Isaiah 53; and Jeremiah 31. Six lecture hours a week for one semester. Hebrew 612C and 313K may not both be counted. Hebrew 612C and 313L may not both be counted. Prerequisite: Hebrew 602C with a grade of at least C.","upper":false},{"key":"HEB 412K","name":"Second-Year Hebrew I","description":"Not open to native speakers of Hebrew. Modern Israeli Hebrew. Continuation of Hebrew 507 with expanded grammar and conversation. Four lecture hours a week for one semester. Hebrew 611C and 312K, 412K may not both be counted. Prerequisite: Hebrew 507 with a grade of at least C.","upper":false},{"key":"HEB 412L","name":"Second-Year Hebrew II","description":"Not open to native speakers of Hebrew. Continuation of Hebrew 412K, with emphasis on conversation and composition. Four lecture hours a week for one semester. Hebrew 611C and 312L, 412L may not both be counted. Prerequisite: Hebrew 412K (or 312K) with a grade of at least C.","upper":false},{"key":"HEB 320K","name":"Hebrew via Popular Culture","description":"Three lecture hours a week for one semester. Hebrew 320K and 346 (Topic 7: Hebrew via Popular Culture) may not both be counted. Prerequisite: Hebrew 611C or 412l (or 312L) with a grade of at least C.","upper":true},{"key":"HEB 320L","name":"Hebrew through the Media","description":"Three lecture hours a week for one semester. Hebrew 346 (Topic: Hebrew through the Media) and 320L may not both be counted. Prerequisite: Hebrew 320K (or 346, Topic 7: Hebrew through Popular Culture) with a grade of at least C.","upper":true},{"key":"HEB 130D","name":"Hebrew across Disciplines","description":"Students read and discuss Hebrew language materials related to the subject matter of another designated course. One lecture hour a week for one semester. No more than three semester hours may be counted toward the major in either Middle Eastern Studies or Middle Eastern Languages and Culture. May be repeated for credit. Prerequisite: Upper-division standing, Hebrew 611C or 412L, and consent of instructor.","upper":true},{"key":"HEB 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, followed by research and writing to produce a substantial paper. Conference course for two semesters. Must be taken for special honors in addition to the major requirement. Prerequisite: For 679HA, upper-division standing and admission to the Hebrew Language and Literature Honors Program; for 679HB, Hebrew 679HA with a grade of A.","upper":true}]