[{"key":"STA 309","name":"Elementary Business Statistics","description":"Restricted to students in the McCombs School of Business. Training in the use of data to gain insight into business problems; describing distributions (center, spread, change, and relationships), producing data (experiments and sampling), probability and inference (means, proportions, differences, regression and correlation). Three lecture hours a week for one semester. Only one of the following may be counted: Economics 329, Statistics 309, 309H. Prerequisite: Mathematics 408D, 408L, or 408S.","upper":false},{"key":"STA 309H","name":"Elementary Business Statistics: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Training in the use of data to gain insight into business problems; describing distributions (center, spread, change, and relationships), producing data (experiments and sampling), probability and inference (means, proportions, differences, regression and correlation). Three lecture hours a week for one semester. Only one of the following may be counted: Economics 329, Statistics 309, 309H. Prerequisite: Twenty-four semester hours of college credit, including Mathematics 408D, 408L, or 408S.","upper":false},{"key":"STA 371G","name":"Statistics and Modeling","description":"Restricted to students in a McCombs School of Business major. Focuses on methods used to model and analyze data. Explores multiple regression models and their application in the functional areas of business, time-series models, decision analysis and the value of information, and simulation-based methods. Three lecture hours a week for one semester. Only one of the following may be counted: Statistics 371G, 371H, 375, 375H. Prerequisite: Management Information Systems 301, 301H, or 310; Statistics 309 or 309H; and credit or registration for Business Administration 324 or 324H.","upper":true},{"key":"STA 371H","name":"Statistics and Modeling: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Focuses on methods used to model and analyze data. Explores multiple regression models and their application in the functional areas of business, time-series models, decision analysis and the value of information, and simulation-based methods. Three lecture hours a week for one semester. Only one of the following may be counted: Statistics 371G, 371H, 375, 375H. Prerequisite: Management Information Systems 301, 301H, or 310; Mathematics 408D, 408L, 408M or 408S; Statistics 309 or 309H; and credit or registration for Business Administration 324 or 324H.","upper":true},{"key":"STA 372","name":"Topics in Statistics","description":"Restricted to students in the McCombs School of Business.  Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and Statistics 309 with a grade of at least C-.","upper":true},{"key":"STA 375","name":"Statistics and Modeling for Finance","description":"Restricted to students in the McCombs School of Business. Methods used to model and analyze data, especially as applied to problems related to finance. Explores regression models, time-series models, decision analysis and simulation-based methods. Three lecture hours a week for one semester. Only one of the following may be counted: Statistics 371G, 371H, 375, 375H. Prerequisite: Management Information Systems 301, 301H, or 310; Mathematics 408D, 408L, 408M or 408S; Statistics 309 or 309H; and credit or registration for Business Administration 324 or 324H.","upper":true},{"key":"STA 375H","name":"Statistics and Modeling for Finance: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Methods used to model and analyze data, especially as applied to problems related to finance. Explores regression models, time-series models, decision analysis and simulation-based methods. Three lecture hours a week for one semester. Only one of the following may be counted: Statistics 371G, 371H, 375, 375H. Prerequisite: Management Information Systems 301, 301H, or 310; Mathematics 408D, 408L, 408M or 408S; Statistics 309 or 309H; and credit or registration for Business Administration 324 or 324H.","upper":true},{"key":"STA 376","name":"Intermediate Statistics","description":"Restricted to students in a business major. Analysis of forecasting techniques and theory; macroeconomic models; long-range and short-term forecasting; forecasting for the firm, using case material. Three lecture hours a week for one semester. Prerequisite: Statistics 309 or 309H.","upper":true}]