[{"key":"ISL 310","name":"Introduction to Islam","description":"Same as Asian Studies 301M (Topic 15), History 306N (Topic 7),  and Religious Studies 319. The beliefs, theology, history, and main social and legal institutions of Islam, including the concept of God and society, the role of women, and Islamic government and movements. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 301M (Topic 15), History 306N (Topic 7), Islamic Studies 310, Middle Eastern Studies 310 (Topic 1: Introduction to Islam), Religious Studies 319.","upper":false},{"key":"ISL 311","name":"Topics in Islamic Studies","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"ISL 340","name":"Topics in Islam","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"ISL 369","name":"Conference Course in Islamic Studies","description":"Supervised individual study of selected problems in Islamic studies. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"ISL 372","name":"Topics in Islamic Cultures","description":"Three lecture hours a week for one semester; additional hours may be required for some topics. Islamic Studies 372 and 373 may not both be counted unless the topics vary. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"ISL 373","name":"Topics in Middle Eastern Islamic Cultures","description":"Three lecture hours a week for one semester; additional hours may be required for some topics. Islamic Studies 372 and 373 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"ISL 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, following by research and writing to produce a substantial paper on a specific topic in Islamic studies to be completed during the second semester. Conference course for two semesters. Prerequisite: For 679HA, upper-division standing and admission to the Islamic Studies Honors Program; for 679HB, Islamic Studies 679HA.","upper":true}]