[{"key":"MES 301L","name":"Introduction to the Middle East: Adjustment and Change in Modern Times","description":"Same as Government 314 (Topic 3: Introduction to the Middle East: Adjustment and Change in Modern Times) and History 306N (Topic 5: Introduction to the Middle East: Adjustment and Change in Modern Times). The responses of the societies of the Middle East and North Africa (Turkey, Iran, Afghanistan, Israel, and the Arab world) to Western cultural and political challenges, primarily since about 1800. Three lecture hours a week for one semester.","upper":false},{"key":"MES 310","name":"Topics in Middle Eastern Studies","description":"Studies of areas and issues in the Middle East and North Africa. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"MES 127","name":"Middle Eastern Cultural Exchange","description":"Provides an opportunity for students to interact with peer groups in Middle Eastern countries in which Arabic, Hebrew, Persian, and Turkish are spoken. Students engage in a variety of cultural activities and correspond with peer groups via blogs and Internet discussion forums. One lecture hour a week for one semester.  Offered on the pass/fail basis only. Prerequisite: Upper-division standing.","upper":true},{"key":"MES 331C","name":"History of the Ottoman Empire","description":"Same as History 331C. A survey of Ottoman society and culture and of the empire's place on the world scene. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"MES 341","name":"Topics in the Middle East: Social Science","description":"Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: Middle Eastern Studies 320, 321K, 322K, 323K, 324K, 325, 326, 328, 341. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"MES 342","name":"Topics in the Middle East: Arts and Humanities","description":"Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: Middle Eastern Studies 320, 321K, 322K, 323K, 324K, 325, 326, 328, 342. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"MES 343","name":"Topics in the Middle East: History","description":"Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: Middle Eastern Studies 320, 321K, 322K, 323K, 324K, 325, 326, 328, 343. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"MES 351","name":"Mediterranean Crossroads Seminar","description":"Reading and discussion about the lands, cultures, and societies of the eastern Mediterranean from a variety of disciplinary perspectives. Students prepare to study in the Middle East (in Middle Eastern Studies 352) and begin work on their individual research projects. Three lecture hours a week for one semester. Offered in the spring semester only. Middle Eastern Studies 322K (Topic: Mediterranean Crossroads Seminar) and 351 may not both be counted. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"MES 352","name":"Mediterranean Crossroads Study Abroad Seminar","description":"Students study and conduct research in the Middle East. The equivalent of three lecture hours a week for one semester. Offered in the summer session only. Middle Eastern Studies 322K (Topic: Mediterranean Crossroads Study Abroad Seminar) and 352 may not both be counted. Prerequisite: Middle Eastern Studies 351.","upper":true},{"key":"MES 353","name":"Mediterranean Crossroads Conference Course","description":"Under supervision of a faculty member, students complete their research projects following participation in Middle Eastern Studies 352. Conference course. Offered in the fall semester only. Prerequisite: Middle Eastern Studies 352.","upper":true},{"key":"MES 360","name":"Conference Course","description":"Supervised individual research, discussion, and writing of papers about various general and specialized Middle Eastern subjects. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"MES 370","name":"Practicum: Internships in Applied Middle Eastern Studies","description":"Research and staff experience working in an appropriate agency or business. At least six but no more than nine hours of work a week for one semester. May not be repeated for credit. Prerequisite: Completion of at least seventy semester hours of coursework, including twelve hours of Middle Eastern studies, and consent of the undergraduate adviser.","upper":true},{"key":"MES 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, followed by research and writing to produce a substantial paper on a special topic in middle eastern studies, to be completed during the second semester. Conference course for two semesters. Prerequisite: For 679HA, admission to the Middle Eastern Studies Honors Program; for 679HB, Middle Eastern Studies 679HA.","upper":true}]