[{"key":"PRS 601C","name":"Intensive Persian I","description":"First semester of intensive Persian language instruction. Six lecture hours a week for one semester. Persian 601C and 506 may not both be counted. Persian 601C and 507 may not both be counted.","upper":false},{"key":"PRS 506","name":"First-Year Persian I","description":"Elementary colloquial Persian. Five lecture hours a week for one semester. Persian 601C and 506 may not both be counted.","upper":false},{"key":"PRS 507","name":"First-Year Persian II","description":"Continuation of Persian 506. Elementary literary Persian. Five lecture hours a week for one semester. Persian 601C and 507 may not both be counted. Prerequisite: Persian 506 with a grade of at least C.","upper":false},{"key":"PRS 611C","name":"Intensive Persian II","description":"Second semester of intensive Persian language instruction. Six lecture hours a week for one semester. Only one of the following may be counted: Persian 611C, 612C,512K. Only one of the following may be counted: Persian 611C, 612C, 512L. Prerequisite: Persian 601C or 507 with a grade of at least C.","upper":false},{"key":"PRS 612C","name":"Intensive Persian for Heritage Speakers","description":"Designed for heritage Persian language speakers who have had little or no formal instruction in the language. Six lecture hours a week for one semester. Only one of the following may be counted: Persian 611C, 612C, 512K. Only one of the following may be counted: Persian 611C, 612C, 512L.","upper":false},{"key":"PRS 512K","name":"Second-Year Persian I","description":"Not open to native speakers of Persian.  Five lecture hours a week for one semester. Only one of the following may be counted: Persian 611C, 612C, 312K, 512K. Prerequisite: Persian 507 with a grade of at least C.","upper":false},{"key":"PRS 512L","name":"Second-Year Persian II","description":"Not open to native speakers of Persian. Continuation of Persian 512K. Five lecture hours a week for one semester. Only one of the following may be counted: Persian 611C, 612C, 512L. Prerequisite: Persian 512K  with a grade of at least C.","upper":false},{"key":"PRS 322K","name":"Intermediate Persian I","description":"Not open to native speakers of Persian. First semester of intermediate Persian language instruction. Three lecture hours a week for one semester. Prerequisite: Persian 611C, 612C, or 512L with a grade of at least C.","upper":true},{"key":"PRS 322L","name":"Intermediate Persian II","description":"Not open to native speakers of Persian. Second semester of intermediate Persian language instruction. Three lecture hours a week for one semester. Prerequisite: Persian 322K with a grade of at least C.","upper":true},{"key":"PRS 130D","name":"Persian across Disciplines","description":"Students read and discuss Persian language materials related to the subject matter of another designated course. One lecture hour a week for one semester. No more than three semester hours may be counted toward the major in either Middle Eastern Studies or Middle Eastern Languages and Culture. May be repeated for credit. Prerequisite: Upper-division standing, Persian 322L, and consent of instructor.","upper":true},{"key":"PRS 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, followed by research and writing to produce a substantial paper. Conference course for two semesters. Prerequisite: For 679HA, upper-division standing and admission to the Persian Language and Literature Honors Program; for 679HB, Persian 679HA.","upper":true}]