[{"key":"TUR 601C","name":"Intensive Turkish I","description":"First semester of intensive Turkish language instruction. Six lecture hours a week for one semester. Turkish 601C and 506 may not both be counted. Turkish 601C and 507 may not both be counted.","upper":false},{"key":"TUR 506","name":"First-Year Turkish I","description":"Modern Standard Turkish. Five lecture hours a week for one semester. Turkish 601C and 506 may not both be counted.","upper":false},{"key":"TUR 507","name":"First-Year Turkish II","description":"Modern Standard Turkish. Continuation of Turkish 506. Five lecture hours a week for one semester. Turkish 601C and 507 may not both be counted. Prerequisite: Turkish 506 with a grade of at least C.","upper":false},{"key":"TUR 611C","name":"Intensive Turkish II","description":"Second semester of intensive Turkish language instruction. Six lecture hours a week for one semester. Turkish 611C and 412K may not both be counted. Turkish 611C and 412L may not both be counted. Prerequisite: Turkish 601C or 507 with a grade of at least C.","upper":false},{"key":"TUR 412K","name":"Second-Year Turkish I","description":"Conversational Turkish and readings in contemporary Turkish literature and newspapers. Review of the grammar covered in Turkish 506 and 507, and introduction of more complex grammatical patterns. Four lecture hours a week for one semester. Turkish 611C and 412K may not both be counted. Prerequisite: Turkish 601C or 507 with a grade of at least C.","upper":false},{"key":"TUR 412L","name":"Second-Year Turkish II","description":"Continuation of Turkish 412K. Four lecture hours a week for one semester. Turkish 611C and 412L may not both be counted. Prerequisite: Turkish 412K with a grade of at least C.","upper":false},{"key":"TUR 320K","name":"Intermediate Turkish I","description":"Not open to native speakers of Turkish. Intermediate to high-level Turkish in four basic language skills: speaking, listening, reading, and writing. Turkish culture. Three lecture hours a week for one semester. Prerequisite: Turkish 611C or 412L with a grade of at least C.","upper":true},{"key":"TUR 320L","name":"Intermediate Turkish II","description":"Not open to native speakers of Turkish. Continuation of Turkish 320K. Three lecture hours a week for one semester. Prerequisite: Turkish 320K with a grade of at least C.","upper":true},{"key":"TUR 325K","name":"Advanced Turkish I","description":"Restricted to nonnative speakers of Turkish.  Three lecture hours a week for one semester. Turkish 325K and 329 (Topic: Advanced Turkish I) may not both be counted. Prerequisite: Turkish 320L with a grade of at least C.","upper":true},{"key":"TUR 325L","name":"Advanced Turkish II","description":"Restricted to nonnative speakers of Turkish. Advanced Turkish language instruction. Three lecture hours a week for one semester. Turkish 325L and 329 (Topic: Advanced Turkish II) may not both be counted. Prerequisite: Turkish 325K or the equivalent.","upper":true},{"key":"TUR 130D","name":"Turkish across Disciplines","description":"Students read and discuss Turkish language materials related to the subject matter of another designated course. One lecture hour a week for one semester. No more than three semester hours may be counted toward the major in either Middle Eastern Studies or Middle Eastern Languages and Culture. May be repeated for credit. Prerequisite: Upper-division standing, Turkish 320L, and consent of instructor.","upper":true},{"key":"TUR 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, followed by research and writing to produce a substantial paper. Conference course for two semesters. Prerequisite: For 679HA, admission to the Turkish Language and Literature Honors Program; for 679HB, Turkish 679HA.","upper":true}]