[{"key":"BCH 339F","name":"Foundations of Biochemistry","description":"Restricted to biochemistry majors. Metabolism of carbohydrates, lipids, amino acids, and nucleotides; structure and function of proteins. Three lecture hours a week for one semester. Only one of the following may be counted: Biochemistry 339F, 369, Biology 337 (Topic: Foundations of Biochemistry), Chemistry 339K, 369. Prerequisite: One of the following with a grade of at least C-: Chemistry 310M, 318M, 320M, or 328M.","upper":true},{"key":"BCH 339J","name":"Chemical and Synthetic Biology","description":"Designed for students pursuing pharmaceutical and biotechnology careers. Topics include enzymatic reaction mechanisms and how they can be manipulated using tools from both chemistry and molecular biology. Three lecture hours a week for one semester. Only one of the following may be counted: Biochemistry 339J, Chemistry 339J, Systems and Synthetic Biology 339J. Prerequisite: Biochemistry 339F or Chemistry 339K with a grade of at least C-.","upper":true},{"key":"BCH 339M","name":"Structure and Function of Molecular Machines","description":"Function of proteins and protein complexes as machines in the cell, including the interaction of proteins with nucleic acids, synthesis of proteins, and degradation of proteins. Three lecture hours per week for one semester. Prerequisite: Biochemistry 339F or Chemistry 339K with a grade of at least C-.","upper":true},{"key":"BCH 339N","name":"Systems Biology and Bioinformatics","description":"Restricted to biochemistry majors. Understanding how the cell works as a system with emphasis on the methods used to gather and analyze data and develop/test models of systems level data. Three lecture hours a week for one semester. Prerequisite: Biochemistry 339F or Chemistry 339K with a grade of at least C-.","upper":true},{"key":"BCH 364C","name":"Bioinformatics","description":"Restricted to biochemistry majors. Subjects include physical methods for the study of macromolecules, chemistry of proteins, enzyme chemistry, regulatory mechanisms for gene expression, and protein-nucleic acid interactions. Three lecture hours a week for one semester. Only one of the following may be counted: Biochemistry 364C, Chemistry 364C, Systems and Synthetic Biology 364C. Prerequisite: Biochemistry 339F or Chemistry 339K with a grade of at least B, and consent of instructor.","upper":true},{"key":"BCH 364D","name":"Macromolecular Structure Determination","description":"Restricted to biochemistry majors. Emphasis on X-ray crystallography and nuclear magnetic resonance (NMR) spectroscopy of proteins. Investigation of theories and practices of the most relevant techniques in macromolecular structure determination. Use of the X-ray and NMR facilities to collect data that is used to solve protein structures. Three lecture hours a week for one semester. Biochemistry 364D and Chemistry 364D may not both be counted. Prerequisite: The following with a grade of at least B in each: Biochemistry 339F or Chemistry 339K, Biochemistry 370 or Chemistry 370, and consent of instructor.","upper":true},{"key":"BCH 364E","name":"Systems Biology","description":"Restricted to biochemistry majors. Survey of current high-throughput technologies and computational methods for generating data and integrating information at all levels of biological organization. Emphasis on how hypotheses can be generated and tested with these techniques to better understand how model organisms function and evolve. Three lecture hours a week for one semester. Biochemistry 364E and Chemistry 364E may not both be counted. Prerequisite: Biochemistry 339 or Chemistry 339K with a grade of at least B, and consent of instructor.","upper":true},{"key":"BCH 364F","name":"Astrobiology","description":"Restricted to biochemistry majors. An overview of the science used in the search for extraterrestrial life, life origins, earth history, evolution, metabolism of extremophiles, biochemistry, and astronomy. Three lecture hours a week for one semester. Biochemistry 364F and Chemistry 364F may not both be counted. Prerequisite: Biochemistry 339F or Chemistry 339K with a grade of at least B, and consent of instructor.","upper":true},{"key":"BCH 365D","name":"Structure and Function of Proteins and Nucleic Acids","description":"Restricted to biochemistry majors. Exploration of the structures and functions of proteins and nucleic acids, utilizing quantitative methods to evaluate the roles of structural features in function, and developing new ways of thinking about the dynamics of macromolecules. Three lecture hours a week for one semester. Biochemistry 365D and Chemistry 365D may not both be counted. Prerequisite: The following with a grade of at least B: Biochemistry 339F or Chemistry 339K, Biochemistry 370 or Chemistry 370, and consent of instructor.","upper":true},{"key":"BCH 369","name":"Fundamentals of Biochemistry","description":"The basics of protein structure and function, carbon and nitrogen metabolism, and molecular biology of macromolecules. Three lecture hours a week for one semester. Only one of the following may be counted: Biochemistry 339F, 369, Biology 337 (Topic: Foundations of Biochemistry), Chemistry 339K, 369. May not be counted toward a degree in biochemistry. Prerequisite: One of the following with a grade of at least C-: Chemistry 310M, 318M, 320M, or 328M.","upper":true},{"key":"BCH 369K","name":"Techniques of Research","description":"Advanced laboratory practice and introduction to research. One lecture hour and six laboratory hours a week for one semester. May be taken for a letter grade no more than twice. No more than six semester hours may be counted toward a degree in biochemistry. May be repeated for credit. Prerequisite: Six semester hours of upper-division coursework in biochemistry or chemistry, or five semester hours of coursework in organic chemistry, or consent of the undergraduate faculty adviser in biochemistry.","upper":true},{"key":"BCH 369L","name":"Biochemistry Laboratory","description":"An introduction to modern fundamental techniques of biochemistry. Two lecture hours and seven laboratory hours a week for one semester. Biochemistry 369L and Chemistry 369L may not both be counted. Prerequisite: Biochemistry 339F or Chemistry 339K with a grade of at least C-.","upper":true},{"key":"BCH 369T","name":"Biotechnology Laboratory","description":"Advanced techniques in biotechnology. Nine laboratory hours a week for one semester. Biochemistry 369T and Chemistry 369T may not both be counted. Prerequisite: Consent of instructor.","upper":true},{"key":"BCH 370","name":"Physical Methods of Biochemistry","description":"Theory of electrophoresis, ultracentrifugation, spectroscopy, electron microscopy, and diffraction as applied to biological macromolecules. Three lecture hours a week for one semester. Biochemistry 370 and Chemistry 370 may not both be counted. Prerequisite: Biochemistry 339F or Chemistry 339K with a grade of at least C-.","upper":true},{"key":"BCH 379H","name":"Biochemistry Honors Tutorial Course","description":"Laboratory research project in a specific field of biochemistry under the supervision of one or more faculty members. Conference course. May be repeated once for credit. Must be taken in addition to the required hours for a degree in biochemistry. Students must enroll no later than the first semester of the year of graduation. May be repeated for credit. Prerequisite: Consent of the research supervisor and the departmental honors adviser.","upper":true}]