[{"key":"PBH 317","name":"Introduction to Public Health","description":"Same as Biology 317. Overview and basic principles of public health, including the public health system, concepts and tools for measuring health in populations, the relationship between public health and the medical care system, and the role of law and government in public health. Three lecture hours a week for one semester.","upper":false},{"key":"PBH 334","name":"Global Health","description":"An investigation of global health issues, including the principles of global health, the burden of morbidity and mortality, health determinants, health care and public health systems, socioeconomic development, and human rights. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Public Health 354; and Biology 328M or Statistics and Scientific Computation 328M.","upper":true},{"key":"PBH 338","name":"Environmental Health","description":"Introduction to the major areas of environmental health, including hazards in the environment, the effects of environmental contaminants, and various approaches to addressing major environmental health problems. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Public Health 354; and Biology 328M or Statistics and Scientific Computation 328M.","upper":true},{"key":"PBH 341R","name":"Public Health Research","description":"Same as Biology 341R. Students conduct public health research, mentored by professionals at public health practice agencies or faculty at graduate schools of public health throughout Texas. An average of twelve hours of fieldwork a week for a total of at least 180 hours.  May be repeated for credit. Prerequisite: Biology 325 or 325H with a grade of at least C-; students must also submit a proposal to the instructor.","upper":true},{"key":"PBH 354","name":"Epidemiology","description":"Introduction to basic principles and concepts in epidemiology, including descriptive epidemiology, association and causation, basic epidemiological study design, evidence-based decision analysis, and applications of epidemiology methods to basic and clinical science. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H, and Public Health 317 with a grade of at least C- in each; and credit or registration for Biology 328M or Statistics and Data Sciences 328M (or Statistics and Scientific Computation 328M).","upper":true},{"key":"PBH 358D","name":"Health Policy and Health Systems","description":"Covers the essentials of health policy and law, including the ways that policy and legal issues impact health care and public health systems. Three lecture hours a week for one semester. Public Health 358D and Sociology 358D may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Public Health 354; and Biology 328M or Statistics and Scientific Computation 328M.","upper":true},{"key":"PBH 368D","name":"Social Context of Public Health","description":"An introduction to the social and behavioral theories that inform the discipline of public health, including practical examples of the ways that these theories are used to understand health-related behaviors and health promotion. Includes data on population distributions of mortality and morbidity, health inequalities, and how underlying social structures impact the health of individuals and communities. Three lecture hours a week for one semester. Public Health 368D and Sociology 368D may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Public Health 354; and Biology 328M or Statistics and Scientific Computation 328M.","upper":true}]