[{"key":"I B 320F","name":"Foundations of International Business","description":"Restricted to non-McCombs School of Business majors. Fundamentals of international trade and the international economy; international dimensions of several functional areas of business, including management, marketing, finance, and human resource management; theoretical, institutional, and functional foundations of international business. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Business Administration degree.  Only one of the following courses may be counted:  Economics 339K, European Studies 348 (Topic 2: International Trade), International Business 320F or 350. Prerequisite: Upper-division standing.","upper":true},{"key":"I B 350","name":"International Trade","description":"Same as European Studies 348 (Topic 2). Study of the principles, policies, and problems of the international exchange of goods and investments. Three lecture hours a week for one semester. Only one of the following may be counted:  Economics 339K, European Studies 348 (Topic 2), International Business 320F, 350. Prerequisite: Upper-division standing.","upper":true},{"key":"I B 372","name":"Seminar in International Business","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites vary with the topic and are given in the Course Schedule.","upper":true},{"key":"I B 378","name":"International Business Operations","description":"Restricted to students in a McCombs School of Business major. Establishment and conduct of international business operations: trade, investments, branch and subsidiary management, intermediary functions; case studies in international enterprise. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; at least seventy-five semester hours of coursework, including Economics 339K or International Business 350; and credit or registration for one of the following: Accounting 353J, 366P, Business Administration 353, 353H, Finance 353, 366P, Management 353, (366P), Management Information Systems 353, 366P, Marketing 353, 366P, Operations Management 353, 366P.","upper":true}]