[{"key":"SPN 301","name":"Spanish for Graduate Students in Other Departments","description":"For graduate students in other departments seeking to fulfill degree language requirements. No auditors. Purpose: To introduce fundamentals of grammar and lexicon to enable students to read texts in their areas of specialization. Primary aim: To allow students to acquire reading proficiency. Also presents audio-aural aspect. Three class hours a week for one semester. Offered every fall semester. May not be used to fulfill the undergraduate foreign language requirement. Offered on the letter-grade basis only. Prerequisite: Graduate standing.","upper":false},{"key":"SPN 601D","name":"Introductory Spanish","description":"Six-hour course focused on the development of multilingual literacy through the analysis and use of Spanish to achieve linguistic competence (basic verb tenses, pronouns, adjectives, conditional statements), communication and interactional competence (complimenting, thanking, requesting, giving opinions), and metalinguistic competence (parts of speech, sociolinguistic cues). Six lecture hours a week for one semester. Only one of the following may be counted: Spanish 601D, 604, 506. Only one of the following may be counted: Spanish 601D, 604, 507, 508K.","upper":false},{"key":"SPN 303S","name":"Spanish for Professional Purposes","description":"Designed for students in a variety of disciplines who require basic Spanish language skills while studying abroad. Three lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. May not be counted toward a major in Spanish.","upper":false},{"key":"SPN 604","name":"Accelerated Introductory Spanish for Heritage Learners","description":"Designed primarily for students who have a cultural and linguistic connection to Spanish. Six lecture hours a week for one semester. Only one of the following may be counted: Spanish 601D, 604, 506. Only one of the following may be counted: Spanish 601D, 604, 507, 508K. Spanish 604 and 610D may not both be counted.","upper":false},{"key":"SPN 305","name":"Spanish for Graduate Students in Other Departments","description":"No auditors. Continuation of Spanish 301. Vocabulary and grammar expansion through intense practice in reading texts according to class interests; increased emphasis on the audio-aural aspect. Three lecture hours a week for one semester. Offered every spring semester. May not be used to fulfill the undergraduate foreign language requirement. Offered on the letter-grade basis only. Prerequisite: Graduate standing, and Spanish 301 or consent of instructor.","upper":false},{"key":"SPN 506 (TCCN: SPAN 1511)","name":"First-Year Spanish I","description":"Designed for students who have not previously studied any Spanish.  Five lecture hours a week for one semester. Only one of the following may be counted: Spanish 601D, 604, 506.","upper":false},{"key":"SPN 507 (TCCN: SPAN 1512)","name":"First-Year Spanish II","description":"Five lecture hours a week for one semester. Only one of the following may be counted: Spanish 601D, 604, 507, 508K. Prerequisite: Spanish 506 with a grade of at least C.","upper":false},{"key":"SPN 508K","name":"Alternate First-Year Spanish II","description":"An accelerated review of grammatical structures covered in Spanish 506, followed by study of the new material covered in Spanish 507. Five lecture hours a week for one semester. Only one of the following may be counted: Spanish 601D, 604, 507, 508K. Prerequisite: Transfer credit or credit by examination for Spanish 506, or high school coursework in Spanish, or credit for Spanish 506 earned at the University of Texas at Austin more than one calendar year ago, with a grade of at least C.","upper":false},{"key":"SPN 610D","name":"Intermediate Spanish I","description":"Six-hour course focused on the development of multilingual literacy through the analysis and use of Spanish to achieve linguistic competence (aspect, subjunctive, hypotheticals, passive voice), communication and interactional competence (apologizing, requesting, circumlocution), and metalinguistic competence (critical analysis of oral and written texts). Six lecture hours a week for one semester. Only one of the following may be counted: Spanish 610D, 612, 312K. Prerequisite: Spanish 601D, 604, 507, or 508K with a grade of at least C.","upper":false},{"key":"SPN 611D","name":"Intermediate Spanish II","description":"Six-hour course focused on the development of multilingual literacy through the analysis and use of Spanish to achieve linguistic competence (aspect, subjunctive, passive voice), communication and interactional competence (pragmatics, cultural perspectives), and metalinguistic competence (dialectal differences). Six lecture hours a week for one semester. Only one of the following may be counted: Spanish 611D, 612, 312L. Prerequisite: Spanish 610D or 312K with a grade of at least C.","upper":false},{"key":"SPN 612","name":"Accelerated Intermediate Spanish for Heritage Learners","description":"Designed primarily for students who have a cultural and advanced linguistic connection to Spanish. Six lecture hours a week for one semester. Spanish 612 and 312K may not both be counted. Only one of the following may be counted: Spanish 611D, 612, 312L. Prerequisite: Spanish 604 with a grade of at least B, or 610D with a grade of at least C.","upper":false},{"key":"SPN 312K (TCCN: SPAN 2311)","name":"Second-Year Spanish I","description":"Three lecture hours a week for one semester. Only one of the following may be counted: Spanish 610D, 612, 312K. Prerequisite: Spanish 604, 507, or 508K with a grade of at least C.","upper":false},{"key":"SPN 312L (TCCN: SPAN 2312)","name":"Second-Year Spanish II","description":"Three lecture hours a week for one semester. Only one of the following may be counted: Spanish 611D, 612, 312L. Prerequisite: Spanish 312K with a grade of at least C.","upper":false},{"key":"SPN 318","name":"Conversation and Composition","description":"Designed to give intensive practice in oral expression, based on cultural readings, with some writing. Three lecture hours a week for one semester. Spanish 315N and 318 may not both be counted. May not be counted toward a major in Spanish. This course or the equivalent is recommended but not required for all majors in Spanish. Prerequisite: Spanish 612 or 312L.","upper":false},{"key":"SPN 319","name":"Advanced Oral Expression","description":"Designed to develop listening comprehension and oral skill to an advanced level. Three lecture hours a week for one semester. May not be counted toward a major in Spanish. Recommended for all Spanish majors. Prerequisite: Consent of instructor.","upper":false},{"key":"SPN 327C","name":"Advanced Grammar and Writing in Context","description":"Study and practice of Spanish grammar that includes reading exercises and guided composition designed to develop writing skills across styles. Students will be exposed to various topics in Spanish language, literature, and culture. Three lecture hours a week for one semester. Spanish 327C and 327G may not both be counted. Prerequisite: Spanish 611D, 612, or 312L.","upper":true},{"key":"SPN 327W","name":"Advanced Grammar and Composition II","description":"Develops writing skills needed for upper-division coursework in Spanish. Emphasizes grammar in Spanish language, literature, and culture, exploring different compositional styles. Three lecture hours a week for one semester; some sections may require additional hours. Prerequisite: Spanish 327G with a grade of at least C.","upper":true},{"key":"SPN 328","name":"Spanish Civilization","description":"A survey of the social, political, and cultural history of Spain. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Spanish 611D, 612, or 312L.","upper":true},{"key":"SPN 328C","name":"Introduction to Literatures and Cultures","description":"Same as Latin American Studies 370S (Topic 27). Overview of Iberian and/or Latin American literatures and cultures, including the arts and popular expressions, from a multidisciplinary perspective. Among the regions studied are Spain; North, Central, and South America; the Caribbean; and related areas in Africa. Three lecture hours a week for one semester. Only one of the following may be counted: Latin American Studies 370S (Topic 27), Spanish 328, 328C. Only one of the following may be counted: Latin American Studies 370S (Topic 3), 370S (Topic 27), Spanish 322K, 328C. Prerequisite: Spanish 611D, 612, or 312L.","upper":true},{"key":"SPN 130D","name":"Spanish across Disciplines","description":"Students read and discuss Spanish language materials related to the subject matter of another designated course. One lecture hour a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: One upper-division Spanish course or consent of instructor.","upper":true},{"key":"SPN 330L","name":"Introduction to Language and Linguistics in Society","description":"Examines the dynamics of language structure and use throughout the Spanish-speaking world, and covers topics such as sound systems, grammatical structures, historical developments, language learning and loss, and dialect differences and their social significance. Spanish 330L and 345L may not both be counted. Prerequisite: Spanish 611D, 612, or 312L.","upper":true},{"key":"SPN 346","name":"Sounds and Intonation","description":"Introduction to the study of Spanish phonetics and phonology, focusing on four aspects: mechanisms of sound production, representation of sounds and intonation, dialect variation, and comparison with English. Three lecture hours a week for one semester. Prerequisite: Spanish 327 and one of the following: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 350K","name":"Topics in Film and Media Cultures","description":"Examines important themes in Iberian, Latin American, or African societies and examines their treatment in audiovisual and media production. Three lecture hours a week for one semester. Spanish 350 and 350K may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Spanish 327 and either: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 351","name":"Don Quijote and the Early Modern World","description":"Study of Cervantes's Don Quijote in depth in the original Spanish. Examines the author's views on artistic freedom, as well as his manipulation of literary genres and conventions, with his questions regarding the dominant political, religious, and literary discourses of early modern Spain. Three lecture hours a week for one semester. Prerequisite: Spanish 327C (or 327G), and one of the following: 328C, 330L or Spanish Civilization 320C.","upper":true},{"key":"SPN 352","name":"Topics in Spanish and Spanish American Literature","description":"Major writers and works of Spanish and Spanish American literature. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"SPN 353","name":"Sociolinguistics","description":"Explores the interrelationship of language and society, with reference to the Spanish-speaking world. Studies how socioeconomic, political, and anthropological factors like race, social class, gender, age, and identity influence linguistics forms. Three lecture hours a week for one semester. Prerequisite: Spanish 327C (or 327G), and one of the following: Spanish 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 355","name":"Topics in Latin American Literatures and Cultures","description":"Study of important themes or issues in the cultural production of the Latin American world. Among the regions studied are Spain; North, Central, and South America; the Caribbean; and related areas in Africa. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Spanish 327C (or 327G), and one of the following: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 356","name":"Topics in Indigenous Cultures in the Americas","description":"Examines how indigenous writers, artists, and cultural producers have established their own voices and languages through writing and other forms of media. Analysis of the indigenous artistic and intellectual production in concrete political and cultural contexts. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Spanish 327C (or 327G), and one of the following: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 357","name":"Topics in Iberian Literatures and Cultures","description":"Study of important themes or issues in the cultural production of the Iberian world. Subjects include various cultural expressions and their relevance in specific political and historical contexts. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Spanish 327C (or 327G), and one of the following: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 358","name":"Studies of African Cultures in Dialogue","description":"Study of the cultural production of African and Afro-descendant people of the Iberian and Latin American worlds. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Spanish 327C (or 327G), and one of the following: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 359","name":"United States Latino Literatures and Cultures in Context","description":"Same as Latin American Studies 370S (Topic 43). Examines the United States Latino literary and cultural production from multidisciplinary perspectives, such as literature, film, music, and performance. Analysis of the literatures and experiences of United States Latino writers and artists in their historical and cultural specificities. Three lecture hours a week for one semester. Latin American Studies 370S (Topic 43) and Spanish 359 may not both be counted. Prerequisite: Spanish 327C (or 327G), and one of the following: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 364L","name":"Linguistics and the Spanish Learner","description":"Focuses on instructed and naturalistic second language (L2) development among adults. Subjects include: L2 acquisition theories, Spanish learners' difficulties, learners' and teachers' beliefs about L2, learners' motivations and needs, and heritage language learners. Three lecture hours a week for one semester. Prerequisite: Spanish 327C (or 327G), and one of the following: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 365C","name":"Conference Course in Hispanic Civilization","description":"Conference course. Prerequisite: Spanish 612 or 312L; and written consent of the department chair.","upper":true},{"key":"SPN 365G","name":"Conference Course in Hispanic Linguistics","description":"Conference course. Prerequisite: Spanish 612 or 312L; and written consent of the department chair.","upper":true},{"key":"SPN 365L","name":"Conference Course in Hispanic Literature","description":"Conference course. Prerequisite: Spanish 612 or 312L; and written consent of the department chair.","upper":true},{"key":"SPN 367P","name":"Spanish for the Professions","description":"Develops vocabulary, grammar, expressions, and interactional skills that are related to foreign language for professional purposes. Also covers cultural issues that affect professional activities in Spanish-speaking communities. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Spanish 327C (or 327G).","upper":true},{"key":"SPN 367T","name":"Advanced Oral and Written Expression for Teachers","description":"Designed to help teacher candidates prepare to pass the state oral and written proficiency exams at the advanced level to obtain certification. Focus on oral proficiency for various genres of speaking with an emphasis on writing and reading of different genres. Three lecture hours a week for one semester. Spanish 367K (Topic 1) and Spanish 367T may not both be counted. Prerequisite: Spanish 327C (or 327G), and one of the following: Spanish 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 368C","name":"Topics in Languages in Contact","description":"Investigates Spanish in contact with other languages and among different regional varieties in historical and contemporary settings. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Spanish 327C (or 327G), and one of the following: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 368S","name":"Topics in Language Structure and Use","description":"Examination of the major structural components of the language and how these are used in context to fulfill a variety of communicative functions. Three lecture hours a week for one semester. Spanish 367K and 368S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Spanish 327C (or 327G), and one of the following: 328C, 330L, or Spanish Civilization 320C.","upper":true},{"key":"SPN 377H","name":"Honors Tutorial Course","description":"Supervised individual research on a literary, linguistic, or cultural problem, culminating in a written thesis. The equivalent of three lecture hours a week for one semester. Prerequisite: Upper-division standing, credit or registration for Spanish 379C or 379L, admission to the Iberian and Latin American Languages and Cultures Honors Program, and consent of the Honors adviser.","upper":true},{"key":"SPN 379C","name":"Capstone Seminar in Literatures and Cultures","description":"Brings together central issues, concepts, and themes that define Iberian or Latin American literatures and cultures, while focusing on a specific case-study or case-studies. Three lecture hours a week for one semester. Prerequisite: Spanish 327C (or 327G), 328C, and twelve hours of upper-division coursework in Spanish.","upper":true},{"key":"SPN 679H","name":"Honors Tutorial Course","description":"Supervised individual research on a literary, linguistic, or cultural problem, culminating in a written thesis of fifty to eighty typewritten pages. Conference course for two semesters. Prerequisite: For 679HA, upper-division standing, admission to the Spanish Honors Program, and consent of the honors adviser; for 679HB, Spanish 679HA.","upper":true},{"key":"SPN 379L","name":"Capstone Seminar in Linguistics","description":"Brings together central issues, concepts, and themes that define linguistics, while focusing on a specific case-study or case-studies, that allow for the necessary depth and rigor to produce a research paper on a particular topic of interest. Three lecture hours a week for one semester. Prerequisite: Spanish 327C (or 327G), 330L, and twelve hours of upper-division coursework in Spanish.","upper":true}]