[{"key":"NSC 301C","name":"Freshman Seminar","description":"Restricted to first-semester freshmen. Small-group seminar involving reading, discussion, writing, and oral reports. Introduction to University resources, including libraries, computer and research facilities, and museums. Several sections are offered each semester, with various topics and instructors. Two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"NSC 001D","name":"Practicum in Clinical Laboratory Science","description":"Restricted to clinical laboratory science majors. Students participate in a twelve- to fifteen-month off-campus training program. Forty laboratory hours a week for one semester.  Offered on the pass/fail basis only. Prerequisite: Completion of all organized coursework for the Bachelor of Science in Clinical Laboratory Science degree and consent of the program director.","upper":false},{"key":"NSC 001S","name":"Natural Sciences Seminar","description":"Restricted to students in special programs in the College of Natural Sciences. Seminars may include study sessions, career and networking events, student and community speakers, and other topics related to issues for students in science. Emphasis on student participation.  May be repeated for credit.","upper":false},{"key":"NSC 302","name":"Texas Interdisciplinary Plan: Critical Thinking Seminar","description":"Restricted to students in the Texas Interdisciplinary Plan or in the Gateway Program. An examination of fundamental concepts in critical thinking, including the role of intellectual virtues, an analysis of the elements of thought, Socratic thinking, and the application of universal intellectual standards. Three lecture hours a week for one semester, with additional hours to be arranged. Liberal Arts 302 and Natural Sciences 302 may not both be counted. May not be repeated for credit.","upper":false},{"key":"NSC 306J","name":"Hands-On Science I","description":"Restricted to applied learning and development majors. The first of an integrated sequence of laboratory-based courses. Subjects include energy and motion, electrical circuits, atomic theory, waves, and sound. Two lecture hours and four laboratory hours a week for one semester. Natural Sciences 306J and 309 (Topic: Science for the Twenty-First Century I) may not both be counted. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"NSC 306K","name":"Hands-On Science II","description":"Restricted to applied learning and development majors. The second of an integrated sequence of laboratory-based courses. Subjects include physical and chemical properties of matter, Earth's building blocks, plate tectonics, landforms, and weathering. Two lecture hours and four laboratory hours a week for one semester. Natural Sciences 306K and 309 (Topic: Science for the Twenty-First Century II) may not both be counted. May not be counted toward a degree in the College of Natural Sciences. Prerequisite: Natural Sciences 306J with a grade of at least C-.","upper":false},{"key":"NSC 306L","name":"Hands-On Science III","description":"Restricted to applied learning and development majors. The third of an integrated sequence of laboratory-based courses. Subjects include properties of life, compartments of living organisms, inheritance, adaptations, variations, and disease. Two lecture hours and four laboratory hours a week for one semester. Natural Sciences 306L and 309 (Topic: Science for the Twenty-First Century III) may not both be counted. May not be counted toward a degree in the College of Natural Sciences. Prerequisite: Natural Sciences 306J and 306K with a grade of at least C- in each.","upper":false},{"key":"NSC 306M","name":"Hands-On Science IV","description":"The fourth of an integrated sequence of laboratory-based courses. Subjects include astronomy and the earth's climate. Two lecture hours and four laboratory hours a week for one semester. Natural Sciences 306M and 309 (Topic: Science for the Twenty-First Century IV) may not both be counted. May not be counted toward a degree in the College of Natural Sciences. Prerequisite: Natural Sciences 306J and 306K with a grade of at least C- in each.","upper":false},{"key":"NSC 209P","name":"Topics in Calculus for Emerging Scholars","description":"Restricted to students in the Emerging Scholars Program. A workshop focusing on ideas more than computation and procedures, where students work in small groups on sets of problems designed to encourage advanced thinking about calculus. Three lecture hours a week for one semester. Mathematics 210T (Topic: Topics for Emerging Scholars) and Natural Sciences 209P may not both be counted. Offered on the pass/fail basis only. Prerequisite: Concurrent enrollment in an approved calculus course.","upper":false},{"key":"NSC 110E","name":"Internship in the Sciences","description":"Restricted to students in the College of Natural Sciences. Practical work experience related to the student's area of interest in natural sciences. Internships may be on or off campus, paid or unpaid, and may include work with nonprofit agencies, government offices, or private corporations. Students work in a professional environment and apply analysis, communication, and other academic skills to practical work. Individual instruction conducted on the Web.  May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Completion of fifteen semester hours of coursework and consent of instructor.","upper":false},{"key":"NSC 110H","name":"Topics in Natural Sciences Honors Seminar","description":"Restricted to students in honors programs in the College of Natural Sciences. Emphasis on student participation. Format may include student speakers, outside speakers, discussions, visits to laboratories, or other enrichment activities. The equivalent of one lecture hour a week for one semester.  May be repeated for credit when the topics vary. Offered on the pass/fail basis only.","upper":false},{"key":"NSC 311","name":"Critical Reasoning","description":"Restricted to students in the Texas Interdisciplinary Plan program. An examination of the fundamental concepts in critical reasoning, including the analysis of argument, application of intellectual standards, and the role of intellectual virtues. Three lecture hours a week for one semester, with additional hours to be arranged.","upper":false},{"key":"NSC 115","name":"Women in Natural Sciences Seminar","description":"The work and lives of women scientists in a sociocultural context. One lecture hour a week for one semester.","upper":false},{"key":"NSC 120E","name":"Internship in the Sciences","description":"Restricted to students in the College of Natural Sciences. Practical work experience related to the student's area of interest in Natural Sciences. Internships may be on or off campus, paid or unpaid, and may include work with nonprofit agencies, government offices, or private corporations. Students work in a professional environment and apply analysis, communication, and other academic skills to practical work. Individual instruction conducted on the Web.  May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"NSC 321","name":"Introduction to Peer Mentoring and Leadership","description":"Restricted to students in the College of Natural Sciences. Explores current theory and research related to peer mentoring and leadership within higher education. Includes interactive lectures; and the opportunity for students to identify and work through ethical choices as peer leaders; to study leadership concepts such as conflict resolution, diversity, and group dynamics; to work collaboratively; and to conduct independent research. Three lecture hours a week for one semester.  May be repeated for credit. Prerequisite: Consent of instructor.","upper":true},{"key":"NSC 371","name":"Capstone Thesis Seminar","description":"Restricted course; contact the College of Natural Sciences Honors Center for permission to register. Directed reading, research, and discussion followed by the writing of a substantial thesis. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true}]