[{"key":"CH 301 (TCCN: CHEM 1311)","name":"Principles of Chemistry I","description":"Three lecture hours a week for one semester. Some sections also require one enrichment/discussion hour a week; these are identified in the Course Schedule. Chemistry 301 and 301H may not both be counted. Prerequisite: Credit with a grade of at least C- or registration for one of the following: Mathematics 305G, 408C, 408D, 408K, 408L, 408M, 408N, 408S, Statistics and Scientific Computation 302; and an appropriate score on the ALEKS chemistry placement examination.","upper":false},{"key":"CH 301H","name":"Principles of Chemistry I: Honors","description":"Three lecture hours a week for one semester. Chemistry 301 and 301H may not both be counted. Prerequisite: Credit with a grade of at least C- or registration for one of the following: Mathematics 408C, 408D, 408K, 408L, 408M, 408N, 408S; an appropriate score on the ALEKS chemistry placement examination; and consent of the departmental honors adviser.","upper":false},{"key":"CH 302 (TCCN: CHEM 1312)","name":"Principles of Chemistry II","description":"Development and application of concepts, theories, and laws underlying chemistry. Three lecture hours a week for one semester. Some sections also require one enrichment/discussion hour a week; these are identified in the Course Schedule. Chemistry 302 and 302H may not both be counted. Prerequisite: Chemistry 301 or 301H with a grade of at least C-; and credit with a grade of at least C- or registration for one of the following: Mathematics 408C, 408D, 408K, 408L, 408M, 408N, 408S.","upper":false},{"key":"CH 302H","name":"Principles of Chemistry II: Honors","description":"Three lecture hours a week for one semester. Chemistry 302 and 302H may not both be counted. Prerequisite: Chemistry 301 or 301H with a grade of at least C-; credit with a grade of at least C- or registration for one of the following: Mathematics 408C, 408D, 408K, 408L, 408M, 408N, 408S; and consent of the departmental honors adviser.","upper":false},{"key":"CH 303","name":"Mathematical Introduction to Theories of Matter","description":"Introduction to the quantum theoretic description of atoms, molecules, solids, nuclei, elementary particles, and cosmology. Matrix mechanics and group theory. Three lecture hours a week for one semester. Chemistry 303 may be used instead of either Chemistry 302 or Chemistry 301 and 302 in fulfilling the prerequisites of other chemistry courses, except by students seeking the Bachelor of Science in Chemistry degree. Chemistry 303 may be counted in addition to Chemistry 301 and 302. Not recommended by the Health Professions Office for Medical College Admission Test preparation.","upper":false},{"key":"CH 304K","name":"Chemistry in Context I","description":"Designed for nonscience majors. Chemistry 304K and 305 form a two-semester sequence designed to fulfill the science requirement for students not majoring in science or engineering. Issues of contemporary interest and importance, such as ozone depletion and global warming, motivate the discussion; the underlying chemistry is developed as needed. Social, political, economic, and ethical implications of scientific developments and science policy are considered. Chemistry 304K addresses the nature of matter, energy, chemical reactions, and chemical thermodynamics. Not intended as preparation for Chemistry 301. Three lecture hours a week for one semester. May not be counted toward a degree in the College of Natural Sciences. May not be counted by students with credit for Chemistry 301 with a grade of at least C-.","upper":false},{"key":"CH 305","name":"Chemistry in Context II","description":"Designed for nonscience majors. Chemistry 304K and 305 form a two-semester sequence designed to fulfill the science requirement for students not majoring in science or engineering. Chemistry 305 addresses water chemistry, acids and bases, elementary organic chemistry, polymers, pharmaceuticals, nutrition, and genetics. Three lecture hours a week for one semester. May not be counted toward a degree in the College of Natural Sciences. May not be counted by students with credit for Chemistry 302 with a grade of at least C-. Prerequisite: Chemistry 301 or 304K.","upper":false},{"key":"CH 206K","name":"Undergraduate Research","description":"Introduction to research practices; supervised individual undergraduate research in chemistry. Six to ten laboratory hours a week for one semester. May be repeated for credit, but no more than four semester hours may be counted toward a degree in chemistry or biochemistry. Hours beyond four must be taken on the pass/fail basis. May be repeated for credit. Prerequisite: Consent of the undergraduate adviser in chemistry.","upper":false},{"key":"CH 207K","name":"Introduction to Science Outreach in Elementary Schools","description":"Developing and presenting level-appropriate science laboratories to students in local elementary schools. A hands-on, discovery learning approach to science is emphasized. The equivalent of five lecture hours a week for one semester, with field hours to be arranged. May be counted as an elective only.","upper":false},{"key":"CH 207L","name":"Peer Teaching","description":"Students act as peer teaching assistants in other University chemistry courses, mainly large general chemistry lecture sections. Two hours of lecture and training a week for one semester, and two to three hours a week leading student group discussions. May not be counted toward any degree in chemistry or biochemistry. Prerequisite: Chemistry 301 and consent of the coordinator of the Peer Teaching Assistant Program.","upper":false},{"key":"CH 110K (TCCN: CHEM 2123)","name":"Organic Chemistry Laboratory","description":"Primarily for premedical, predental, life sciences, and pharmacy majors. One lecture hour and three laboratory hours a week for one semester. May not be counted by students with credit for Chemistry 210C. Chemistry 110K and 118K may not both be counted. Prerequisite: Chemistry 302 and 204 with a grade of at least C- in each, and credit or registration for Chemistry 310M.","upper":false},{"key":"CH 110L (TCCN: CHEM 2125)","name":"Organic Chemistry Laboratory","description":"Primarily for premedical, predental, life sciences, and pharmacy majors. One lecture hour and three laboratory hours a week for one semester. Only one of the following may be counted: Chemistry 210C, 110L, 118L. Prerequisite: Chemistry 310M with a grade of at least C-, 110K, and credit or registration for Chemistry 310N.","upper":false},{"key":"CH 317","name":"Descriptive Inorganic Chemistry for Chemistry and Biochemistry Majors","description":"Synthesis and properties of inorganic, bioinorganic, and organometallic compounds. One lecture hour and six laboratory hours a week for one semester. Chemistry 204 and 317 may not both be counted. Prerequisite: Credit or registration for Chemistry 302 or 302H.","upper":false},{"key":"CH 220C","name":"Organic Chemistry Laboratory","description":"One lecture hour and five laboratory hours a week for one semester. Only one of the following may be counted: Chemistry 210C, 110L, 118L, 220C, 128L. Prerequisite: Credit or registration for Chemistry 310N or 320N; and the following coursework with a grade of at least C- in each: Chemistry 204 or 317; and 310M, 318M, 320M, or 328M.","upper":true},{"key":"CH 320M","name":"Organic Chemistry I","description":"Primarily for premedical, predental, life sciences, and pharmacy majors. Development of organic chemical structure, nomenclature, and reactivity. Three lecture hours a week for one semester. Only one of the following may be counted: Chemistry 610A, 310M, 618A, 318M, 320M, 328M. Prerequisite: Chemistry 302 or 302H with a grade of at least C-, and credit or registration for Chemistry 204 or 317.","upper":true},{"key":"CH 320N","name":"Organic Chemistry II","description":"Primarily for premedical, predental, life sciences, and pharmacy majors. The development of organic chemical functional group reactivity, reaction mechanics, with analogous aqueous transformations in biochemical settings. Three lecture hours a week for one semester. Only one of the following may be counted: Chemistry 610B, 310N, 618B, 318N, 320N, 328N. Prerequisite: Credit of registation for Chemistry 210C or 220C; and the following coursework with a grade of at least C- in each: Chemistry 204 or 317; and 310M, 318M, 320M, or 328M.","upper":true},{"key":"CH 128K","name":"Organic Chemistry Laboratory","description":"One lecture hour and three laboratory hours a week for one semester. May not be counted by students with credit for Chemistry 210C or 220C. Only one of the following may be counted: Chemistry 110K, 118K, 128K. Prerequisite: Credit or registration for Chemistry 318M or 328M; and the following coursework with a grade of at least C-: Chemistry 302 or 302H; and 204 or 317.","upper":true},{"key":"CH 128L","name":"Organic Chemistry Laboratory","description":"One lecture hour and three laboratory hours a week for one semester. May not be counted by students with credit for Chemistry 210C or 220C. Only one of the following may be counted: Chemistry 110L, 118L, 128L. Prerequisite: Credit or registration for Chemistry 318N or 328N; and the following coursework with a grade of at least C- in each: Chemistry 118K or 128K; and 318M or 328M.","upper":true},{"key":"CH 328M","name":"Organic Chemistry I","description":"Primarily for chemistry and chemical engineering majors. The development of organic chemical structure, nomenclature, and reactivity. Three lecture hours a week for one semester. Only one of the following may be counted: Chemistry 610A, 310M, 618A, 318M, 320M, 328M. Prerequisite: Credit or registration for Chemistry 118K or 128K; and the following coursework with a grade of at least C- in each: Chemistry 302 or 302H; and 204 or 317.","upper":true},{"key":"CH 328N","name":"Organic Chemistry II","description":"Primarily for chemistry and chemical engineering majors. The development of organic chemical reactivity, with an emphasis on synthesis and polymers. Three lecture hours a week for one semester. Only one of the following may be counted: Chemistry 610B, 310N, 618B, 318N, 320N, 328N. Prerequisite: Credit or registration for Chemistry 118L or 128L; and the following coursework with a grade of at least C- in each: Chemistry 318M or 328M, and 118K or 128K.","upper":true},{"key":"CH 329W","name":"Cooperative Chemistry/Biochemistry","description":"This course covers the work period of chemistry and biochemistry students in the Cooperative Education program, which provides supervised work experience by arrangement with the employer and the supervising instructor. Forty laboratory hours a week for one semester. The student must repeat the course each work period and must take it twice to receive credit toward the degree; at least one of these registrations must be during a long-session semester. No more than three semester hours may be counted toward the major requirement; no more than six semester hours may be counted toward the degree. The student's first registration must be on the pass/fail basis. Prerequisite: Chemistry 310N or 318N with a grade of at least C-, application to become a member of the Cooperative Chemistry/Biochemistry Program, and consent of the Department of Chemistry and Biochemistry undergraduate adviser.","upper":true},{"key":"CH 431","name":"Inorganic Chemistry","description":"Survey of the chemistry of the elements, incorporating both descriptive and theoretical aspects. Open-ended experiments designed to illustrate a variety of synthetic techniques. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: The following courses with a grade of at least C-: Chemistry 302 or 302H, Chemistry 204 or 317, and Chemistry 320M or 328M.","upper":true},{"key":"CH 341","name":"Special Topics in Laboratory Chemistry","description":"Examples of topics are physical measurements techniques; electronics for scientists; advanced synthetic chemistry (organic or inorganic); separation techniques. One lecture hour and six laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Eight semester hours of coursework in organic chemistry and consent of the undergraduate adviser.","upper":true},{"key":"CH 644","name":"Chemical Education: Secondary School","description":"Issues and techniques in secondary school teaching of chemical sciences. Three lecture hours a week for two semesters. For students seeking the Bachelor of Science in Chemistry: Teaching Option degree. May not be counted toward any other degree in chemistry or biochemistry. Prerequisite: For 644A, eight semester hours of coursework in organic chemistry and credit or registration for Chemistry 144K; for 644B, Chemistry 644A, 144K, and credit or registration for Chemistry 144L.","upper":true},{"key":"CH 144K","name":"Chemical Education Laboratory I","description":"Development of classroom demonstrations, laboratory experiments, and teaching aids for secondary school teaching of the chemical sciences. Two laboratory hours a week for one semester. For students seeking the Bachelor of Science in Chemistry: Teaching Option degree. May not be counted toward any other degree in chemistry or biochemistry. Prerequisite: Credit or registration for Chemistry 644A.","upper":true},{"key":"CH 144L","name":"Chemical Education Laboratory II","description":"Development of classroom demonstrations, laboratory experiments, and teaching aids for secondary school teaching of the chemical sciences. Two laboratory hours a week for one semester. For students seeking the Bachelor of Science in Chemistry: Teaching Option degree. May not be counted toward any other degree in chemistry or biochemistry. Prerequisite: Credit or registration for Chemistry 644B.","upper":true},{"key":"CH 353","name":"Physical Chemistry I","description":"For chemistry and chemical engineering majors. Equations of state, laws of thermodynamics, ideal and nonideal solutions, phase equilibria, thermodynamics of chemical reactions. Three lecture hours a week for one semester. Chemistry 353 and 353M may not both be counted. Prerequisite: Mathematics 408C and 408D, or two of the following: Mathematics 408K, 408L, 408M, 408N, 408S; Chemistry 302 or 302H with a grade of at least C-; and Physics 316 and 116L, 303L and 103N, or 317L and 117N.","upper":true},{"key":"CH 153K","name":"Physical Chemistry Laboratory","description":"Three laboratory hours a week for one semester. Prerequisite: Chemistry 353 or 353M with a grade of at least C-.","upper":true},{"key":"CH 353M","name":"Physical Chemistry I for Life Sciences","description":"For biochemistry and biology majors. Thermochemistry and kinetics of reactions in cells, enzyme catalysis, electrical and transport properties of membranes. Three lecture hours a week for one semester. Chemistry 353 and 353M may not both be counted. Prerequisite: Mathematics 408C and 408D, or two of the following: Mathematics 408K, 408L, 408M, 408N, 408S; Chemistry 302 or 302H with a grade of at least C-; and Physics 316 and 116L, 303L and 103N, or 317L and 117N.","upper":true},{"key":"CH 354","name":"Quantum Chemistry and Spectroscopy","description":"Fundamental principles of quantum mechanics, exactly soluble model problems, electronic structure of atoms and molecules, spectroscopy. Three lecture hours a week for one semester. Prerequisite: Mathematics 408C and 408D, or two of the following: Mathematics 408K, 408L, 408M, 408N, 408S; and Physics 316 and 116L.","upper":true},{"key":"CH 154K","name":"Physical Chemistry Laboratory","description":"Three laboratory hours a week for one semester. Prerequisite: Chemistry 353 or 353M with a grade of at least C-, and credit or registration for Chemistry 354 or 354L.","upper":true},{"key":"CH 354L","name":"Physical Chemistry II","description":"Molecular energy levels, statistical thermodynamics (macroscopic thermodynamic functions from molecular input), and physical and chemical kinetics, with emphasis on the molecular viewpoint. Three lecture hours a week for one semester. May be counted toward a biochemistry or chemistry degree. Chemistry 354, rather than this course, is recommended for students planning graduate study in chemistry. Prerequisite: Chemistry 353 or 353M with a grade of at least C-.","upper":true},{"key":"CH 354S","name":"Elements of Spectroscopy","description":"Primarily for chemistry and biochemistry majors. Fundamentals of spectroscopy, with knowledge of elementary quantum mechanics. Separation of electronic, vibrational, rotational and spin quantum states; interaction of radiation and matter; theory and application of different types of spectroscopy including photoelectron, electronic absorption and emission, vibrational (infrared and Raman), rotational and magnetic resonance. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Chemistry 353 or 353M, and 354 or 354L.","upper":true},{"key":"CH 455","name":"Fundamentals of Analytical Chemistry","description":"For biochemistry, engineering, and clinical laboratory science majors. Chemical and instrumental methods in analytical chemistry. Three lecture hours and three laboratory hours a week for one semester. Chemistry 455 and 456 may not both be counted. Prerequisite: Chemistry 302 or 302H, and Chemistry 204 or 317, with a grade of at least C- in each.","upper":true},{"key":"CH 456","name":"Analytical Chemistry","description":"For chemistry majors.  Three lecture hours and three laboratory hours a week for one semester. Chemistry 455 and 456 may not both be counted. Prerequisite: Chemistry 302 or 302H with a grade of at least C-, and Chemistry 204 or 317 with a grade of at least C-.","upper":true},{"key":"CH 367C","name":"Materials Chemistry","description":"Restricted to chemistry majors. Introduction to structural and physical properties of materials and synthetic strategies for making new materials in the nanoscale and mesoscale regimes, in addition to covering instrumental methods used to probe materials properties. Some aspects of applications (semiconductor devices, solar and fuel cells, smart and responsive materials) will be covered to illustrate the kinds of material properties that need to be considered in designing novel materials of specific function. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and Chemistry 302 and 353 with a grade of at least C- in each. Chemistry 431 or 354L with a grade of at least C- is recommended.","upper":true},{"key":"CH 367L","name":"Macromolecular Chemistry","description":"Designed for chemistry and chemical engineering students. Occurrence, preparation, structure, and properties of macromolecular substances. Three lecture hours a week for one semester. Prerequisite: Chemistry 310M and 310N or Chemistry 318M and 318N; Chemistry 210C, or 118K and 118L; and Chemistry 353 or 353M with a grade of at least C-.","upper":true},{"key":"CH 368","name":"Advanced Topics in Chemistry","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: 310M and 310N or Chemistry 318M and 318N; Chemistry 353 or 353M with a grade of at least C-; and Chemistry 354 or 354L with a grade of at least C-.","upper":true},{"key":"CH 369K","name":"Techniques of Research","description":"Advanced laboratory practice and introduction to research. One lecture hour and six laboratory hours a week for one semester. May be taken for a letter grade no more than twice. No more than six semester hours may be counted toward a degree in chemistry or biochemistry. May be repeated for credit. Prerequisite: Eight semester hours of coursework in organic chemistry; and six semester hours of upper-division chemistry courses approved by the undergraduate adviser's office, or consent of the undergraduate adviser in chemistry.","upper":true},{"key":"CH 371K","name":"Science Outreach in Elementary Schools","description":"Students develop and present level-appropriate science laboratories to students in local elementary schools. Students also plan and create the infrastructure needed to administer the science program in concert with the science curriculum at a specific elementary school. A hands-on, discovery learning approach to science is emphasized. One class hour and six hours of fieldwork a week for one semester. May be taken for a letter grade no more than twice. No more than six semester hours may be counted toward a degree in chemistry or biochemistry. May be repeated for credit. Prerequisite: Upper-division standing, at least six hours of upper-division coursework in the College of Natural Sciences, and consent of the UTeach adviser in the College of Natural Sciences.","upper":true},{"key":"CH 372C","name":"Chemistry Peer Mentors in Research and Teaching","description":"Students work as peer mentors and assistants in the teaching of chemistry, with emphasis on developing instructional materials and laboratories that teach fundamental chemistry with real world data. Students mentor students for at least six hours a week in addition to other weekly meetings. meetings. May be taken for a letter grade no more than twice. No more than six semester hours may be counted toward a degree in chemistry or biochemistry. May be repeated for credit. Prerequisite: Chemistry 301 or 301H and 302 or 302H with a grade of at least B in each, and consent of the undergraduate adviser.","upper":true},{"key":"CH 376K","name":"Advanced Analytical Chemistry","description":"Two lecture hours and three laboratory hours a week for one semester. Prerequisite: Chemistry 353 and 456 with a grade of at least C- in each.","upper":true},{"key":"CH 379H","name":"Chemistry Honors Tutorial Course","description":"Laboratory research project in a specific field of chemistry under the supervision of one or more faculty members. Conference course. May be repeated once for credit. Must be taken in addition to the required hours for the Bachelor of Science in Chemistry degree. Students must enter no later than the first semester of the year of graduation. Prerequisite: Consent of the student's research supervisor and the departmental honors adviser.","upper":true}]