[{"key":"ARI 310K","name":"Design I","description":"Same as Architecture 310K. Restricted to students in the School of Architecture. An introduction to the forms and methods of design for architects and interior designers, with an emphasis on inhabitation including body, light, and movement. Taught in a studio format by faculty members under the direction of a faculty coordinator. Three lecture hours and six laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Registration for Architectural Interior Design 311K or Architecture 311K.","upper":false},{"key":"ARI 310L","name":"Design II","description":"Same as Architecture 310L. Restricted to students in the School of Architecture. An introduction to the forms and methods of design for architects and interior designers, with an emphasis on environment, including color, material, and texture. Taught in a studio format by faculty members under the direction of a faculty coordinator. Three lecture hours and six laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C in each: Architectural Interior Design 310K and 311K, or Architecture 310K and 311K; and registration for Architectural Interior Design 311L.","upper":false},{"key":"ARI 311K","name":"Visual Communication I","description":"Same as Architecture 311K. Restricted to students in the School of Architecture. Study and application of drawing and other communication skills for designers, including formal and spatial studies, life drawing, and perspective. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Registration for Architectural Interior Design 310K or Architecture 310K.","upper":false},{"key":"ARI 311L","name":"Visual Communication II","description":"Same as Architecture 311L. Restricted to students in the School of Architecture. Study and application of drawing and other communication skills for designers, including color, light and shadow, and projections. Employs manual and digital techniques. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: The following coursework with a grade of at least C in each: Architectural Interior Design 310K and 311K, or Architecture 310K and 311K; and registration for Architectural Interior Design 310L or Architecture 310L.","upper":false},{"key":"ARI 318K","name":"Interiors and Society","description":"Concepts, principles, and elements of interior design, presented in artistic, philosophical, and professional contexts. Includes a basic historical overview of the development of interior design. Three lecture hours a week for one semester. Prerequisite: For students in the School of Architecture, none; for others, consent of instructor.","upper":false},{"key":"ARI 318M","name":"Interior Design History","description":"Survey of interior design from antiquity through the eighteenth century, including theoretical, social, technical, and environmental forces. Three lecture hours a week for one semester. Prerequisite: Architectural Interior Design 318K with a grade of at least C.","upper":false},{"key":"ARI 320K","name":"Design III--Interiors","description":"Restricted to students in the School of Architecture. Focus on the physical and psychological needs of the inhabitants of interior space, with an emphasis on conceptual process and diagrammatic techniques. Projects deal with real building situations and introduce implications of fenestration, structure, and materials. Nine hours of lecture and studio a week for one semester. Prerequisite: The following coursework with a grade of at least C in each: Architectural Interior Design 310L and 311L, or Architecture 310L and 311L; and registration for Architectural Interior Design 221K or Architecture 221K.","upper":true},{"key":"ARI 520L","name":"Design IV--Interiors","description":"Restricted to students in the School of Architecture. Explores linkages between multiple interior spaces and the study of spatial thresholds. Investigates individual spaces in relation to the body and the surrounding environment, utilizing a clearly defined program. Fifteen hours of lecture and studio a week for one semester. Prerequisite: Architectural Interior Design 320K, Architecture 415K, and Architectural Interior Design 221K or Architecture 221K, with a grade of at least C in each.","upper":true},{"key":"ARI 221K","name":"Visual Communication III","description":"Same as Architecture 221K. Restricted to students in the School of Architecture. Introduction to digital modeling as well as principles of digital fabrication. Includes various modes of output such as drawings, renderings, and physical models. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: The following coursework with a grade of at least C in each: Architectural Interior Design 310L and 311L, or Architecture 310L and 311L; and registration for Architectural Interior Design 320K or Architecture 320K.","upper":true},{"key":"ARI 324K","name":"Environmental Controls I","description":"Same as Architecture 334K. Restricted to students in the School of Architecture. A survey of acoustics, color, light, illumination, and electrical and information systems in architectural interiors. Includes techniques of documentation. Three lecture hours and three laboratory hours a week for one semester. Architectural Interior Design 324K and Architecture 334K may not both be counted. Prerequisite: Architectural Interior Design 520L or Architecture 520L with a grade of at least C.","upper":true},{"key":"ARI 130","name":"Interior Design Internship","description":"Restricted to students in the School of Architecture. Practical application of design procedures in a professional design office. At least 250 hours of work in one semester. Prerequisite: Architectural Interior Design 530T.","upper":true},{"key":"ARI 530K","name":"Design V--Interiors","description":"Restricted to students in the School of Architecture. Examination of the elements of interior space and scale, including specific human factors. Particular emphasis on the design, documentation, production, and placement of objects in interiors. Fifteen hours of lecture and studio a week for one semester. Prerequisite: Architectural Interior Design 520L and 434K with a grade of at least C in each.","upper":true},{"key":"ARI 530T","name":"Design VI--Interiors","description":"Restricted to students in the School of Architecture. Capstone studio with specific design projects from current markets. Application of code issues, regulatory restraints, fire safety, and regulations for accessibility in interiors. Fifteen hours of lecture and studio a week for one semester. Prerequisite: Architectural Interior Design 324K and 530K with a grade of at least C in each.","upper":true},{"key":"ARI 434K","name":"Construction II--Interior Materials and Assemblies","description":"Restricted to students in the School of Architecture. Core concepts in interior materials, assemblies, and systems. Includes material properties, environmental and sustainable issues, attachment, detailing, and product specifications. Projects encourage manipulation and assembly of various material systems. Case studies using material samples, and field trips to sites of fabrication. Six hours of lecture and laboratory a week for one semester. Prerequisite: Architecture 415K with a grade of at least C.","upper":true},{"key":"ARI 338","name":"Designing for Human Behavior","description":"Issues of mood, privacy, perception, proxemics, and preferences applied to the design of interiors. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ARI 350R","name":"Topics in Interior Design Theory","description":"Seminar in a variety of topics. Designed to broaden the student's knowledge of interior design and to encourage critical and theoretical thinking in the discipline. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For students in the School of Architecture, upper-division standing; for others, upper-division standing and consent of instructor.","upper":true},{"key":"ARI 560R","name":"Advanced Interior Design","description":"Restricted to students in the School of Architecture. Synthesis of components covered in other interior design courses, such as human aspects, place-making, the interior envelope, transitional spaces, and conceptual processes. Fifteen hours of lecture and studio a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Architectural Interior Design 530T with a grade of at least C and satisfactory completion of a third-year portfolio review.","upper":true},{"key":"ARI 362","name":"Interior Design Practice","description":"Restricted to students in the School of Architecture. Business procedures, professional practice, design project control and management, and professional ethics. Documents procedures for interior design. Three lecture hours a week for one semester. Prerequisite: Upper-division standing or consent of instructor.","upper":true},{"key":"ARI 368R","name":"Interior Design History II","description":"Study of function and aesthetics, and decoration and use, emphasizing interiors from the nineteenth century to the present. Three lecture hours a week for one semester. Prerequisite: Architectural Interior Design 318M with a grade of at least C.","upper":true}]