[{"key":"ARC 001F","name":"First-Year Interest Group Seminar","description":"Restricted to students in the First-Year Interest Group Program. Basic issues in various School of Architecture disciplines. One lecture hour a week for one semester.","upper":false},{"key":"ARC 308 (TCCN: ARCH 1311)","name":"Architecture and Society","description":"Introduction to the social contexts, potential, and consequences of architecture and interior design. Three lecture hours and one laboratory hour a week for one semester.","upper":false},{"key":"ARC 310K","name":"Design I","description":"Same as Architectural Interior Design 310K. Restricted to students in the School of Architecture. An introduction to the forms and methods of design for architects and interior designers, with an emphasis on inhabitation including body, light, and movement. Taught in a studio format by faculty members under the direction of a faculty coordinator. Three lecture hours and six laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Registration for Architectural Interior Design 311K or Architecture 311K.","upper":false},{"key":"ARC 310L","name":"Design II","description":"Same as Architectural Interior Design 310L. Restricted to students in the School of Architecture. An introduction to the forms and methods of design for architects and interior designers, with an emphasis on environment, including color, material, and texture. Taught in a studio format by faculty members under the direction of a faculty coordinator. Three lecture hours and six laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C in each: Architectural Interior Design 310K and 311K, or Architecture 310K and 311K; and registration for Architectural Interior Design 311L.","upper":false},{"key":"ARC 311K","name":"Visual Communication I","description":"Same as Architectural Interior Design 311K. Restricted to students in the School of Architecture. Study and application of drawing and other communication skills for designers, including formal and spatial studies, life drawing, and perspective. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Registration for Architectural Interior Design 310K or Architecture 310K.","upper":false},{"key":"ARC 311L","name":"Visual Communication II","description":"Same as Architectural Interior Design 311L. Restricted to students in the School of Architecture. Study and application of drawing and other communication skills for designers, including color, light and shadow, and projections. Employs manual and digital techniques. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: The following coursework with a grade of at least C in each: Architectural Interior Design 310K and 311K, or Architecture 310K and 311K; and registration for Architectural Interior Design 310L or Architecture 310L.","upper":false},{"key":"ARC 415K","name":"Construction I","description":"Restricted to students in the School of Architecture. Introduction to building construction, materials, and structures. Three lecture hours and three laboratory hours a week for one semester.","upper":false},{"key":"ARC 415L","name":"Construction II","description":"Restricted to students in the School of Architecture. Analysis of building assemblies, envelope design, and structures. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Architecture 415K with a grade of at least C; Mathematics 408C or 408K; and Physics 302K and 102M, or 303K and 103M.","upper":false},{"key":"ARC 318K (TCCN: ARCH 1301)","name":"World Architecture: Origins to 1750","description":"Comparative study of the architecture of the ancient world, including Asia, Africa, the Americas, and Europe. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Architecture 308 with a grade of at least C.","upper":false},{"key":"ARC 318L (TCCN: ARCH 1302)","name":"World Architecture: The Industrial Revolution to the Present","description":"Three lecture hours a week for one semester. Prerequisite: Architecture 318K with a grade of at least C.","upper":false},{"key":"ARC 320K","name":"Design III","description":"Restricted to students in the School of Architecture. Intermediate-level studio addressing spatial, tectonic, environmental, social, and theoretical issues in architectural design. Taught in a studio format by faculty members under the direction of a faculty coordinator. Nine hours of lecture and studio a week for one semester. Prerequisite: Architectural Interior Design 310L and 311L, or Architecture 310L and 311L, with a grade of at least C in each.","upper":true},{"key":"ARC 520L","name":"Design IV","description":"Restricted to students in the School of Architecture. Intermediate-level studio addressing urban design and building design. Taught in a studio format by faculty members under the direction of a faculty coordinator. Fifteen studio hours a week for one semester. Prerequisite: Architecture 415K, 320K, and Architectural Interior Design 221K or Architecture 221K, with a grade of at least C in each.","upper":true},{"key":"ARC 520M","name":"Design V","description":"Restricted to students in the School of Architecture. Intermediate-level studio with an emphasis on theory and research. Taught in a studio format by faculty members under the direction of a faculty coordinator. Fifteen studio hours a week for one semester. Prerequisite: Architecture 415L and 520L with a grade of at least C in each.","upper":true},{"key":"ARC 221K","name":"Visual Communication III","description":"Same as Architectural Interior Design 221K. Restricted to students in the School of Architecture. Introduction to digital modeling as well as principles of digital fabrication. Includes various modes of output such as drawings, renderings, and physical models. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: The following coursework with a grade of at least C in each: Architectural Interior Design 310L and 311L, or Architecture 310L and 311L; and registration for Architectural Interior Design 320K or Architecture 320K.","upper":true},{"key":"ARC 530T","name":"Design VI","description":"Restricted to students in the School of Architecture. Intermediate-level studio addressing the requirements of sound buildings--their programmatic, spatial, and tectonic resolution and their relationships to the physical and social context of the site. Taught in a studio format by faculty members under the direction of a faculty coordinator. Fifteen studio hours a week for one semester. Prerequisite: Architectural Interior Design 324K, and Architecture 520M and 435K, with a grade of at least C in each.","upper":true},{"key":"ARC 333","name":"Site Design","description":"Restricted to students in the School of Architecture. History, theory, and technique of landscape design, with emphasis on the relationship of a building to its landscape. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ARC 334K","name":"Environmental Controls I","description":"Same as Architectural Interior Design 324K. Restricted to students in the School of Architecture. A survey of acoustics, color, light, illumination, and electrical and information systems in architectural interiors. Includes techniques of documentation. Three lecture hours and three laboratory hours a week for one semester. Architectural Interior Design 324K and Architecture 334K may not both be counted. Prerequisite: Architectural Interior Design 520L or Architecture 520L with a grade of at least C.","upper":true},{"key":"ARC 334L","name":"Environmental Controls II","description":"Restricted to students in the School of Architecture. A survey of heating, ventilating, air conditioning, vertical transportation, and wiring and plumbing systems in buildings, including techniques of documentation. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Architectural Interior Design 324K with a grade of at least C.","upper":true},{"key":"ARC 435K","name":"Construction III","description":"Restricted to students in the School of Architecture. Building construction and materials theories; structural component analysis and design. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Architecture 415L with a grade of at least C; Mathematics 408C or 408L; and Physics 302L and 102N, or 303L and 103N.","upper":true},{"key":"ARC 435L","name":"Construction IV","description":"Restricted to students in the School of Architecture. Theories of building behavior and materials; structural system analysis and design. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Architecture 435K with a grade of at least C.","upper":true},{"key":"ARC 335M","name":"Construction V","description":"Restricted to students in the School of Architecture. Advanced analysis of building envelope, assemblies, detailing, and specifications. Three lecture hours a week for one semester. Prerequisite: Architecture 435L with a grade of at least C.","upper":true},{"key":"ARC 350R","name":"Topics in Design Theory","description":"Advanced topics in architecture and associated disciplines to encourage critical and theoretical thinking. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For students in the School of Architecture, upper-division standing; for others, upper-division standing and consent of instructor; additional prerequisites may vary with the topic.","upper":true},{"key":"ARC 351R","name":"Visual Communication","description":"Advanced topics in various methods of visual communication. Three lecture hours or six laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Architecture 520L with a grade of at least C, or consent of instructor.","upper":true},{"key":"ARC 560R","name":"Advanced Design","description":"Restricted to students in the School of Architecture. Advanced problems in architectural design. Three lecture hours and twelve laboratory hours a week for one semester.  May be repeated for credit. Offered on the letter-grade basis only. Prerequisite: Architecture 530T with a grade of at least C and satisfactory completion of third-year portfolio review.","upper":true},{"key":"ARC 361T","name":"Technical Communication","description":"Restricted to students in the School of Architecture. Studio to produce construction documents for buildings designed in Architecture 560T. Six studio hours a week for one semester. Prerequisite: Architecture 560R with a grade of at least C, and registration for Architecture 560T or 660T.","upper":true},{"key":"ARC 362","name":"Professional Practice","description":"Restricted to students in the School of Architecture. Ethical, legal, and administrative responsibilities of the architect; organizations, processes, and roles in architecture. Three lecture hours a week for one semester. Prerequisite: Architecture 560R with a grade of at least C.","upper":true},{"key":"ARC 368R","name":"Topics in the History of Architecture","description":"Seminars and lecture/seminars on advanced topics in the history of architecture. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For students in the School of Architecture, Architecture 318L with a grade of at least C; for others, consent of instructor.","upper":true}]