[{"key":"WGS 301","name":"Introductory Topics in Women's and Gender Studies","description":"Three lecture hours a week for one semester, or as required for the topic. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":false},{"key":"WGS 305","name":"Introduction to Women's and Gender Studies","description":"Introduction to the role of gender identity and representation in key social institutions and processes, including borders, displacements, and diasporas. Analysis of the social narratives of gender, race, and sexuality. Three lecture hours a week for one semester. Women's and Gender Studies 301 (Topic: Introduction to Women's and Gender Studies) and 305 may not both be counted.","upper":false},{"key":"WGS 313","name":"Child Development","description":"Same as Human Development and Family Sciences 313. Motor, language, cognitive, social, and emotional development in the family context. Three lecture hours a week for one semester. Only one of the following may be counted: Human Development and Family Sciences 313, 313H, Women's and Gender Studies 301 (Topic 5), 313. Prerequisite: Credit or registration for Human Development and Family Sciences 113L, and Psychology 301 with grade of at least C-.","upper":false},{"key":"WGS 321","name":"Introduction to Women's and Gender Studies in the Humanities","description":"Multidisciplinary course examining the creative work of women and the image of women in history and art. Topics in addition to the following may be offered; these are listed in the Course Schedule. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"WGS 322","name":"Introduction to Women's and Gender Studies in the Social Sciences","description":"Multidisciplinary topics using approaches from the social sciences to examine gender constructs and male/female roles. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites vary with the topic.","upper":true},{"key":"WGS 323","name":"Introduction to Women's and Gender Studies in the Natural Sciences","description":"Examination of gendered constructs such as gender and sexual development, male and female differences and similarities,  and feminist or alternative scientific epistemologies using approaches from the natural sciences. Three lecture hours a week for one semester, or as required by the topic.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"WGS 324","name":"Introduction to Women's and Gender Studies in Communication","description":"Multidisciplinary course examining issues of women, gender, and sexuality in media industries, texts, and audiences. Three lecture hours a week for one semester, or as required for the topic.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"WGS 125","name":"Special Topics in Women's and Gender Studies","description":"Analysis of special topics in women's and gender studies through reading, discussion, and lectures. One lecture hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"WGS 340","name":"Cross-Cultural Topics in Women's and Gender Studies","description":"Women's experiences in different cultures. Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites vary with the topic.","upper":true},{"key":"WGS 441","name":"The Roots of Social and Economic Justice","description":"Four lecture hours a week for one semester. Only one of the following may be counted: Social Work 460K (Topic: Roots of Social and Economic Justice), Women's and Gender Studies 440 (Topic: Roots of Social and Economic Justice), 441. Prerequisite: Upper-division standing.","upper":true},{"key":"WGS 345","name":"Topics in Women's and Gender Studies","description":"Three lecture hours a week for one semester, or as required for the topic. Some topics partially fulfill legislative requirement for American history. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites vary with the topic.","upper":true},{"key":"WGS 350","name":"Feminist Theory","description":"Restricted to women's and gender studies majors and minors. Feminist theory with selections from women's and gender studies scholars. Recommended feminist theory course for women's and gender studies majors. Three lecture hours a week for one semester. Women's and Gender Studies 322 (Topic 4: Feminist Theory) and 350 may not both be counted. Prerequisite: Upper-division standing and nine semester hours of coursework in women's and gender studies.","upper":true},{"key":"WGS 356","name":"Introduction to Feminist Research Methods","description":"Restricted to women's and gender studies majors and minors. Introduction to feminist research methods across a range of traditional disciplines. Designed to prepare students to analyze research within gender studies and to develop their own research skills. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and six semester hours of coursework in women's and gender studies.","upper":true},{"key":"WGS 358Q","name":"Supervised Research","description":"Supervised individual research on an issue in women's and gender studies. Individual instruction. Prerequisite: Upper-division standing, Women's and Gender Studies 356 with grade of at least C-, and written consent of the supervising faculty member; consent forms are available in the Center for Women's and Gender Studies.","upper":true},{"key":"WGS 360","name":"Research and Thesis in Women's and Gender Studies","description":"Restricted to women's and gender studies majors. Individual project or paper to be completed under the direction of a women's and gender studies faculty member. Conference course.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing; Women's and Gender Studies 356 with grade of at least C-; credit or registration for Women's and Gender Studies 358Q; and written consent of the supervising faculty member on a consent form available in the Center for Women's and Gender Studies for that purpose.","upper":true},{"key":"WGS 466","name":"Guidance in Adult-Child Relationships","description":"Same as Human Development and Family Sciences 466. Theory and implementation of positive child and adult interactions, communication, and guidance strategies. Two lecture hours and four laboratory hours a week for one semester. Only one of the following may be counted: Human Development and Family Sciences 466, Women's and Gender Studies 345 (Topic 4: Guidance in Adult-Child Relationships), 466. Prerequisite: Human Development and Family Sciences 313 and 113L; and three semester hours of upper-division coursework in human development and family sciences, education, psychology, or sociology.","upper":true},{"key":"WGS 679H","name":"Honors Tutorial Course","description":"Restricted to honors candidates majoring in women's and gender studies. Individual reading of selected works for one semester, followed in the second semester by the writing of an honors thesis. The equivalent of three lectures hours a week for two semesters. Prerequisite: For 679HA, twelve semester hours of coursework in women's and gender studies and consent of supervising faculty; for 679HB, Women's and Gender Studies 679HA.","upper":true},{"key":"WGS 379L","name":"Internship in Women's and Gender Studies","description":"Experience working in the community or for a nonprofit agency. Six to nine hours of work a week for one semester. Prerequisite: At least twelve semester hours of coursework in women's and gender studies and written consent of the supervising faculty member; consent forms are available in the Center for Women's and Gender Studies.","upper":true},{"key":"WGS 379S","name":"Senior Seminar","description":"Intensive study of selected topics in women's and gender studies. Three lecture hours a week for one semester. May not be repeated for credit. Offered on the letter-grade basis only. Prerequisite: Upper-division standing and completion of at least ninety semester hours of coursework, including six hours in women's and gender studies.","upper":true}]