[{"key":"BIO 301E","name":"Problems in Modern Biology","description":"An introduction to major concepts in biology, with emphasis on topics, such as genetics, that are relevant to current issues in the field. Three lecture hours and one discussion hour a week for one semester. Biology 301E and 301L may not both be counted; Biology 301E and 301M may not both be counted. May not be counted toward a degree in biology. Prerequisite: Admission to the Plan II Honors Program.","upper":false},{"key":"BIO 301L (TCCN: BIOL 1308)","name":"Molecules to Organisms","description":"Designed for nonscience majors. Introduction to the structure and function of organisms from the molecular to the organ system level; an integrated approach to cell and molecular biology, genetics, development, and physiology of organisms. Three lecture hours and one discussion hour a week for one semester. Biology 301L and 311C may not both be counted; Biology 301L and 311D may not both be counted. Biology 301E and 301L may not both be counted. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"BIO 305F","name":"How Plants Sense and Respond to Stimuli","description":"Designed for nonscience majors. Exploration of the ways plants sense information about their environment and adapt their growth accordingly; similarities between plant and animal sensory physiology. Three lecture hours a week for one semester. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"BIO 406D","name":"Native Plants","description":"Designed for nonscience majors. Introduction to the flora of central Texas. Involves plant identification, distribution, and consideration of edible and useful wild plants. Two lecture hours and six laboratory hours a week for one semester, including field trips. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"BIO 307D","name":"Biology of AIDS","description":"Designed for nonscience majors. Introduction to organs, cells, genes, viruses, infectious diseases, and the immune system. Basic biology of HIV, AIDS, and epidemiology. Three lecture hours and one discussion hour a week for one semester. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"BIO 208L","name":"Field Biology","description":"Field projects, laboratory exercises, field trips, and computer simulation exercises to acquaint students with the principles and applications of ecology and some of the experimental and descriptive methods of ecological investigations. One lecture hour and four laboratory hours a week for one semester. Prerequisite: Credit or registration for Biology 311D.","upper":false},{"key":"BIO 309D","name":"The Human Body","description":"Designed for nonscience majors. Introduction to the anatomical systems of the human body, their physiological  functions and interrelationships. Three lecture hours and one discussion hour a week for one semester. Biology 309D and 365R may not both be counted. May not be counted by students with credit for Biology 365S. May not be counted toward a degree in the College of Natural Sciences, except for the Bachelor of Science in Human Development and Family Sciences.","upper":false},{"key":"BIO 311C (TCCN: BIOL 1306)","name":"Introductory Biology I","description":"Introduction to biological energy transformation, cell structure and physiology, and gene expression. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Biology 301L, 211, 311C. Biology 311C and 212 may not both be counted. Prerequisite: Credit or registration for Chemistry 301 or 301H.","upper":false},{"key":"BIO 311D (TCCN: BIOL 1307)","name":"Introductory Biology II","description":"Introduction to mechanisms of inheritance, evolution, physiology, and species interactions. Three lecture hours and one discussion hour a week for one semester. Biology 301L and 311D may not both be counted. Biology 301M and 311D may not both be counted. Prerequisite: Biology 311C with a grade of at least C-.","upper":false},{"key":"BIO 315H","name":"Advanced Introduction to Genetics: Honors","description":"Basic principles of genetics and cell biology. Emphasis on gene structure and regulation; transmission of heritable traits; structure and function of cells; bacterial and viral genetics; and recombinant DNA technology. Three lecture hours and one discussion hour a week for one semester. Prerequisite: A score of  5 on the College Board Advanced Placement Examination in Biology and credit or registration for Chemistry 301 or 301H.","upper":false},{"key":"BIO 317","name":"Introduction to Public Health","description":"Same as Public Health 317. Overview and basic principles of public health, including the public health system, concepts and tools for measuring health in populations, the relationship between public health and the medical care system, and the role of law and government in public health. Three lecture hours a week for one semester.","upper":false},{"key":"BIO 320","name":"Cell Biology","description":"Principles of eukaryotic cell structure and function; macromolecules, energetics, membranes, organelles, cytoskeleton, gene expression, signaling, division, differentiation, motility, and experimental methodologies. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 320L","name":"Cell Biology Laboratory","description":"Explores the complex structures and functions of cells through direct observation and experimentation. Subjects may include regulation of gene transcription and translation, protein sorting, organelles and membrane trafficking, cytoskeletal dynamics, and cell division. Students use a combination of modern molecular biology, biochemistry, and microscopy techniques, with a strong emphasis placed on hypothesis-driven approaches, proper experimental design, and clear scientific writing and presentation. One lecture hour and five laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and credit with a grade of at least C- or registration for Biology 320.","upper":true},{"key":"BIO 321G","name":"Principles of Computational Biology","description":"Introduces computational methods used in molecular, cellular, organismal, and population biology. Subjects include molecular bioinformatics, modeling and simulation, and network analysis. Three lecture hours and two computer laboratory hours a week for one semester. Prerequisite: The following with a grade of at least C-: Biology 325 or 325H; Computer Science 303E, 305J, and 307 or Statistics and Data Sciences 222 (or Statistics and Scientific Computation 222); and Mathematics 408C, or 408K and 408L, or 408N and 408S.","upper":true},{"key":"BIO 321L","name":"Aquatic Entomology","description":"The taxonomy of aquatic insects; the use of aquatic insects in biomonitoring. Two lecture hours and three laboratory hours a week for one semester. Only one of the following may be counted: Biology 321L, 370C (Topic: Applied Aquatic Entomology), 384K (Topic 13: Aquatic Entomology). Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 323L","name":"Laboratory Studies in Cell Biology","description":"Research exercises involving light/electron microscopy, image processing, autoradiography, chromatography, fractionation, flow cytometry, spectroscopy, diffraction, antibody labeling, cell growth, and kinetics. One lecture hour and four laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and credit or registration for Biology 320.","upper":true},{"key":"BIO 324","name":"Survey of the Plant Kingdom","description":"Review of the groups of living and fossil plants, emphasizing their organization, reproduction, and evolution. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and concurrent enrollment in Biology 124L.","upper":true},{"key":"BIO 124L","name":"Survey of the Plant Kingdom Laboratory","description":"Demonstration of members of various plant groups, using cultures and prepared materials, to emphasize organization, reproduction, and evolution. Two laboratory hours a week for one semester. Prerequisite: Concurrent enrollment in Biology 324.","upper":true},{"key":"BIO 325","name":"Genetics","description":"Basic principles of Mendelism, molecular genetics, structure and function of genes and chromosomes, populations and evolution. Three lecture hours and one discussion hour a week for one semester. Biology 325 and 325H may not both be counted. Prerequisite: Biology 311C and 311D with a grade of at least C- in each.","upper":true},{"key":"BIO 325H","name":"Genetics: Honors","description":"Basic principles of genetics and evolution. Emphasis on population genetics and natural selection; structure and function of organ systems; behavioral ecology; and mutational analysis of organismal development. Three lecture hours and one discussion hour a week for one semester. Biology 325 and 325H may not both be counted. Prerequisite: Biology 315H with a grade of at least C-.","upper":true},{"key":"BIO 325L","name":"Laboratory Experience in Genetics","description":"Experimentation and direct observation in fundamental aspects of transmission genetics. One lecture hour and four laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 325T","name":"Human Genetics","description":"Genomics, cancer genetics, identification and analysis of human disease genes, and monogenic and multifactorial traits in humans. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 226L","name":"General Microbiology Laboratory","description":"Introduction to microbiology laboratory techniques and experimental demonstration of principles of microbiology. One lecture and three laboratory hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Biology 326M or 326R (or 226R).","upper":true},{"key":"BIO 326M","name":"Introductory Medical Microbiology and Immunology","description":"Designed primarily for nursing and prepharmacy students. Overview of the structure, function, and genetics of bacteria, viruses, and fungi, with emphasis on the interactions between micro-organisms and the human host. Includes principles of microbial pathogenesis, the host's innate and adaptive immune responses to infection, epidemiology, laboratory diagnosis, and antimicrobial chemotherapy and vaccines. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 311C; Biology 325 or 325H with a grade of at least C-; Chemistry 301 with a grade of at least C-; and one of the following with a grade of at least C-: Mathematics 408C, 408K, 408N, 408R, Statistics and Scientific Computation 302.","upper":true},{"key":"BIO 326R","name":"General Microbiology","description":"Overview of the major areas of microbiological study, including cell structure and function, genetics, host-microbe interactions, physiology, ecology, diversity, and virology. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Chemistry 302 or 302H with a grade of at least C-.","upper":true},{"key":"BIO 327","name":"General Phycology","description":"A general survey of the algae and of their biology. Three lecture hours a week for one semester. Biology 327 and 388J may not both be counted. Prerequisite: Biology 324, 124L, and 325 or 325H, with a grade of at least C- in each, and concurrent enrollment in Biology 127L.","upper":true},{"key":"BIO 327D","name":"Emerging Infectious Diseases","description":"Genomic and proteomic tools used to understand the causes of human infectious diseases. Covers genome sequencing, community sequencing, proteomics, microarrays, and human polymorphism analysis; and how these technologies have been applied to the study of important human viral diseases. Also includes extensive coverage of the molecular and clinical biology of these diseases. Three lecture hours a week for one semester. Biology 327D and 337 (Topic: Emerging Infectious Diseases) may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 327E","name":"Epigenetics","description":"A study of epigenetic modifications, the covalent modifications of DNA or histones that cause changes in gene expression. Particular attention is given to how experience or environmental factors epigenetically modify health or behavior in animals. Three lecture hours a week for one semester. Biology 327E and 337 (Topic: Epigenetics) may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 327G","name":"Genomics","description":"Genome structure, organization, and function of model organisms; theory and methodology of genetic and physical mapping; sequencing analysis and annotation; genome duplication and evolution; and ethics for biotechnology and cloning. Three lecture hours a week for one semester. Biology 327G and 337 (Topic: Genomics) may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 127L","name":"Laboratory in General Phycology","description":"Survey of various algal groups, including direct observations of their biology, exposure to research techniques, and instruction in culture procedures. Three laboratory hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Biology 327.","upper":true},{"key":"BIO 328","name":"Introductory Plant Physiology","description":"General principles of the mineral nutrition, water relations, metabolic activities, growth and development of green plants. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Chemistry 302 or 302H.","upper":true},{"key":"BIO 328D","name":"Discovery Laboratory in Plant Biology","description":"Learning methods of experimental design, data gathering, data interpretation, and data presentation, including original experiments relating to questions of current interest in plant physiology. Five lab hours a week for one semester. Biology 328D and 337 (Topic: Discovery Laboratory in Plant Biology) may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 128L","name":"Laboratory Experiments in Plant Physiology","description":"Introduction to experimental techniques used in the study of the mineral nutrition, water relations, metabolic activities, growth and development of green plants. Three laboratory hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Biology 328.","upper":true},{"key":"BIO 328M","name":"Biostatistics","description":"Introduction to methods of statistical analysis of biological data. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Biology 318M, 328M, Statistics and Scientific Computation 318M, 328M. Prerequisite: Mathematics 408D, 408L, or 408S with a grade of at least C-, and four semester hours of coursework in biology.","upper":true},{"key":"BIO 329","name":"Medical Mycology","description":"A basic introduction to medical mycology and an overview of research involving both the fungal zoopathogen and its host. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 326R (or 226R) with a grade of at least C-.","upper":true},{"key":"BIO 129L","name":"Medical Mycology Laboratory","description":"Basic techniques for the identification and manipulation of fungi of medical importance. Three laboratory hours a week for one semester. Prerequisite: Biology 126L with a grade of at least C-, and credit with a grade of at least C- or registration for Biology 329.","upper":true},{"key":"BIO 330","name":"Animal Virology","description":"Mechanisms by which viruses replicate and kill or transform cells. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 326R (or 226R) with a grade of at least C-.","upper":true},{"key":"BIO 230L","name":"Virology Laboratory","description":"Basic experimental techniques applied to selected bacteriophages and animal viruses. Four laboratory hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H, and 126L with a grade of at least C- in each, and credit with a grade of at least C- or registration for Biology 330 or 333.","upper":true},{"key":"BIO 331L","name":"Laboratory Studies in Molecular Biology","description":"The methods and principles of molecular biology in a research laboratory context. Students conduct a research project directed by a faculty member. One lecture hour and four and one-half laboratory hours a week for one semester. Prerequisite: Biology 205L, 206L, 208L, or 126L; and Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 332","name":"Yeast Cell Biology","description":"Yeast is used as a model to teach some of the more actively researched areas of cell biology, such as chromosome structure, mating type, cell-cell interaction, DNA replication, mitosis, cytoskeletal motors, cell polarity, signal transduction, cell cycle, checkpoints, secretion, protein modification, yeast genetics, and yeast technology. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 126L and 326R (or 226R) with a grade of at least C- in each.","upper":true},{"key":"BIO 333","name":"Molecular Genetics of Bacteriophages and Plasmids","description":"Mechanisms of the phage infection cycle and of plasmid replication and gene expression; transposons and transposition. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 326R (or 226R) with a grade of at least C-.","upper":true},{"key":"BIO 334","name":"Global Health","description":"Global health issues, including the principles of global health, the burden of morbidity and mortality, health determinants, health care and public health systems, socioeconomic development, and human rights. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each:  Public Health 354, and Biology 328M or Statistics and Scientific Computation 328M.","upper":true},{"key":"BIO 335","name":"Introduction to Biochemical Engineering","description":"Microorganisms in chemical and biochemical synthesis; genetic manipulation of cells by classical and recombinant DNA techniques. Enzyme technology; design of bioreactors and microbial fermentations; separations of biological products. Three lecture hours a week for one semester. Only one of the following may be counted: Biology 335, Biomedical Engineering 339, Chemical Engineering 339, 379 (Topic: Introduction to Biochemical Engineering). Prerequisite: Biology 311C with a grade of at least C-, and either Chemistry 339K and 339L, or 369.","upper":true},{"key":"BIO 336","name":"Tumor Biology","description":"Natural history and causal mechanisms of cancer; viral and chemical carcinogens. Three lecture hours a week for one semester. Biology 336 and 391M may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 330 or 360K with a grade of at least C-.","upper":true},{"key":"BIO 337J","name":"Computational Biology Laboratory","description":"Overview of computational biology, with emphasis on nucleic acid sequence analysis and databases. Class projects and self-learning exercises. Two lecture hours and three computer laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 338","name":"Environmental Health","description":"Introduction to the major areas of environmental health, including hazards in the environment, the effects of environmental contaminants, and various approaches to addressing major environmental health problems. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Public Health 354, and Biology 328M or Statistics and Scientific Computation 328M.","upper":true},{"key":"BIO 438L","name":"Animal Communication","description":"Animal communication from a multidisciplinary perspective, with emphasis on quantitative analysis, sensory processing, and evolution of signals. Three lecture hours and three laboratory hours a week for one semester, with computer laboratory hours as required. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 359K or 370 with a grade of at least C-.","upper":true},{"key":"BIO 339","name":"Metabolism and Biochemistry of Microorganisms","description":"A study of the metabolic processes of microorganisms, using a biochemical approach. Three lecture hours a week for one semester. Biology 339 and 391R may not both be counted. Prerequisite: Biology 326R with a grade of at least C-, and Chemistry 310M and 310N.","upper":true},{"key":"BIO 339M","name":"Bacterial Behavior and Signaling Mechanisms","description":"Advanced studies in how bacteria perceive their environment and communicate with each other. Subjects may include chemotaxis and motility, morphogenesis and development, and secretion and virulence. Taught entirely through reading and discussion of original articles. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 326R with a grade of at least C-.","upper":true},{"key":"BIO 340L","name":"Biology of Birds","description":"Anatomy, physiology, classification, and ecology of birds. Two lecture hours and three laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 341R","name":"Public Health Research","description":"Same as Public Health 341R. Students conduct public health research, mentored by professionals at public health practice agencies or faculty at graduate schools of public health throughout Texas. An average of twelve hours of fieldwork a week for a total of at least 180 hours.  May be repeated for credit. Prerequisite: Biology 325 or 325H with a grade of at least C-; students must also submit a proposal to the instructor.","upper":true},{"key":"BIO 343M","name":"Transmembrane Signaling Mechanisms","description":"Mechanisms by which hormones, light, and other stimuli trigger changes in plant and animal cell metabolism. Three lecture hours a week for one semester. Biology 343M and 388C may not both be counted. Prerequisite: Biology 325 or 325H, and Chemistry 339K with a grade of at least C- in each.","upper":true},{"key":"BIO 344","name":"Molecular Biology","description":"Molecular basis of cellular processes: gene structure and function, DNA replication, RNA and protein synthesis, viruses, molecular aspects of immunology and cancer, and recombinant DNA. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 345","name":"Cell Physiology","description":"An integrated approach to basic processes in physiology: metabolism, transport, energetics, molecular and cellular control mechanisms. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Chemistry 310M.","upper":true},{"key":"BIO 345E","name":"Endocrinology","description":"Vertebrate endocrinology (primarily mammalian), with a focus on human pathophysiology. Three lecture hours and one discussion hour a week for one semester. Biology 337 (Topic: Endocrinology) and 345E may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 346","name":"Human Biology","description":"Introduction to human evolution, genetics, sexuality, senescence, and population growth. Three lecture hours and one discussion hour a week for one semester. Biology 309F and 346 may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 446L","name":"Human Microscopic and Gross Anatomy","description":"Designed for students preparing for biomedical research and the health professions. Focuses on microscopic and gross anatomy of human tissues and organs, with an emphasis on structure function relationships. Subjects include the effects of disease and aging in addition to normal human anatomy. Three lecture hours and four laboratory hours a week for one semester. Biology 416K and 446L may not both be counted. Prerequisite: Biology 311C; Biology 325 or 325H with a grade of at least C-; Chemistry 301 with a grade of at least C-; and one of the following courses with a grade of at least C-: Mathematics 408C, 408K, 408N, 408R, Statistics and Scientific Computation 302.","upper":true},{"key":"BIO 347","name":"Biology and Genetics of Immune Disorders","description":"Immune disorders in mammals, including humans, used as models for examining basic immunological and immunogenetic principles; emphasis on immune disorders of vertebrates. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 448L","name":"Invertebrate Biology","description":"A study of the diversity and evolution of multicellular invertebrate animals, with emphasis on common themes in animal body construction and function. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 349","name":"Developmental Biology","description":"Principles of animal development, with emphasis on developmental mechanisms. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 349L","name":"Experiments in Developmental Biology","description":"An investigation of methods and principles of developmental biology in a laboratory context, with emphasis on animal embryology using molecular techniques and microscopy. One lecture hour and six laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-; and credit with a grade of at least C- or registration for Biology 349.","upper":true},{"key":"BIO 350M","name":"Plant Molecular Biology","description":"Fundamentals of plant molecular biology, including structure and expression of the chloroplast and mitochondrial genomes. Three lecture hours a week for one semester. Biology 350M and 388M may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 351","name":"Economic Botany","description":"An in-depth analysis of the origin of domesticated plant species, the role in nature of plant products, and the ways natural products have been altered through artificial selection. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 352","name":"Reproductive Biology of Flowering Plants","description":"Pollination biology, breeding systems, reproductive strategies, and fruit and seed dispersal from evolutionary and ecological vantage points. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 353","name":"Introduction to Health Informatics","description":"Examines the clinical aspects of information science, and the nature of information in healthcare. Subjects include conceptual models of data and information and how data and information are delivered throughout the continuum of healthcare; the information requirements for specific issues in healthcare and how those requirements are addressed; and issues surrounding healthcare data storage, access, and retrieval. Biology 337 (Topic: Introduction to Health Informatics) and 353 may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 353F","name":"Field Entomology","description":"A field course on insects, with emphasis on field study techniques, visual identification of species, collecting techniques, and curation in the field. Meets five days a week for one hour a day during a summer-session term; additional fieldwork to be arranged, including extended field trips. Biology 353F and Biology 337 (Topic: Field Entomology) may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 453L","name":"Entomology","description":"Characteristics, importance, and biology of the major groups of insects. Two lecture hours and three laboratory hours a week for one semester, with additional fieldwork hours to be arranged. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 354","name":"Epidemiology","description":"Introduction to basic principles and concepts in epidemiology, including descriptive epidemiology, association and causation, basic epidemiological study design, evidence-based decision analysis, and applications of epidemiology methods to basic and clinical science. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-; Public Health 317 with a grade of at least B-; and credit or registration for Biology 328M, or Statistics Scientific Computation 328M.","upper":true},{"key":"BIO 354C","name":"Cell Biology of Human Birth Defects","description":"Explores the link between basic cell biology, human genetics, and human birth defects using current scientific literature exposing students to critical thinking and the scientific method, as well as the application of these tools to the study of biology. Three lecture hours a week for one semester. Biology 337 (Topic: Developing Biology) and Biology 354C may not both be counted. Prerequisite: Biology 349 with a grade of at least C-.","upper":true},{"key":"BIO 354L","name":"Ichthyology","description":"Overview of the evolution, biology, and ecology of fishes, emphasizing freshwater fishes. Three lecture hours and three hours of laboratory or fieldwork a week for one semester, with field trips to be arranged. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 455L","name":"Vertebrate Natural History","description":"Phylogeny, taxonomy, life histories, habits, and distribution. Two lecture hours and three hours of laboratory or fieldwork a week for one semester, with field trips to be arranged. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 456L","name":"Limnology and Oceanography","description":"Same as Marine Sciences 440. An introduction to the study of the interactions between aquatic organisms and their environments. Two lecture hours and six laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Chemistry 302 or 302H.","upper":true},{"key":"BIO 357","name":"Evolutionary Ecology","description":"Principles of modern ecology, particularly as they relate to natural selection and evolutionary theory. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 359J","name":"Behavioral Ecology","description":"Advanced topics in behavioral ecology, with detailed consideration of animal communication, altruism, sexual selection, plant-animal interactions. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 359K or 370 with a grade of at least C-.","upper":true},{"key":"BIO 359K","name":"Principles of Animal Behavior","description":"An introduction to the study of animal behavior: descriptive analysis of behavior; physiological basis of behavior; development of behavior; adaptive significance and evolution of behavior; communication and social behavior. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 359R","name":"Animal Sexuality","description":"The biology of sexuality, including genetics, morphology, physiology, and psychology of sex. Three lecture hours and one discussion hour  a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 360K","name":"Immunology","description":"The basic concepts of humoral and cell-associated immune phenomena. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 326R (or 226R) with a grade of at least C-.","upper":true},{"key":"BIO 160L","name":"Immunology Laboratory","description":"Current techniques in experimental cellular and humoral immunology. Three laboratory hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Biology 360K.","upper":true},{"key":"BIO 360M","name":"Molecular Immunology","description":"An advanced immunology course with an emphasis on molecular models and medical relevance. Three lecture hours a week for one semester. Biology 337 (Topic: Molecular Immunology) and 360M may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 360K with a grade of at least B-.","upper":true},{"key":"BIO 361","name":"Human Infectious Diseases","description":"Etiology, pathogenesis, diagnosis, and immunobiology of the major microbial diseases, with emphasis on their prevention. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 326R with a grade of at least C-.","upper":true},{"key":"BIO 361L","name":"Public Health Bacteriology Laboratory","description":"Training in techniques required for independent work in diagnostic and epidemiological bacteriology. Two lecture hours and five laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 126L and 326R (or 226R) with a grade of at least C- in each.","upper":true},{"key":"BIO 361P","name":"Public Health Internship","description":"Students conduct a public health research project off campus at a public health practice agency or a graduate school of public health. The equivalent of twelve lecture hours a week for one semester, with additional hours to be arranged.  May be repeated for credit. Prerequisite: The following coursework with a grade of at least B- in each: Biology 226L, and Biology 326M or 326R; and completion of an internship application, available online at the Portal of Public Health page.","upper":true},{"key":"BIO 361T","name":"Comparative Animal Physiology","description":"Physiology of organ systems in animal phyla, with special emphasis on physiological adaptations of organisms to their environment. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 364","name":"Microbial Ecology","description":"The ability of microbes to adapt to and change their environment. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 326R with a grade of at least C-.","upper":true},{"key":"BIO 364E","name":"Current Topics in Advanced Microbial Ecology","description":"Development and structure of microbial communities, microbial phylogeny, endosymbiont and symbiont relationships, biogeochemistry, elemental cycling by microbes, and the microbial ecology of disease. Emphasis on active research areas in these topics. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H, and 364 with a grade of at least C- in each.","upper":true},{"key":"BIO 365N","name":"Development and Plasticity of the Nervous System","description":"An introduction to the principles by which the neural tube (brain and spinal cord) develops during embryogenesis, including regionalization of the brain into forebrain, midbrain, hindbrain, and spinal cord. Particular emphasis will be given to the mechanisms that govern how neurons acquire their identity and form neuronal circuits and synapses. Developmental and congenital diseases and possible therapies, including stem cell based therapy or gene therapy. Three lecture hours a week for one semester. Prerequisite: Biology 349 with a grade of at least C-, and Biology 365R or 371M with a grade of at least C-.","upper":true},{"key":"BIO 365S","name":"Systems Physiology","description":"Overview of human physiology, including body fluids, the cardiovascular system, respiration, digestion, metabolism, and endocrinology. Three lecture hours and one discussion hour a week for one semester. May not be counted by students with credit for Biology 416L. Prerequisite: Biology 311C; Biology 325 or 325H with a grade of at least C-; Chemistry 301 with a grade of at least C-; and one of the following with a grade of at least C-: Mathematics 408C, 408K, 408N, 408R, Statistics and Data Sciences 302, (or Statistics and Scientific Computation 302).","upper":true},{"key":"BIO 165U","name":"Systems Physiology Laboratory","description":"Using an inquiry-based approach, provides students with an opportunity for hands-on experience in human physiology. Students read primary scientific literature; collect, analyze, and present data; and write detailed reports on laboratory activities. Four laboratory hours a week for one semester. May not be counted by students with credit for Biology 416L. Prerequisite: Biology 325 or 325H with a grade of at least C-, and credit or registration for Biology 365S.","upper":true},{"key":"BIO 366","name":"Microbial Genetics","description":"Molecular biology of nucleic acids; biosynthesis of macromolecules, transfer of genetic material from cell to cell, recombination, mutagenesis, and regulatory mechanisms. Three lecture hours a week for one semester. Biology 366 and 391S may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 326R with a grade of at least C-.","upper":true},{"key":"BIO 366R","name":"Molecular Genetics","description":"Techniques used for studying molecular biology and transgenic organisms. Includes advanced genetics and the molecular genetics used in clinical applications. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 367W","name":"Laboratory in Behavioral Neuroscience","description":"Behavioral experiments with rodents aimed at elucidating the neural mechanisms of psychological processes such as memory, anxiety, and incentive motivation. One lecture hour and five laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-; and Biology 365R, or Neuroscience 330 and 335 with a grade of at least C-.","upper":true},{"key":"BIO 368L","name":"Techniques in Molecular Genetics","description":"Laboratory experience in mutagenesis, transformation, transduction, isolation of plasmid and bacteriophage DNA, in vitro recombinant DNA procedures, and DNA base sequencing. One lecture hour and seven laboratory hours a week for one semester. Biology 368L and 390P may not both be counted. Prerequisite: Biology 325 or 325H, and 126L with a grade of at least C- in each.","upper":true},{"key":"BIO 369F","name":"Field Herpetology","description":"Species identification by sight and sound, and research techniques such as sampling populations, data collection, and analysis. One lecture hour and five laboratory hours a week for one semester, with additional field hours to be arranged. Prerequisite: Biology 325 or 325H with a grade of at least C-; and credit or registration for Biology 369L.","upper":true},{"key":"BIO 369L","name":"Herpetology","description":"Biology of amphibians and reptiles, including evolution, ecology, behavior, physiology, life history, and identification. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Biology 325 or 325H, and 370.","upper":true},{"key":"BIO 370","name":"Evolution","description":"Introduction to modern evolutionary biology, focusing on the evolution of molecular, developmental, morphological, and behavioral traits. Genetic and ecological bases of evolutionary changes within populations and of evolutionary divergence in animals and plants. Three lecture hours and one discussion hour a week for one semester. Biology 370 and 385K (Topic 2: Evolution) may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 471G","name":"Natural History Museum Science","description":"An introduction to curatorial practices in natural history museums. Three lecture hours and one discussion hour a week for one semester; students also complete a twenty- to thirty-hour curatorial project. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 371L","name":"Experimental Physiology","description":"Experimental approach to physiological mechanisms by which animals adapt to their environment. One lecture hour, four laboratory hours, and two hours of computer work a week for one semester. Prerequisite: Biology 205L, 206L, 208L, or 126L with a grade of at least C-; and Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 371M","name":"Neuronal Basis of Brain and Behavior","description":"The nervous system, with emphasis on vertebrate neurobiology. Three lecture hours and one discussion hour a week for one semester. Biology 365R and 371M may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 472L","name":"Taxonomic Plant Anatomy","description":"An advanced course emphasizing those aspects of plant anatomy that are most reliable and useful for systematic purposes. Three lecture hours and two laboratory hours a week for one semester. Biology 472L and 487G may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 374 and 174L with a grade of at least C- in each.","upper":true},{"key":"BIO 373","name":"Ecology","description":"An introduction to ecology, the study of relationships among organisms and between organisms and their environment; adaptations, population, communities, and ecosystems. Includes both plants and animals and both terrestrial and aquatic ecosystems. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 373L","name":"Ecology Laboratory","description":"Intensive field ecology. Includes group field experiment and observation, independent projects, and field trips to other vegetation zones.  Students complete weekly write-ups of observation and data analysis, reports of independent projects, and an oral presentation on an independent project. Four laboratory hours and two workshop/lecture hours a week for one semester. Prerequisite: Credit or registration for Biology 373.","upper":true},{"key":"BIO 374","name":"Plant Anatomy with Histological Techniques","description":"Tissue organization and cellular details of stems, roots, and leaves of seed plants, with emphasis on development and function. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and concurrent enrollment in Biology 174L.","upper":true},{"key":"BIO 174L","name":"Laboratory in Plant Anatomy and Histological Techniques","description":"Demonstration of cellular details and tissue systems of plant organs; instruction in the preparation of plant materials for histological examination. Three laboratory hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Biology 374.","upper":true},{"key":"BIO 375","name":"Conservation Biology","description":"Application of principles of ecology to the preservation of wild plant and animal species and to the preservation, management, and restoration of natural and seminatural ecosystems. Emphasis on scientific, biological aspects of issues such as endangered species protection, preserve design, and forest management. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Biology 357, 359J, or 373 with a grade of at least C-.","upper":true},{"key":"BIO 478L","name":"Comparative Vertebrate Anatomy","description":"Study of vertebrate morphology from developmental anatomy to the function, biomechanics, and phylogenetic relationships of living and fossil taxa. Three lecture hours and four laboratory hours a week for one semester. Biology 478L and Kinesiology 324K may not both be counted. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"BIO 379G","name":"Advanced Mammalian Genetics","description":"Molecular developmental genetics and review of classical genetics. Possible topics include but are not limited to cancer, AIDS, forensic genetics, genomics, and gene therapy. Three lecture hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least B-.","upper":true}]