[{"key":"MKT 320F","name":"Foundations of Marketing","description":"Restricted to non-McCombs School of Business majors. Introduction to basic concepts and terminology in marketing: the process of developing marketing strategy, the role of marketing activities within the firm, external influences that affect the development of marketing strategy, and basic analytical tools appropriate to marketing decision making. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Business Administration degree. Prerequisite: Upper-division standing.","upper":true},{"key":"MKT 337","name":"Principles of Marketing","description":"Restricted to students in a McCombs School of Business major. Designed to expand understanding of the marketing system and basic marketing activities and to provide a framework for marketing strategy development and implementation of marketing tools and tactics. Three lecture hours a week for one semester. Marketing 337 and 337H may not both be counted. Prerequisite: Credit or registration for Business Administration 324 or 324H, and Statistics 309 or 309H.","upper":true},{"key":"MKT 337H","name":"Principles of Marketing: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Designed to expand understanding of the marketing system and basic marketing activities and to provide a framework for marketing strategy development and implementation of marketing tools and tactics. Three lecture hours a week for one semester. Marketing 337 and 337H may not both be counted. Prerequisite: Credit or registration for Accounting 312H, Business Administration 324H, and Statistics 309 or 309H.","upper":true},{"key":"MKT 338","name":"Promotional Policies","description":"Restricted to students in a business major. Analysis of the use of promotional methods in marketing: advertising, personal selling, sales promotion, and indirect promotion; their social and economic consequences; their coordination and relationship to other business functions. Three lecture hours a week for one semester. Prerequisite: Marketing 337 or 337H.","upper":true},{"key":"MKT 353","name":"Internship in Marketing and International Business","description":"Restricted to students in a business major. Focuses on students' career goals through academic discussion and evaluations, while placing students in professional internships with public and private enterprises. Internship and discussion hours to be arranged. Only one of the following may be counted toward the Bachelor of Business Administration: Accounting 353J, Business Administration 353, 353H, Finance 353, Management 353, Management Information Systems 353, Marketing 353, Operations Management 353. May not be counted toward the student's major requirement. Offered on the pass/fail basis only. Prerequisite: Completion of forty-five semester hours of college coursework and consent of the departmental internship coordinator.","upper":true},{"key":"MKT 460","name":"Information and Analysis","description":"Restricted to students in a business major. The development and analysis of information for marketing management sources. Three lecture hours and one recitation hour a week for one semester. Prerequisite: Marketing 337 or 337H, and Statistics 309 or 309H.","upper":true},{"key":"MKT 363","name":"Professional Selling and Sales Management","description":"Restricted to students in a business major. Policies, operation, coordination, and control of personal selling activities in marketing organizations. Three lecture hours a week for one semester. Prerequisite: Marketing 337 or 337H.","upper":true},{"key":"MKT 366P","name":"Special Projects in Marketing Practicum","description":"Restricted to business majors. Students apply skills in their major area and focus on additional project management skills through group projects conducted in a professional setting. Students may work with a private or a public enterprise. The equivalent of three lecture hours a week for one semester. Prerequisite: Completion of forty-five semester hours of college coursework, and Marketing 337 or 337H.","upper":true},{"key":"MKT 370","name":"Marketing Policies","description":"Restricted to students in a McCombs School of Business major. A capstone course focusing on case studies of advanced marketing problems, including analysis of markets, promotional planning, pricing, and distribution coordination. Designed to help the student develop a comprehensive understanding of marketing policy and strategy formulation. Three lecture hours a week for one semester. Prerequisite: Ninety semester hours of college coursework, including Marketing 460; credit or registration for one of the following: Accounting 353J, 366P, Business Administration 353, 353H, Finance 353, 366P, Management 353, 366P, Management Information Systems 353, 366P, Marketing 353, 366P, Operations Management 353, 366P; and six additional semester hours of elective coursework in marketing.","upper":true},{"key":"MKT 370K","name":"Retail Merchandising","description":"Restricted to students in a business major. Designed to familiarize the student with all the activities associated with the sale of goods and services for final consumption and to provide an overview of the decisions involved in merchandising and management, including factors that influence and determine those decisions. Three lecture hours a week for one semester. Prerequisite: Marketing 337 or 337H.","upper":true},{"key":"MKT 372","name":"Marketing Seminar","description":"Restricted to students in a business major.  Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Marketing 337 or 337H. Additional prerequisites may be required for some topics; these are given in the Course Schedule.","upper":true}]