[{"key":"BDP 306","name":"Fundamentals of Ethical Leadership","description":"Restricted to freshmen and sophomores, and to students in the Bridging Disciplines Programs. Discussion of various contemporary issues related to ethical leadership, with an emphasis on interdisciplinary perspectives and critical discourse. Three lecture hours a week for one semester.  Offered on the letter-grade basis only.","upper":false},{"key":"BDP 306C","name":"Principles of Business","description":"Restricted to nonbusiness students. Interdisciplinary examination of how businesses function in the Western world. Discusses the development of the corporation in the United States, ethical issues, and the primary areas of business. Three lecture hours a week for one semester. Bridging Disciplines 301 (Topic: Principles of Business) and 306C may not both be counted. Offered on the letter-grade basis only.","upper":false},{"key":"BDP 310S","name":"Connecting Research Experience: Service Learning","description":"Restricted to students in the Bridging Disciplines Programs. Supervised research with a faculty member, related to the interdisciplinary themes of a Bridging Disciplines Program and including an academic service-learning component. Research may consist of an individual project involving service to the community or assisting a faculty research project with a community service component. Individual instruction. With consent of the Bridging Disciplines research coordinator, may be repeated for credit. Prerequisite: Consent of the Bridging Disciplines research coordinator.","upper":false},{"key":"BDP 311S","name":"Connecting Internship Experience: Service Learning","description":"Restricted to students in the Bridging Disciplines Programs. Supervised internship experience related to the interdisciplinary themes of a Bridging Disciplines Program and including an academic service-learning component. Internships must be unpaid and may include work with nonprofit organizations or other organized community service entities. Ten hours of fieldwork a week for one semester. With consent of the Bridging Disciplines research coordinator, may be repeated once for credit. Prerequisite: Consent of the Bridging Disciplines research coordinator.","upper":false},{"key":"BDP 319D","name":"Introduction to Digital Media Production","description":"Introduction to digital media production, including the fundamentals of software programs used for digital design, web production, animation, and other functions. Three lecture hours a week for one semester. Bridging Disciplines 319 (Topic: Introduction to Digital Media Production) and 319D may not both be counted.","upper":false},{"key":"BDP 320F","name":"Connecting Research Experience","description":"Restricted to students in the Bridging Disciplines Programs. Supervised research with a faculty member, related to the interdisciplinary themes of a Bridging Disciplines Program. Research may consist of an individual project and must meet the criteria for the Independent Inquiry flag. The equivalent of three lecture hours a week for one semester. With consent of the Bridging Disciplines research coordinator, may be repeated for credit. Prerequisite: Consent of the Bridging Disciplines research coordinator.","upper":true},{"key":"BDP 320S","name":"Connecting Research Experience: Service Learning","description":"Restricted to students in the Bridging Disciplines Programs. Supervised research with a faculty member, related to the interdisciplinary themes of a Bridging Disciplines Program and including an academic service-learning component. Research may consist of an individual project involving service to the community or assisting a faculty research project with a community service component. Individual instruction. With consent of the Bridging Disciplines research coordinator, may be repeated for credit. Prerequisite: Upper-division standing and consent of the Bridging Disciplines research coordinator.","upper":true},{"key":"BDP 321S","name":"Connecting Internship Experience: Service Learning","description":"Restricted to students in the Bridging Disciplines Programs. Supervised internship experience related to the interdisciplinary themes of a Bridging Disciplines Program and including an academic service-learning component. Internships must be unpaid and may include work with nonprofit organizations or other organized community service entities. Ten hours of fieldwork a week for one semester. With consent of the Bridging Disciplines research coordinator, may be repeated once for credit. Prerequisite: Upper-division standing and consent of the Bridging Disciplines research coordinator.","upper":true},{"key":"BDP 322","name":"Team-Based Research Experience","description":"Collaborative or team-based research or creative project, under the supervision of a faculty member. Topics are related to the interdisciplinary themes of the Bridging Disciplines Programs. Individual instruction. With consent of the Bridging Disciplines research coordinator, may be repeated for credit when the topics vary. Prerequisite: Upper-division standing and consent of the Bridging Disciplines research coordinator. Additional prerequisites may vary with the topic.","upper":true}]