[{"key":"DEV 000M","name":"Basic Mathematics and Algebra Skills","description":"Developmental mathematics instruction. Emphasis on fundamental mathematics, including computation skills, graphing, and solving word problems, and on algebraic graphing, equations, operations, and quadratics. Three lecture hours a week for one semester. Offered on the satisfactory/unsatisfactory basis only. With consent of the Texas Success Initiative office, may be repeated for credit. May not be counted toward any degree.","upper":false},{"key":"DEV 301M","name":"Developmental Mathematics I","description":"The first of a two-course sequence. Combines arithmetic skills, including operations with whole numbers, fractions, and decimals, and ratios, proportions, and percents; with beginning algebra, including variables, straight-line graphs, setting up and solving word problems, and relating simple algebraic concepts to geometry. Three lecture hours a week for one semester. Offered on the satisfactory/unsatisfactory basis only. With consent of the Texas Success Initiative office, may be repeated for credit. May not be counted toward any degree.","upper":false},{"key":"DEV 302M","name":"Developmental Mathematics II","description":"Continuation of Developmental Studies 301M. Includes linear equations, systems of equations, integers, exponents and scientific notation, factoring polynomials, rational expressions and equations, radical expressions, and geometric problems. Three lecture hours a week for one semester. Offered on the satisfactory/unsatisfactory basis only. With consent of the Texas Success Initiative office, may be repeated for credit. May not be counted toward any degree.","upper":false},{"key":"DEV 303M","name":"Basic Mathematics and Algebra Skills Review","description":"Three lecture hours a week for one semester. Offered on the satisfactory/unsatisfactory basis only. With consent of the Texas Success Initiative office, may be repeated for credit. May not be counted toward any degree.","upper":false}]