[{"key":"UGS 302","name":"First-Year Signature Course","description":"Restricted to first-year students. Seminar class focusing on a contemporary issue. Designed to introduce undergraduates to scholarly analysis from an interdisciplinary perspective. Includes an introduction to University resources, such as research facilities, museums, and attendance at University lectures or performances as assigned. Multiple sections may be offered in the fall and spring with various topics and instructors. Three lecture hours a week for one semester. Some sections may require additional meeting times; these are identified in the Course Schedule. Only one of the following may be counted: Tutorial Course 302, Undergraduate Studies 302, 303.","upper":false},{"key":"UGS 303","name":"First-Year Signature Course","description":"Restricted to first-year students. Large-group lecture and discussion class focusing on a contemporary issue. Designed to introduce undergraduates to scholarly analysis from an interdisciplinary perspective. Includes an introduction to University resources, such as research facilities, museums, and attendance at University lectures or performances as assigned. Multiple sections may be offered in the fall and spring with various topics and instructors. Three lecture hours a week for one semester. Some sections may require additional meeting times; these are identified in the Course Schedule. Only one of the following may be counted: Tutorial Course 302, Undergraduate Studies 302, 303.","upper":false},{"key":"UGS 104","name":"First-Year Interest Group Mentor Seminar","description":"Restricted to students selected as mentors for the First-Year Interest Group program. Issues and research in various areas of leadership, communication, student development, and the transition from high school to college. One lecture hour a week for one semester.  Offered on the pass/fail basis only. Prerequisite: Consent of the program coordinator of the First-Year Interest Group program office.","upper":false},{"key":"UGS 309","name":"Analytical Reading and Writing","description":"Examination of fundamental concepts in analytical reading from different disciplinary perspectives, with an emphasis on sociocultural influences on comprehension and writing styles. Three lecture hours a week for one semester. Prerequisite: Consent of the Texas Success Initiative coordinator.","upper":false},{"key":"UGS 312","name":"Research Methods","description":"Interdisciplinary introduction to research methods, designed to lead students through the process of designing an undergraduate research project. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of the undergraduate research coordinator.","upper":false},{"key":"UGS 017","name":"First-Year Connection Seminar","description":"Restricted to students in a First-Year Connection seminar program. Basic issues in various interdisciplinary fields of study. One lecture hour a week for one semester. May not be counted toward any University of Texas at Austin degree. May be repeated for credit.","upper":false},{"key":"UGS 018","name":"First-Year Interest Group Seminar","description":"Restricted to students in the First-Year Interest Group Program. Basic issues in various interdisciplinary fields of study. One lecture hour a week for one semester.","upper":false},{"key":"UGS 018S","name":"Sophomore Interest Group Seminar","description":"Restricted to students in the Sophomore Interest Group program. Basic issues in various interdisciplinary fields of study. One lecture hour a week for one semester. May not be counted toward any University of Texas at Austin degree. May be repeated for credit.","upper":false},{"key":"UGS 018T","name":"Transfer Interest Group Seminar","description":"Restricted to students in the Transfer Interest Group Program. Basic issues in various interdisciplinary fields of study. One lecture hour a week for one semester. May not be counted toward any University of Texas at Austin degree. May be repeated for credit.","upper":false},{"key":"UGS 119","name":"International Learning Seminar","description":"Restricted to students registered in a Maymester Abroad course. Discussion of various issues related to the academic, cultural, and personal aspects of studying abroad in particular locations. Two lecture hours a week for eight weeks, or as required by the topic.  May be repeated for credit when the topics vary. Offered on the letter-grade basis only.","upper":false},{"key":"UGS 320F","name":"Undergraduate Research Experience","description":"Supervised research with a faculty member. Research may consist of an individual project and must meet the criteria for the independent inquiry flag. The equivalent of three lecture hours a week for one semester. With consent of the undergraduate studies research coordinator, may be repeated for credit. Prerequisite: Upper-division standing and consent of the undergraduate studies research coordinator.","upper":true},{"key":"UGS 122","name":"DemTex","description":"Student-facilitated research and discussion-based course, under the supervision of a faculty adviser. One lecture hour a week for one semester. With the consent of the research coordinator in the School of Undergraduate Studies, may be repeated for credit when the topics vary. May not be counted toward any degree. Offered on the pass/fail basis only. Prerequisite: Consent of the research coordinator in the School of Undergraduate Studies.","upper":true}]