[{"key":"UTS 101","name":"Secondary Teacher Education Preparation: STEP 1","description":"Introduction to mathematics, computer science, and science teaching as a career. Discussions include standards-based lesson design and various teaching and behavior management strategies. Fieldwork consists of planning and teaching four inquiry-based lessons to students in grades three to six in local elementary schools. One and one-half class hours a week for one semester; at least ten hours of fieldwork a semester are also required. Chemistry 107 (Topic: STEP 1--UTeach) and UTeach-Natural Sciences 101 may not both be counted. Prerequisite: A University grade point average of at least 2.20.","upper":false},{"key":"UTS 110","name":"Secondary Teacher Education Preparation: STEP 2","description":"Topics may include routes to teacher certification in mathematics, computer science, and science teaching; various teaching methods that are designed to meet instructional goals; and learner outcomes. Students develop and teach three inquiry-based lessons in their field in a middle school, and participate in peer coaching. One and one-half class hours a week for one semester; at least twenty hours of fieldwork a semester are also required. Biology 101C (Topic: STEP 2) and UTeach-Natural Sciences 110 may not both be counted. Prerequisite: UTeach-Natural Sciences 101 with a grade of at least C-, and a University grade point average of at least 2.20.","upper":false},{"key":"UTS 350","name":"Knowing and Learning in Math and Science","description":"Same as Curriculum and Instruction 365C. Restricted to students in the UTeach-Natural Sciences program. Psychological foundations of learning; problem solving in mathematics and science education utilizing technology; principles of expertise and novice understanding of subject matter; implications of high-stakes testing; and foundations of formative and summative assessment. Three lecture hours a week for one semester; additional hours may be required. Only one of the following may be counted: Curriculum and Instruction 365C, 371 (Topic 21: Knowing and Learning in Math and Science), UTeach-Natural Sciences 350. Prerequisite: Credit with a grade of at least C- or registration for UTeach-Natural Sciences 101.","upper":true},{"key":"UTS 355","name":"Classroom Interactions","description":"Same as Curriculum and Instruction 365D. Restricted to students in the UTeach-Natural Sciences program. Principles of delivering effective instruction in various formats (lecture, lab activity, collaborative settings); examination of gender, class, race, and culture in mathematics and science education; overview of policy related to mathematics and science education. Three lecture hours a week for one semester; additional hours may be required. Only one of the following may be counted: Curriculum and Instruction 365D, 371 (Topic 20), UTeach-Natural Sciences 355. Prerequisite: The following courses with a grade of at least C-: Curriculum and Instruction 365C or UTeach-Natural Sciences 350, and UTeach-Natural Sciences 110; and a University grade point average of at least 2.75.","upper":true},{"key":"UTS 360","name":"Project-Based Instruction","description":"Same as Curriculum and Instruction 365E. Restricted to students in the UTeach-Natural Sciences program who have earned a passing score on the preliminary portfolio. Foundations of project-based, case-based, and problem-based learning environments; principles of project-based curriculum development in mathematics and science education; classroom management and organization of project-based learning classrooms. Three lecture hours a week for one semester with additional fieldwork hours to be arranged. Only one of the following may be counted: Curriculum and Instruction 365E, 371 (Topic 22: Project-Based Instruction), UTeach-Natural Sciences 360. Prerequisite: Curriculum and Instruction 365D or UTeach-Natural Sciences 355 with a grade of at least C-, and a University grade point average of at least 2.75.","upper":true},{"key":"UTS 170","name":"Student Teaching Seminar","description":"Restricted to students in the UTeach-Natural Sciences program who have earned a passing score on the preliminary portfolio. Discussions include student teaching experiences, contemporary critical issues in education, and preparation for the state certification exam. One lecture hour a week for one semester. Chemistry 107 (Topic: Special Topics Seminar) and UTeach-Natural Sciences 170 may not both be counted. Prerequisite: Credit or registration for Curriculum and Instruction 650S, and a University grade point average of at least 2.75.","upper":true},{"key":"UTS 675","name":"Student Teaching for Secondary and Middle Grades","description":"Closely supervised field coursework in a cooperating school. Experience includes carrying out the duties of a secondary or middle grades teacher. Twenty hours of fieldwork a week for one semester.  Offered on the pass/fail basis only. Prerequisite: A University grade point average of at least 2.50, approval of the preliminary portfolio by the College of Natural Sciences UTeach Program, consent of the UTeach adviser in the College of Natural Sciences, and concurrent enrollment in UTeach-Natural Sciences 170.","upper":true}]