[{"key":"EVS 311","name":"Field Seminar in Sustainability","description":"Designed for students pursuing a Bachelor of Science in Environmental Science. Introduces field observation and analysis of environmental processes and sustainability issues. Topics include ecology, hydrogeology, marine science, climate science, energy, and campus sustainability. Two lecture hours and four laboratory or field laboratory hours a week for one semester. Prerequisite: Consent of instructor.","upper":false},{"key":"EVS 331","name":"Research Methods for the Environmental Sciences","description":"Designed for students pursuing a Bachelor of Science in Environmental Science. Topics include experimental design, statistical analysis and modeling, and ethics. Students develop and conduct an independent research project during the laboratory portion of the course. Two lecture hours and four laboratory or field laboratory hours a week for one semester. Prerequisite: Environmental Science 311 with a grade of at least C-, and consent of instructor.","upper":true},{"key":"EVS 141","name":"Environmental Science Professionalism I","description":"Examines the fundamental, nontechnical aspects of environmental science and sustainability practices through the use of case studies and projects that use interdisciplinary approaches. Subjects may include the importance of interdisciplinary collaboration in addressing and assessing environmental science processes, the development of professional opportunities across disciplines, understanding professional responsibilities, applying ethical principles, the balance of multidisciplinary demands in professional practice, and the need for lifelong learning. One lecture hour a week for one semester. Prerequisite: Senior standing, Environmental Science 311 and 331, and admission to an environmental science major.","upper":true},{"key":"EVS 151","name":"Environmental Science Professionalism II","description":"Examines the fundamental, nontechnical aspects of environmental science and sustainability practices. Focuses on the use of interdisciplinary communication for addressing and assessing environmental science processes, the challenges posed by communicating across disciplines, the development of professional communication and public speaking skills,  effective presentation of research, the ethics and practices of peer research review, and effective communication of the effects of environmental science in a global society. One lecture hour a week for one semester. Prerequisite: Environmental Science 141.","upper":true}]