[{"key":"GEO 401 (TCCN: GEOL 1403)","name":"Physical Geology","description":"Nature, properties, and distribution of crustal materials; surficial processes; internal processes; origin of continents, oceans, and ocean basins; mineral and fuel resources. Three lecture hours and two hours of laboratory or fieldwork a week for one semester. Only one of the following may be counted: Geological Sciences 401, 303, 312K, 420H.","upper":false},{"key":"GEO 302D","name":"Age of Dinosaurs","description":"An exploration of the general principles of natural history, focusing on the natural history of dinosaurs. An introduction to the basics of geology, anatomy, paleontology, and evolutionary theory, followed by the application of this knowledge, in tracing the evolutionary history of Dinosauria. Three lecture hours and one and one-half laboratory hours a week for one semester. Normally offered in the fall semester only. May not be counted toward a degree in environmental or geological sciences.","upper":false},{"key":"GEO 302M","name":"The Age of Mammals","description":"Introductory-level course on paleontology and natural history for nonscience majors. Basic geological processes, fossilization, and the fossil record. Overview of the \"tree of life.\" Summary of the evolution and diversification of mammals, an introduction to interactions between physical and biological processes, and the impact of climate change and human activities on mammalian communities. Laboratory component focuses on the mammalian skeleton and common Texas mammals. Three lecture hours and one and one-half laboratory hours a week for one semester. Normally offered in the spring semester only. May not be counted toward a degree in environmental or geological sciences.","upper":false},{"key":"GEO 302P","name":"Sustaining a Planet","description":"Restricted to freshmen and sophomores. Examines sustainability and the environment from the perspective of multiple disciplines. Three lecture hours and one and one-half laboratory hours a week for one semester. Normally offered in the spring semester only. May not be counted toward a degree in geological sciences.","upper":false},{"key":"GEO 303","name":"Introduction to Geology","description":"Mineral and rock composition of the earth; measurement of geologic time; origin and evolution of life; earth's interior; plate tectonics; depositional environments and processes; ancient climates; humans, earth resources, and the environment. Two lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Geological Sciences 401, 303, 312K, 420H.","upper":false},{"key":"GEO 303C","name":"Introduction to the Solar System","description":"Examines the origin and evolution of our solar system; how processes such as volcanism and impacts have shaped planet surfaces, as well as the workings of planetary interiors; the unique properties of Earth that allowed life to arise and evolve; the prospects for seeking life on other planets in our own solar system and beyond; and the history of planetary exploration and the methods scientists use to explore fundamental questions regarding our place in the universe. Three lecture hours a week for one semester. Geological Sciences 303C and 310C (Topic: Introduction to the Solar System) may not both be counted.","upper":false},{"key":"GEO 404C","name":"Plate Tectonics and Earth History","description":"Application of plate tectonics to the origin and history of Earth's crust and the origin, evolution, and distribution of living organisms. Three lecture hours and two laboratory hours a week for one semester. Normally offered in the spring semester only. Geological Sciences 404C and 405 may not both be counted. Prerequisite: Geological Sciences 401 or 303 with a grade of at least C-.","upper":false},{"key":"GEO 405 (TCCN: GEOL 1404)","name":"Life through Time","description":"Restricted to freshmen and sophomores. The history and development of life, and the processes of change from the early Precambrian era to the present. Three lecture hours and two laboratory hours a week for one semester. Normally offered in the fall semester only. Geological Sciences 404C and 405 may not both be counted. Prerequisite: Geological Sciences 401 or 303 with a grade of at least C-.","upper":false},{"key":"GEO 305E","name":"Energy and the Environment","description":"A survey of all forms of current and potential sources of energy, and how these might impact the earth's environment. Three lecture hours and one and one-half laboratory hours a week for one semester. May not be counted toward a degree in environmental or geological sciences, geosystems engineering and hydrogeology, or petroleum engineering.","upper":false},{"key":"GEO 306P","name":"Geology and Sustainability","description":"Restricted to environmental science entry-level majors. Examines sustainability and environmental science from an interdisiplinary perspective. Three lecture hours and one and one-half laboratory hours a week for one semester. Normally offered in the fall semester. Prerequisite: Written consent of instructor.","upper":false},{"key":"GEO 211","name":"Emerging Scholars in Geological Sciences","description":"Introduction to research areas in the geological sciences, with emphasis on the skills needed for success in graduate school and the professional workplace. Four laboratory hours a week for one semester. Offered irregularly. May not be substituted for any required geological sciences course. Offered on the pass/fail basis only. Prerequisite: Written consent of instructor.","upper":false},{"key":"GEO 012N","name":"JSG Geosciences Mentors Program - First-year","description":"Restricted to first-year students in the Jackson School of Geosciences. Introduction to the various geosciences disciplines and corresponding degree programs and research areas. Emphasis on the skills needed for success in graduate school and the professional workplace, such as interactive sessions with the Jackson School of Geosciences Career Center to address internships, career planning, and job search skills. One lecture hour a week for one semester. May not be counted toward a degree in geological sciences or environmental sciences. Offered on the pass/fail basis only. Prerequisite: Consent of instructor.","upper":false},{"key":"GEO 114G","name":"Geophysics Colloquium","description":"Open to non-geological sciences majors, but registration priority is given to geological sciences majors. Exploration of a variety of problems in modern geophysics. Two lecture hours a week for one semester, and at least one weekend field trip. Geological Sciences 110C (Topic: Geophysics Colloquium) and 114G may not both be counted. May be repeated for credit. Offered on the pass/fail basis only.","upper":false},{"key":"GEO 416K","name":"Earth Materials","description":"Restricted to majors in the Jackson School of Geosciences; others may register with consent of instructor. Introduction to minerals, mineral study techniques, igneous and metamorphic rocks and ore deposits, and formation processes. Three lecture hours and four laboratory hours a week for one semester. Normally offered in the fall semester only. Prerequisite: Geological Sciences 401 or 303 with a grade of at least C-, Chemistry 301 with a grade of at least C-, and credit with a grade of at least C- or registration for Chemistry 302.","upper":false},{"key":"GEO 416M","name":"Sedimentary Rocks","description":"Restricted to majors in the Jackson School of Geosciences; others may register with consent of instructor. Description and interpretation of sedimentary rocks in hand specimen and thin section; characteristics of sedimentary rocks deposited in different environments. Three lecture hours and four laboratory hours a week for one semester, with two additional one-day field trips to be arranged. Prerequisite: Geological Sciences 401, 303, or 420H with a grade of at least C-.","upper":false},{"key":"GEO 316P","name":"Sedimentary Rocks","description":"Examines the fundamentals of sedimentary rocks, including siliciclastic grain parameters and mineralogy, sediment transport and sedimentary structures; and carbonate mineralogy and geochemistry, grain and matrix constituents, modern facies, and classification. Reviews the principal siliciclastic and carbonate depositional systems, their process of formation and facies architecture and the role of process and architecture in petrophysical patterns, distrubtion of permeability and porosity, flow units, reservoir, heterogeneities, and hydrocarbon recovery. Intended for petroleum and geosystems engineering majors. Three lecture hours a week for one semester. Normally offered in the spring semester. May not be counted toward any degree in geological sciences. Prerequisite: Geological Sciences 401, 303, or 420H with a grade of at least C-.","upper":false},{"key":"GEO 420F","name":"Classic Geology in Scotland","description":"Introduction to the founding concepts of geology. Students use advanced field technologies while studying the geology of Scotland on all scales of size. The equivalent of four lecture hours a week for one semester, including field exercises in a variety of geological settings. Prerequisite: Geological Sciences 401, 303, or other coursework in geology.","upper":true},{"key":"GEO 420H","name":"Honors Introductory Geology","description":"An accelerated introductory course on the composition, structure, and history of the earth. Three lecture hours and two laboratory hours a week for one semester, and several all-day field trips. Normally offered in the fall semester only. Only one of the following may be counted: Geological Sciences 401, 303, 312K, 420H. Prerequisite: Consent of instructor.","upper":true},{"key":"GEO 420K","name":"Introduction to Field and Stratigraphic Methods","description":"For geological sciences majors. Field observation of geological processes and study of the mineralogy, petrology, stratigraphy, paleontology, and structural geology of central Texas. Two lecture hours and three laboratory hours a week for one semester, and six weekend field trips. Geological Sciences 420K and 320L may not both be counted. Prerequisite: Geological Sciences 416K and 416M with a grade of at least C- in each.","upper":true},{"key":"GEO 320L","name":"Introductory Field Geology","description":"Study of geologic features and processes in the field, designed for nongeologists; emphasizes regional geology of central Texas and techniques of geologic mapping. The equivalent of three lecture hours a week for one semester. Normally offered between the spring semester and the summer session only. Geological Sciences 420K and 320L may not both be counted. May not be counted toward the Bachelor of Arts in Geological Sciences, the Bachelor of Science in Environmental Sciences, or the Bachelor of Science in Geological Sciences. Offered on the pass/fail basis only. Prerequisite: Geological Sciences 401, or 303, or consent of instructor.","upper":true},{"key":"GEO 422K","name":"Paleobiology","description":"Systematics, biostratigraphy, paleoecology, and evolution of fossil organisms. Three lecture hours and four laboratory hours a week for one semester, with two additional one-day field trips. Normally offered in the fall semester only. Prerequisite: Biology 301M or 311D with a grade of at least C-, Geological Sciences 404C or 405 with a grade of at least C-, and Geological Sciences 416M with a grade of at least C-.","upper":true},{"key":"GEO 322S","name":"Development and Evolution of the Vertebrate Skeleton","description":"Designed for majors in geological sciences and associated fields of natural history. Introduction to the organization and development of the vertebrate skeleton; survey of vertebrate history. Three lecture hours and two laboratory hours a week for one semester. Normally offered in the spring semester only, in alternate years. Prerequisite: Upper-division standing.","upper":true},{"key":"GEO 022T","name":"JSG Geosciences Mentors Program - Transfer","description":"Restricted to first semester transfer students in the Jackson School of Geosciences. Introduction to the various geosciences disciplines and corresponding degree programs and research areas. Emphasis on the skills needed for success in graduate school and the professional workplace, such as interactive sessions with the Jackson School of Geosciences Career Center to address internships, career planning, and job search skills. One lecture hour a week for one semester. May not be counted toward a degree in geological sciences or environmental sciences. Offered on the pass/fail basis only. Prerequisite: Consent of instructor.","upper":true},{"key":"GEO 322V","name":"Morphology of the Vertebrate Skeleton","description":"Identification of skeletal elements from the major vertebrate taxa, and aspects of skeletal functional morphology, with emphasis on extant taxa. Topics include the skeletal systems of fish, amphibians, reptiles, birds, and mammals. Three lecture hours and four laboratory hours a week for one semester. Normally offered in the fall semester only, in alternate years. Geological Sciences 322V and 389R may not both be counted. Prerequisite: One of the following: Geological Sciences 404C, 405, or the equivalent, or three semester hours of coursework in biology, or consent of instructor.","upper":true},{"key":"GEO 325J","name":"Programming in FORTRAN and MATLAB","description":"Restricted to geosciences majors. FORTRAN for students without knowledge of a computer programming language: survey of all variable types, loops, arrays, subroutines, and functions; overview of UNIX and MATLAB. Two lecture hours and two laboratory hours a week for one semester. Normally offered in the spring semester only. Prerequisite: Mathematics 408D or the equivalent.","upper":true},{"key":"GEO 325K","name":"Computational Methods","description":"Sampling and aliasing. Review of sinusoids and wave terminology, complex numbers and complex sinusoids, vectors and matrices, the discrete Fourier transform, convolution, the convolution theorem, linear digital filters and transfer functions, random variable concepts and statistics, and least squares estimation. MATLAB is used for homework problems and examples. Two lecture hours and two laboratory hours a week for one semester. Normally offered in the fall semester only. Prerequisite: Geological Sciences 325J, or an equivalent college-level course in an appropriate programming language and consent of instructor.","upper":true},{"key":"GEO 426P","name":"Igneous and Metamorphic Petrology","description":"Mineralogy, geochemistry, and processes of magmatism and metamorphism. Three lecture hours and four laboratory hours a week for one semester. Normally offered in the spring semester only. Prerequisite: Geological Sciences 416K with a grade of at least C-, and credit with a grade of at least C- or registration for either Physics 301 and 101L or 303K and 103M.","upper":true},{"key":"GEO 327G","name":"Geographic Information System and Global Positioning System Applications in Earth Sciences","description":"For geological sciences majors only. Theory and practice of geographic information system (GIS) and Global Positioning System (GPS) technologies, and their applications to problems in earth sciences. Laboratories and field trips provide hands-on experience with the collection, mapping, and analysis of geologic and other field data using GPS equipment and GIS software. Topics include map projections; datums and reference frames; cartographic principles; remotely sensed data (satellite and aerial photos, image radar); vector- and raster-based image formats; geospatial data resources; GIS software applications; surveying principles; GPS constellation and data structure; differential GPS; data logging schemes; GPS postprocessing software; integration of GPS and GIS in mapmaking; extant GIS applications in geology and hydrogeology. Three lecture hours and two laboratory hours a week for one semester, and two weekend field trips. Geological Sciences 327G and 371C (Topic: Geographic Information System and Global Positioning System Applications in Earth Sciences) may not both be counted. Prerequisite: Geological Sciences 420K with a grade of at least C-, and consent of instructor.","upper":true},{"key":"GEO 428","name":"Structural Geology","description":"Description, classification, and origin of Earth structures. Solution of problems by descriptive geometry, geologic maps, and contouring. Three lecture hours and three laboratory hours a week for one semester. Normally offered in the fall semester only. Prerequisite: For students pursuing the Bachelor of Science in Geological Sciences, Geological Sciences 420K with a grade of at least C-, Physics 301 and 101L or 303K and 103M with a grade of at least C- in each, and credit with a grade of at least C- or registration for Mathematics 408C or 408K (or 308K); for those pursuing the Bachelor of Arts with a major in geological sciences, Geological Sciences 420K with a grade of at least C-, three semester hours of coursework in mathematics (other than Mathematics 301, 316K, and 316L) with a grade of at least C-, and Physics 302K or 303K with a grade of at least C-; for others, consent of instructor.","upper":true},{"key":"GEO 329W","name":"Hydrogeology Cooperative (Geological Sciences)","description":"This course covers the work period of geological sciences students in the Cooperative Education program, which provides supervised work experience by arrangement with the employer and the supervising instructor. The student must submit a final report to the supervising instructor at the conclusion of the program. Forty laboratory hours a week for one semester. The student must repeat the course each work period and must take it twice to receive credit toward the degree; at least one of these registrations must be during a long-session semester. No more than three semester hours may be counted toward the major requirement; no more than six semester hours may be counted toward the degree. The student's first registration must be on the pass/fail basis. Prerequisite: Application to become a member of the Hydrogeology Cooperative (Geological Sciences) Program and consent of the geological sciences undergraduate adviser.","upper":true},{"key":"GEO 330K","name":"Energy Exploration","description":"Covers the fundamental elements of the petroleum system, including the origin of source rocks and reservoirs, rock properties, migration of hydrocarbons, and correlation methods for rock formations. During the final weeks of the course, students form exploration teams and work up real subsurface data from the Gulf of Mexico in order to participate in a simulated lease sale. Two lecture hours and two laboratory hours a week for one semester. Normally offered in the spring semester. Prerequisite: Geological Sciences 416M with a grade of at least C-, and Physics 303L or 316.","upper":true},{"key":"GEO 331K","name":"Petrology and Plate Tectonics","description":"Sedimentation, metamorphism, igneous activity, and deformation patterns at rift zones, subduction zones, and transform margins. Three lecture hours a week for one semester. Offered irregularly, as shown in the Course Schedule. Prerequisite: Geological Sciences 428 with a grade of at least C-.","upper":true},{"key":"GEO 335","name":"Geology and Mineral Resources of Texas","description":"Geologic history of the region; local rocks, fossils, and mineral resources; influence of physiography, surface and subsurface water supplies, and energy and mineral resource production on the state economy. Three lecture hours and two laboratory hours a week for one semester; local field trips may also be required. Normally offered in the fall semester only. May not be counted toward the following options within the Bachelor of Science in Geological Sciences: general geology, geophysics, and hydrogeology. May not be counted toward a degree in environmental science. Prerequisite: Upper-division standing, Geological Sciences 401 or 303, and Geological Sciences 404C or 405.","upper":true},{"key":"GEO 338T","name":"Marine Tectonics","description":"Tectonic processes within the dynamic Earth, with a focus on oceanic structures. Subjects may include fundamentals of plate tectonics; plate motion, driving forces, and mantle convection; evolution of triple junction and plate margins; plate reconstructions; earthquakes and focal mechanisms; structure and geochemistry of the Earth's interior; mantle structure and tomography; rheology and deformation mechanisms in mantle and crust; heat flow, gravity, the geoid, and paleomagnetism; hotspots and mantle plumes; seafloor spreading and oceanic spreading ridges; oceanic transform faults and fracture zones; and subduction zones, volcanic island arcs, and marginal seas. Three lecture hours a week for one semester.  Normally offered in the spring semester only. Only one of the following may be counted: Geological Sciences 338T, 371C (Topic: Tectonics I), 381T, 391 (Topic: Tectonics I). May not be substituted for any required geological sciences course. Prerequisite: Upper-division standing, and Geological Sciences 428 with a grade of at least C- or consent of instructor.","upper":true},{"key":"GEO 339T","name":"Continental Tectonics","description":"Tectonic processes, with a focus on continental lithospheric structures.  Subjects may include convergent margins, subduction zones, magmatic arcs, and foreland structures; collisional orogenesis, arc-continent collisions, continent-continent collision, and mountain building; formation of supercontinents; uplift and exhumation; orogenic collapse and extensional tectonics; continental rifting and passive margins; transform margins; and the effect of tectonics on climate and oceanic circulation. Three lecture hours a week for one semester. Normally offered in the fall semester only. Only one of the following may be counted: Geological Sciences 339T, 371C (Topic: Tectonics II), 382T, 391 (Topic: Tectonics II). May not be substituted for any required geological sciences course. Prerequisite: For geological sciences majors, upper-division standing and Geological Sciences 428 with a grade of at least C-; for others, consent of instructor.","upper":true},{"key":"GEO 340T","name":"Geoclimatology","description":"Examination of the climate records encoded in sedimentary archives through geologic time. Three lecture hours a week for one semester. May not be substituted for any required geological sciences course. Geological Sciences 340T and 371C (Topic: Geoclimatology) may not both be counted. Prerequisite: For geological sciences majors, upper-division standing, and Chemistry 302 and Geological Sciences 416K and 416M with a grade of at least C- in each; for others, upper-division standing, Chemistry 302 and Geological Sciences 416K and 416M with a grade of at least C- in each, and consent of instructor.","upper":true},{"key":"GEO 341G","name":"Geomicrobiology","description":"Geologic and hydrologic controls on subsurface microbial growth, metabolism, and community structure; the geochemical consequences of microbial processes in subsurface settings; and the influence of geology on microbial ecology. Three lecture hours a week for one semester. Normally offered in the fall semester only, in alternate years. May not be substituted for any required geological sciences course. Geological Sciences 341G and 381G may not both be counted. Prerequisite: For geological sciences majors, upper-division standing; for others, upper-division standing and consent of instructor.","upper":true},{"key":"GEO 344K","name":"Marine Mining and Minerals","description":"Same as Marine Sciences 344K. Overview of seafloor mineral deposits, their exploration, and mining. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Geological Sciences or the Bachelor of Science in Environmental Sciences degrees. Prerequisite: Geological Sciences 401 or 303, 416K, and 416M.","upper":true},{"key":"GEO 344U","name":"Quantitative Seismic Interpretation","description":"Seismic inversion, a tool for reservoir characterization, post- and pre-stack modeling, rock physics and fluid replacement modeling, wavelet estimation and post-stack inversion, AVO and pre-stack inversion, multiattribute regression and neural network, and net pay estimation. Extensive hands-on training with three-dimensional seismic and well-log data. Three lecture hours a week for one semester.  Normally offered in the spring semester only, in alternate years. Prerequisite: Upper-division standing.","upper":true},{"key":"GEO 145E","name":"Professional Ethics in Geosciences","description":"Supervised study devoted to the subject of professional ethics and personal integrity in the sciences, with specific subject matter designed to evolve with the science and our society. One lecture hour a week for one semester. Normally offered in the fall semester only. Geological Sciences 145E and 171C (Topic: Professional Ethics in Geosciences) may not both be counted. May not be substituted for any required geological sciences or environmental sciences course. Offered on the letter-grade basis only. Prerequisite: For non-Jackson School of Geosciences majors, consent of instructor.","upper":true},{"key":"GEO 346C","name":"Introduction to Physical and Chemical Hydrogeology","description":"Basic concepts of fluid flow, surface and subsurface hydrology, aqueous geochemistry, and fluid-rock interaction. Additional topics include isotope hydrogeology, evolution of seawater, and mineral-solution equilibrium. Three lecture hours a week for one semester. Normally offered in the spring semester only. Prerequisite: Chemistry 302 with a grade of at least C-.","upper":true},{"key":"GEO 347D","name":"Global Warming","description":"Discussion of the fundamental sciences of global warming, including an active investigation of contemporary climate change issues. Three lecture hours a week for one semester. Normally offered in the fall semester only. Geological Sciences 347D and 371C (Topic: Global Warming) may not both be counted. Offered on the letter-grade basis only.","upper":true},{"key":"GEO 347G","name":"Climate System Modeling","description":"Studies the basic theory of climate system modeling using state-of-the-art regional climate models in a variety of applications. Subjects may include paleoclimate study and future climate prediction based on greenhouse gas increases. Three lecture hours a week for one semester. Normally offered in the spring semester only. Only one of the following maybe counted: Geological Sciences 347G, 371C (Topic: Climate System Modeling), 387G, 391 (Topic: Climate System Modeling). May not be substituted for any required geological sciences course. Prerequisite: Upper-division standing, basic knowledge of Unix, and programming experience in Fortran.","upper":true},{"key":"GEO 347K","name":"Gems and Gem Minerals","description":"Crystallography, occurrence, and identification of gem minerals and materials; artificial gems; simple cutting and polishing; history of gems and gemology. Three lecture hours and two laboratory hours a week for one semester. May not be counted toward a degree in geological sciences or environmental science. Prerequisite: For earth science teachers, consent of instructor; for others, Geological Sciences 401 or 303, and Chemistry 301 or one year of high school chemistry.","upper":true},{"key":"GEO 347P","name":"Climate System Physics","description":"Discussion of first-order principles and processes that govern the thermodynamical structure and energy distribution of the atmosphere, ocean, land, and cryosphere and their interaction with the dynamic aspect of the climate system. Three lecture hours a week for one semester. Normally offered in the spring semester only. Only one of the following may be counted: Geological Sciences 347P, 371C (Topic: Climate System Physics), 387P, 391 (Topic: Climate System Physics). May not be substituted for any required geological sciences course. Prerequisite: Upper-division standing and Mathematics 408D and Physics 303K with a grade of at least C- in each.","upper":true},{"key":"GEO 348K","name":"Marine Geology and Geophysics Field Course","description":"Same as Marine Sciences 348 (Topic 2: Marine Geology and Geophysics Field Course). Hands-on, team-based instruction in the collection and processing of marine geological and geophysical data along the Gulf of Mexico coast. Includes classroom, laboratory, and field components in Austin and at sea. Offered between the spring semester and the summer session; limited class meetings may begin in the spring semester. Geological Sciences 348K and 397F may not both be counted. Fulfills the field experience requirement for some geological sciences degree programs. Students should contact the department for information before registering. Prerequisite: For geological sciences majors, upper-division standing, Geological Sciences 420K or 320L with a grade of at least C-, and consent of instructor; Geological Sciences 416M and 465K are recommended; for others, upper-division standing, Marine Sciences 307 and 354F with a grade of at least C- in each, and consent of instructor.","upper":true},{"key":"GEO 354","name":"Physics of Earth","description":"How history, composition, temperature, kinematics, and dynamics of Earth are inferred from geophysical observations of all types. Three lecture hours a week for one semester. Normally offered in the spring semester only. Geological Sciences 354 and 384D may not both be counted. Prerequisite: For students in the geophysics option, Geological Sciences 465K and 365P; for others, a major in geological sciences and completion of the calculus and physics courses required for the major.","upper":true},{"key":"GEO 358K","name":"Volcanology","description":"Ash deposits, lava flows, eruption processes; prediction and mitigation of volcanic hazards. Three lecture hours and one laboratory hour a week for one semester. Offered irregularly. Prerequisite: Geological Sciences 426P or upper-division standing in geological sciences.","upper":true},{"key":"GEO 660","name":"Field Geology","description":"Methods of geologic mapping with topographic maps and aerial photographs. Field studies include measuring sections, interpretation of stratigraphy, structure, environments of deposition of various sedimentary rocks, and the origin and petrology of igneous and metamorphic rocks. Given for six weeks each summer in Colorado, New Mexico, and other western states. Normally offered in the summer session only. Prerequisite: Eighteen semester hours of coursework in geological sciences, including Geological Sciences 420K and 428 with a grade of at least C- in each.","upper":true},{"key":"GEO 661","name":"Geophysics Field Camp","description":"Field studies for geophysics majors, including seismic, magnetic, electrical, gravity, and other techniques; related data processing and interpretation. Each half requires three consecutive weeks of fieldwork.  Geological Sciences 661A is offered either between the spring semester and the summer session or in the summer session; Geological Sciences 661B is offered in the summer session. Students may take Geological Sciences 661 for University credit while enrolled in the Los Alamos National Laboratory SAGE program. Prerequisite: Completion of eighteen semester hours of coursework in geological sciences, including Geological Sciences 420K, 465K, and 365P with a grade of at least C- in each.","upper":true},{"key":"GEO 465K","name":"Seismic Exploration","description":"Seismic theory, including body and surface waves, attenuation, rays, reflection and transmission coefficients, principles of synthetic seismogram calculations, seismic imaging principles, reflection data processing methods, rock physics overview, seismic attributes overview, and seismic exploration field methods. Three lecture hours and two laboratory hours a week for one semester. Normally offered in the fall semester only. Prerequisite: Credit with a grade of at least C- or registration for Mathematics 427L and Physics 315 and 115L.","upper":true},{"key":"GEO 365N","name":"Geophysical Data Processing","description":"Fourier transforms of continuous functions, linear digital filter design and applications, frequency domain filtering, and spectral analysis and applications. Three lecture hours a week for one semester. Normally offered in the spring semester only. Prerequisite: Geological Sciences 325K or the equivalent.","upper":true},{"key":"GEO 365P","name":"Potential Field Applications in Geophysics","description":"Introduction to the theory, measurement, and application of gravity and magnetic and electric fields to exploration and global-scale problems. Three lecture hours a week for one semester. Normally offered in the spring semester only. Geological Sciences 365P and 383P may not both be counted. Prerequisite: Mathematics 427K, 427L, Physics 315, and 115L with a grade of at least C- in each.","upper":true},{"key":"GEO 365Q","name":"Geomorphology Process and Form","description":"Explores how Earth surface processes combine to shape landscapes through erosion and deposition. Includes discussion of open channel flow, sediment transport, fluvial and hillslope processes, and tectonic controls on landscape evolution. Three lecture hours a week for one semester, with several field trips to be arranged. Normally offered in the fall semester. Only one of the following may be counted: Geological Sciences 365Q, 371C (Topic: Geomorphology: Landscape Process, Form, and Evolution), 385Q, 391 (Topic: Geomorphology: Landscape Process, Form, and Evolution). May not be substituted for any required geological sciences course. Prerequisite: Upper-division standing; and Mathematics 408C or the equivalent, or consent of instructor.","upper":true},{"key":"GEO 366M","name":"Mathematical Methods in Geophysics","description":"A survey of mathematics for geoscientists that includes infinite series, complex variables, linear algebra, integral transforms, ordinary and partial differential equations, tensor analysis, and probability and statistics. Three lecture hours a week for one semester. Normally offered in the fall semester. Geological Sciences 366M and 380J may not both be counted. Prerequisite: Mathematics 427L or the equivalent.","upper":true},{"key":"GEO 468K","name":"Geophysics for Geological Sciences Majors","description":"A survey of seismic, magnetic, gravitational, and other geophysical tools and their application to exploration and global-scale problems. Three lecture hours and two laboratory hours a week for one semester. Normally offered in the spring semester only. May not be counted toward the Bachelor of Science in Geological Sciences, Option II. Prerequisite: Mathematics 408D and either Physics 303L and 103N or 316 and 116L, with a grade of at least C- in each.","upper":true},{"key":"GEO 370K","name":"Sedimentology","description":"Processes of sediment formation, transportation, and deposition; textures, structures, and facies of sedimentary rocks. Three lecture hours a week for one semester, and two one-day field trips. Offered irregularly. Prerequisite: Geological Sciences 420K with a grade of at least C-.","upper":true},{"key":"GEO 171H","name":"Research Methods I","description":"Preparation for independent research projects through exposure to current research programs, facilities, personnel, and projects in the Jackson School of Geosciences. Includes selecting research topics, mentors, and supervisors; preparing research proposals; conducting research activities; and presenting research results. The equivalent of one lecture hour a week for one semester. Prerequisite: Completion of sixty semester hours of college coursework, including at least eight hours of upper-division coursework in geological sciences; consent of the honors adviser; and admission to the Geological Sciences Honors Program or consent of instructor.","upper":true},{"key":"GEO 172H","name":"Research Methods II","description":"Preparation for independent research projects through exposure to current research programs, facilities, personnel, and projects in the Jackson School of Geosciences. Includes selecting research topics, mentors, and supervisors; preparing research proposals; conducting research activities; and presenting research results. The equivalent of one lecture hour a week for one semester. Prerequisite: Geological Sciences 171H, and admission to the Geological Sciences Honors Program or consent of instructor.","upper":true},{"key":"GEO 173H","name":"Research Methods III","description":"Preparation for independent research projects through exposure to current research programs, facilities, personnel, and projects in the Jackson School of Geosciences. Includes selecting research topics, mentors, and supervisors; preparing research proposals; conducting research activities; and presenting research results. The equivalent of one lecture hour a week for one semester. Prerequisite: Geological Sciences 171H and 172H, and admission to the Geological Sciences Honors Program or consent of instructor.","upper":true},{"key":"GEO 376C","name":"Isotope Geology","description":"Overview of the principles of stable and radiogenic isotope geochemistry. Subjects include mass spectrometry, geochronology and thermochronology, cosmogenic nuclides, radiogenic geochemistry, isotopic fractionation, traditional and non-traditional stable isotope geochemistry and its applications to the hydrologic cycle, low-temperature geochemistry, magmatic and metamorphic processes, thermometry, fluid-rock interactions, tectonics, crust-mantle evolution, and extraterrestrial materials. Three lecture hours a week for one semester. Only one of the following may be counted: Geological Sciences 371C (Topic: Isotope and Environmental Geology Research), 376C, 388L. Prerequisite: Chemistry 302, Mathematics 408D or 408M with a grade of at least C- in each, and written consent of instructor.","upper":true},{"key":"GEO 376E","name":"Environmental Isotope Geochemistry","description":"The application of the isotope and trace element geochemistry of natural waters and sediments to studies of the hydrologic cycle. Stable, radiogenic, and cosmogenic isotopes are used as tracers of the evolution of groundwater, surface water, and ocean water. Three lecture hours a week for one semester, with additional laboratory hours to be arranged. Offered irregularly. Prerequisite: Upper-division standing in geological sciences; and consent of instructor or the following courses: Chemistry 302, 204, Geological Sciences 416K, 416M, 346C, Mathematics 408D, and Physics 303L and 103N or 316 and 116L.","upper":true},{"key":"GEO 476K","name":"Groundwater Hydrology","description":"Introduction to subsurface hydrology, emphasizing geological controls on groundwater flow; quantitative methods of analyzing aquifer systems; regional hydrology; water quality and pollution. Three lecture hours and one laboratory hour a week for one semester, with several local field trips. Normally offered in the fall semester only. Prerequisite: Geological Sciences 346C or Mathematics 408D with a grade of at least C-, or consent of instructor.","upper":true},{"key":"GEO 376L","name":"Field Methods in Groundwater Hydrology","description":"Introduction to field methods, including geophysics, pump tests, stream gauging, well-logging, water sampling, and mapping. An intensive three-week course meeting eight hours a day, Monday through Friday, and four hours on Saturday: lectures, laboratory exercises, and field exercises; nightly homework involving map exercises, reduction of field data, report preparation; Saturdays devoted to report presentation, review sessions, and local field trips. Offered between the spring semester and the summer session. Prerequisite: Geological Sciences 476K with a grade of at least C-, or consent of instructor.","upper":true},{"key":"GEO 476M","name":"Chemical Hydrogeology","description":"An introduction to aqueous geochemistry and contaminant hydrogeochemistry; topics include basic thermodynamics, kinetics, rock-water interactions, and solute transport. Three lecture hours and two laboratory hours a week for one semester. Normally offered in the spring semester only. Prerequisite: Geological Sciences 346C, 476K, or 376S with a grade of at least C-.","upper":true},{"key":"GEO 376S","name":"Physical Hydrology","description":"Modern conceptual and methodological approaches to hydrological science: qualitative assessment of hydrological processes, quantitative representation, approaches to measurement, and treatment of uncertainty. Major components of the hydrological cycle--precipitation, snow and snowmelt, infiltration, soil moisture, evapotranspiration, and runoff--and their link to the coupled-earth system. Three lecture hours a week for one semester. Normally offered in the fall semester only. Prerequisite: Geological Sciences 346C or Mathematics 408D with a grade of at least C-.","upper":true},{"key":"GEO 376T","name":"High-Temperature Geochemistry","description":"Restricted to geosciences majors. Study of the composition, origin, and chemical and physical evolution of the earth and its interior. Examines the links between the fields of geochemistry and tectonics, igneous petrology, geophysics, and other areas of inquiry. Three lecture hours a week for one semester. Normally offered in the fall semester only. Prerequisite: Mathematics 408D or the equivalent.","upper":true},{"key":"GEO 476W","name":"Hydrogeophysics","description":"Application of geophysical methods in hydrogeology. Modules include method theory and hydrogeological applications; using instruments in the field; and analysis of data, interpretation, and hydrogeological insights. Class discussions; field exercises and written field exercise summaries; individual and group reports. The equivalent of four lecture hours a week for one semester, with field work hours to be arranged. Normally offered in the fall semester only. Only one of the following may be counted: Geological Sciences 371C (Topic: Hydrogeophysics), 476W, 382W, 391 (Topic: Hydrogeophysics). Prerequisite: Consent of instructor; previous coursework and/or experience in hydrogeology and geophysics is recommended.","upper":true},{"key":"GEO 377K","name":"Applied Karst Hydrogeology","description":"The study of karst landforms, processes, flow systems, and water resources. Geologic controls, natural resources, aquifer recharge and discharge, system evolution, geochemistry/water quality, tracing methodologies, geophysical methods, and modeling are covered with an emphasis on collecting and interpreting field data. Three lecture hours a week for one semester, with additional fieldwork hours to be arranged. Normally offered in the spring semester only. Class counts for field work credit for those in the Bachelor of Science in Geological Sciences (Option III: Hydrogeology) degree program. Only one of the following may be counted: Geological Sciences 371C (Topic: Applied Karst Hydrogeology), 377K, 391 (Topic: Applied Karst Hydrogeology), 391K. Prerequisite: Geological Sciences 476K or consent of instructor.","upper":true},{"key":"GEO 377P","name":"Physical Climatology","description":"Investigates the nature of earth's climate and examines the physical processes that maintain the climate system. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Upper-division standing; and Mathematics 408D, Physics 303K, Geography 301K, and Computer Science 303E, or their equivalents.","upper":true},{"key":"GEO 679G","name":"Special Studies in Geophysics","description":"Special research projects, field studies, or geophysical/industrial internship. Assigned reading with written and oral report. Three lecture hours a week for two semesters. May be used instead of Geological Sciences 660 in fulfilling the requirements for the Bachelor of Science in Geological Sciences (Option II). Prerequisite: A University grade point average of at least 3.00, or a grade point average in geosciences courses of at least 3.00 and consent of instructor.","upper":true},{"key":"GEO 379H","name":"Honors Tutorial","description":"Supervised research project resulting in an honors thesis with an oral defense. Conference course. May be counted as three of the six geological sciences senior elective hours. Prerequisite: Upper-division standing, admission to the Geological Sciences Honors Program, and completion of Geological Sciences 171H, 172H, and 173H with a grade of at least B- in each; or consent of the departmental honors adviser.","upper":true},{"key":"GEO 679J","name":"Internship in Hydrogeology","description":"Special hydrogeological studies under the joint supervision of industry professionals and faculty members. Students present a written report. Forty hours a week for one semester. May be used in place of Geological Sciences 660 in fulfilling the requirements for the Bachelor of Science in Geological Sciences (Option III). Prerequisite: Geological Sciences 476K with a grade of at least C-, a grade point average in geological sciences of at least 3.00, and consent of instructor.","upper":true},{"key":"GEO 479M","name":"Mammalogy","description":"Surveys the biology and evolutionary history of mammals. Introduction to the diversity of living mammals through the study of mammalian ecology, behavior, morphology, and taxonomy. Laboratory work focuses on the characters diagnosing the major mammalian clades and identifying the common recent mammals of Texas using skins and recent osteological specimens. Fossils and the fossil record of mammals. Three lecture hours and three laboratory hours a week for one semester. Normally offered in the spring semester only. Prerequisite: Upper-division standing in biology, geological sciences, or anthropology.","upper":true}]