[{"key":"GK 601C","name":"Beginning Greek","description":"Studies the fundamentals of grammar and reading in ancient Greek. Six lecture hours a week for one semester. Only one of the following may be counted: Greek 601C; 804; 506 and 507; 606Q.","upper":false},{"key":"GK 502","name":"First-Year Modern Greek I","description":"Introduction to grammar and reading. Five lecture hours a week for one semester. Greek 502 and 602C may not both be counted.","upper":false},{"key":"GK 602C","name":"Beginning Modern Greek","description":"Six lecture hours a week for one semester. Greek 502 and 602C may not both be counted. Greek 602C and 503 may not both be counted.","upper":false},{"key":"GK 503","name":"First-Year Modern Greek II","description":"Continuation of Greek 502. Five lecture hours a week for one semester. Greek 602C and 503 may not both be counted. Prerequisite: Greek 502 with a grade of at least C.","upper":false},{"key":"GK 804","name":"Intensive Beginning Greek","description":"An accelerated course for highly motivated students that combines the material covered in Greek 506 with that covered in the first part of Greek 507. Offered in the summer session as part of the Intensive Greek Program. The Intensive Greek Program meets for five hours each weekday during the summer session. Only one of the following may be counted: Greek 601C; 804; 506 and 507; 606Q. The student must complete both Greek 804 and 412 in order to earn credit for either; the same grade will be awarded for both courses. Prerequisite: Concurrent enrollment in Greek 412. Students who enroll in 804 must take Greek 412 in the same summer session.","upper":false},{"key":"GK 506 (TCCN: GREE 1511)","name":"First-Year Greek I","description":"Studies the fundamentals of grammar and reading in ancient Greek. Five lecture hours a week for one semester. Only one of the following may be counted: Greek 601C; 804; 506 and 507; 606Q.","upper":false},{"key":"GK 507 (TCCN: GREE 1512)","name":"First-Year Greek II","description":"Continuation of Greek 506. Five lecture hours a week for one semester. Only one of the following may be counted: Greek 601C; 804; 506 and 507; 606Q. Greek 507 and 412 may not both be counted. Prerequisite: Greek 506 with a grade of at least C.","upper":false},{"key":"GK 309K","name":"Conference Course","description":"Supervised individual instruction in second-year ancient or modern Greek reading. Conference course.  May be repeated for credit. Prerequisite: Consent of instructor.","upper":false},{"key":"GK 310","name":"Second-Year Modern Greek I","description":"Culture, language, and literature of present-day Greece. Three lecture hours a week for one semester. Greek 310 and 610C may not both be counted. Prerequisite: Greek 602C or 503 with a grade of at least C.","upper":false},{"key":"GK 610C","name":"Intermediate Modern Greek","description":"Continuation of Greek 602C. Six lecture hours a week for one semester. Greek 310 and 610C may not both be counted. Greek 610C and 310K may not both be counted. Prerequisite: Greek 602C or 503 with a grade of at least C.","upper":false},{"key":"GK 310K","name":"Second-Year Modern Greek II","description":"Continuation of Greek 310. Three lecture hours a week for one semester. Greek 610C and 310K may not both be counted. Prerequisite: Greek 310 with a grade of at least C.","upper":false},{"key":"GK 311 (TCCN: GREE 2311)","name":"Intermediate Greek I","description":"Continuation of Greek 601C or 507. Introductory readings from classical authors such as Lysias, Plato, and Xenophon. Includes grammar review. Three lecture hours a week for one semester. Prerequisite: Greek 601C or 507 with a grade of at least C, or Greek 804 and 412 with a grade of at least C in each.","upper":false},{"key":"GK 412","name":"Intensive Greek","description":"An accelerated course for highly motivated students. Completion of this course is equivalent to completion of Greek 506 and 507. Students who enroll in 412 must take Greek 804 in the same summer session. A grade of A may allow the student to advance to Greek 324 with consent of the Greek 324 instructor. The Intensive Greek Program meets for five hours each weekday during the summer session. Greek 507 and 412 may not both be counted. Prerequisite: Concurrent enrollment in Greek 804.","upper":false},{"key":"GK 312K","name":"Intermediate Greek II","description":"Continuation of Greek 311. Selected readings from classical and biblical authors. Three lecture hours a week for one semester. Greek 312K and 312L may not both be counted. Prerequisite: Greek 311 with a grade of at least C.","upper":false},{"key":"GK 312L","name":"Intermediate Greek II: Biblical Greek","description":"Continuation of Greek 311. A parallel to Greek 312K with a focus on biblical Greek. Three class hours a week for one semester. Greek 312K and 312L may not both be counted. Prerequisite: Greek 311 with a grade of at least C.","upper":false},{"key":"GK 324","name":"Advanced Greek","description":"Reading and analysis of classical authors such as Homer, Herodotus, Euripides, and Plato. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Greek 312K or 312L (or 322) with a grade of at least C; or Greek 412 with a grade of at least A-, and consent of the undergraduate adviser.","upper":true},{"key":"GK 326","name":"Advanced Greek Grammar and Composition","description":"Study of syntax, style, and principles of written composition. Three lecture hours a week for one semester. Prerequisite: Credit or registration for Greek 324.","upper":true},{"key":"GK 328","name":"Advanced Biblical Greek","description":"Reading and analysis of selections from the New Testament, the Septuagint, and related writings. Three lecture hours a week for one semester. Greek 328 and 362 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Greek 312K or 312L (or 322) with a grade of at least C; or Greek 412 with a grade of at least A-, and consent of the undergraduate adviser.","upper":true},{"key":"GK 365","name":"Seminar in Greek","description":"Critical study of authors such as Thucydides, Demosthenes, and Aeschylus. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Greek 324 or 328.","upper":true},{"key":"GK 370","name":"Advanced Conference Course","description":"Supervised reading. Conference course.  May be repeated for credit. Prerequisite: Greek 310K or 324, and consent of instructor.","upper":true},{"key":"GK 679H","name":"Honors Tutorial Course","description":"Supervised conference course for honors candidates in Greek. Three conference hours a week for two semesters. Prerequisite: For 679HA, upper-division standing and admission to the honors program in Greek; for 679HB, Greek 679HA.","upper":true}]