[{"key":"LAT 601C","name":"Beginning Latin","description":"Fundamentals of grammar and reading. Six lecture hours a week for one semester. Only one of the following may be counted: Latin 601C; 506 and 507; 506Q; 508.","upper":false},{"key":"LAT 506 (TCCN: LATI 1511)","name":"First-Year Latin I","description":"Fundamentals of grammar and reading. Five lecture hours a week for one semester. Only one of the following may be counted: Latin 601C; 506 and 507; 506Q; 508.","upper":false},{"key":"LAT 507 (TCCN: LATI 1512)","name":"First-Year Latin II","description":"Continuation of Latin 506. Five lecture hours a week for one semester. Only one of the following may be counted: Latin 601C; 506 and 507; 506Q; 508. Prerequisite: Latin 506 with a grade of at least C.","upper":false},{"key":"LAT 309K","name":"Conference Course","description":"Supervised individual instruction in second-year Latin reading. Conference course.  May be repeated for credit. Prerequisite: Consent of instructor.","upper":false},{"key":"LAT 311 (TCCN: LATI 2311)","name":"Intermediate Latin I","description":"Continuation of Latin 601C and 507. Introduction to reading classical authors in their cultural context. Includes grammar review. Three lecture hours a week for one semester. Latin 311 and 511K may not both be counted. Prerequisite: Latin 601C or 507 (or 506Q or 508) with a grade of at least C.","upper":false},{"key":"LAT 511K","name":"Accelerated Intermediate Latin","description":"Designed primarily for students of high academic ability and motivation. Comparable to Latin 311 and 312K together. Five lecture hours a week for one semester. Only one of the following may be counted: Latin 511K, 312K, 312M, 316. Latin 311 and 511K may not both be counted. Prerequisite: Latin 601C or 507 (or 506Q or 508) with a grade of at least A-.","upper":false},{"key":"LAT 312K","name":"Intermediate Latin II","description":"Continuation of Latin 311. Selected readings from classical authors. Three lecture hours a week for one semester. Only one of the following may be counted: Latin 511K, 312K, 312M, 316. Prerequisite: Latin 311 with a grade of at least C.","upper":false},{"key":"LAT 316","name":"Intermediate Latin II: Poetry","description":"Continuation of Latin 311. Selected readings from classical and medieval poets. Three lecture hours a week for one semester. Only one of the following may be counted: Latin 511K, 312K, 312M, 316. Prerequisite: Latin 311 with a grade of at least C.","upper":false},{"key":"LAT 322","name":"Advanced Latin I","description":"Reading and analysis of selected classical authors. Three lecture hours a week for one semester. Prerequisite: Latin 511K, 312K, or 316 (or 312M) with a grade of at least C.","upper":true},{"key":"LAT 323","name":"Advanced Latin II","description":"Reading and interpretation of prose and poetry texts at an early advanced level. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Latin 322 with a grade of at least C.","upper":true},{"key":"LAT 324","name":"Advanced Latin Grammar and Composition","description":"Study of syntax, style, and principles of written composition. Three lecture hours a week for one semester. Required of all Latin majors and students seeking a secondary school teaching certificate with Latin as a teaching field. Prerequisite: Latin 322 with a grade of at least C.","upper":true},{"key":"LAT 365","name":"Seminar in Latin","description":"Critical study of authors such as Horace, Livy, Lucretius, and Tacitus. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Latin 323 with a grade of at least C.","upper":true},{"key":"LAT 370","name":"Advanced Conference Course","description":"Supervised reading. Conference course.  May be repeated for credit. Prerequisite: Consent of instructor.","upper":true},{"key":"LAT 679H","name":"Honors Tutorial Course","description":"Supervised conference course for honors candidates in Latin. Three conference hours a week for two semesters. Prerequisite: For 679HA, upper-division standing and admission to the Latin Honors Program; for 679HB, Latin 679HA.","upper":true}]