[{"key":"BME 102L","name":"Introduction to Biomedical Engineering Design Principles","description":"Restricted to biomedical engineering majors. Introduction to concepts of creative design, engineering analysis, reverse engineering, concept selection, and fabrication of biomedical engineering devices. One lecture hour and three laboratory hours a week for one semester.","upper":false},{"key":"BME 303","name":"Introduction to Computing","description":"Restricted to biomedical engineering majors. Introduction to computing and programming, focusing on arithmetic and logic operations, processor architecture, and programming structures. Programming skills for solving problems using machine and assembly language programming. Emphasis is on biomedical engineering applications of computing. Three lecture hours and two recitation hours a week for one semester.","upper":false},{"key":"BME 203L","name":"Introduction to Biomedical Engineering Design","description":"Restricted to biomedical engineering majors. Biomedical engineering design concepts with hands-on learning applications. Two lecture hours and three laboratory hours a week for one semester. Biomedical Engineering 102L and 203L may not both be counted. Offered on the letter-grade basis only.","upper":false},{"key":"BME 311","name":"Network Analysis in Biomedical Engineering","description":"Restricted to biomedical engineering majors. Basic concepts in circuit analysis and design of systems for biomedical engineering; Ohm's law, Kirchhoff's laws, and nodal and loop analysis; Theyenin's and Norton's theorem; operational amplifiers; high-order circuit and basic AC circuit analysis using Fourier and Laplace transforms. Three lecture hours and two laboratory/project hours a week for one semester. Prerequisite: Biomedical Engineering 303, Physics 303K, and credit or registration for Mathematics 427K.","upper":false},{"key":"BME 313","name":"Numerical Methods and Modeling in Biomedical Engineering","description":"Restricted to biomedical engineering majors. Principles and techniques of numerical analysis of biomedical engineering problems using high-level programming languages such as C++, Java, MATLAB, and LabVIEW. Numerical methods of integration, differentiation, interpolation, curve fitting, data analysis, sampling and estimation, error analysis, and analysis of ordinary differential equations. Numerical modeling of biomedical engineering systems, symbolic computation and scientific visualization, and integration of hardware and software. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Biomedical Engineering 303 and Mathematics 408C.","upper":false},{"key":"BME 113L","name":"Introduction to Numerical Methods in Biomedical Engineering","description":"Restricted to biomedical engineering majors. Introduces principles and techniques of numerical analysis of biomedical engineering problems. Covers numerical methods of integration, differentiation, interpolation, curve fitting, data analysis, sampling and estimation, error analysis, analysis of ordinary differential equations, numerical modeling of biomedical engineering systems, symbolic computation, and scientific visualization. One lecture hour and three laboratory hours a week for one semester. Prerequisite: Biomedical Engineering 303, Mathematics 427K, and credit or registration for Biomedical Engineering 311 and 335.","upper":false},{"key":"BME 314","name":"Engineering Foundations of Biomedical Engineering","description":"Application of engineering and mathematics to analysis and constructive manipulation of biological systems and the development of biomedical therapies. Includes physiological mass and momentum transfer; biomechanics; structure, properties, and behavior of biological materials; electrophysiology and linear circuits; and biomedical imaging. Three lecture hours and two recitation hours a week for one semester. Prerequisite: Biology 311C, Biomedical Engineering 102L, Chemistry 302, Physics 303K and 103M, and credit or registration for Electrical Engineering 312 or 319K, Mathematics 427K, Physics 303L, and 103N.","upper":false},{"key":"BME 214L","name":"Computational Fundamentals of Biomedical Engineering Design","description":"Restricted to biomedical engineering majors. Development of biomedical engineering design concepts, including hands-on learning applications in the lab. Two lecture hours and three laboratory hours a week for one semester. Biomedical Engineering 314 and 214L may not both be counted. Offered on the letter-grade basis only. Prerequisite: Biology 311C, Biomedical Engineering 203L, 303, Chemistry 302, Physics 303K, 103M, and credit or registration for Mathematics 427K, Physics 303L, and 103N.","upper":false},{"key":"BME 221","name":"Measurement and Instrumentation Laboratory","description":"Restricted to biomedical engineering majors. Introduction to the basics of assembling and using instrumentation for the purposes of recording and displaying electrophysiological signals. Mechanical, chemical, and biological principles for biomedical instrumentation. One lecture hour and three laboratory hours a week for one semester. Prerequisite: Biomedical Engineering 311, 113L, 314, 333T, and 335, and credit or registration for Biomedical Engineering 343 and 365R.","upper":true},{"key":"BME 325L","name":"Cooperative Engineering","description":"Restricted to biomedical engineering majors. This course covers the work period of biomedical engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for three semesters. The student must complete Biomedical Engineering 325LX, 325LY, and 325LZ before a grade and degree credit are awarded. Prerequisite: For 325LX, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 325LY, Biomedical Engineering 325LX and appointment for a full-time cooperative work tour; for 325LZ, Biomedical Engineering 325LY and appointment for a full-time cooperative work tour.","upper":true},{"key":"BME 225M","name":"Cooperative Engineering","description":"Restricted to biomedical engineering majors. This course covers the work period of biomedical engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for two semesters. The student must complete Biomedical Engineering 225MA and 225MB before a grade and degree credit are awarded. Prerequisite: For 225MA, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 225MB, Biomedical Engineering 225MA and appointment for a full-time cooperative work tour.","upper":true},{"key":"BME 125N","name":"Cooperative Engineering","description":"Restricted to biomedical engineering majors. Covers the work period of biomedical engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Biomedical Engineering 325LZ or 225MB, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour.","upper":true},{"key":"BME 333T","name":"Engineering Communication","description":"Restricted to biomedical engineering majors. Advanced communication skills for engineers, with emphasis on biomedical engineering topics. Strategies for written, visual, and interpersonal communication, and for oral presentation. Introduction to library research and to ethical decision making in biomedical engineering. Three lecture hours and one recitation hour a week for one semester. Prerequisite: Rhetoric and Writing 306, and credit or registration for Biomedical Engineering 314 or 214L.","upper":true},{"key":"BME 335","name":"Engineering Probability and Statistics","description":"Restricted to biomedical engineering majors. Fundamentals of probability, random processes, and statistics with emphasis on biomedical engineering applications. Includes hypothesis testing, regression, and sample size calculations. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Biomedical Engineering 303 and Mathematics 408D.","upper":true},{"key":"BME 339","name":"Biochemical Engineering","description":"Restricted to biomedical engineering majors. Principles of fermentation and cell culture technologies; introduction to recombinant DNA technology and protein expression; the development of therapeutics, vaccines, and diagnostics using genetic engineering. Three lecture hours a week for one semester. Only one of the following may be counted: Biology 335, Biomedical Engineering 339, Chemical Engineering 339, 379 (Topic: Introduction to Biochemical Engineering). Prerequisite: Biology 311C; Chemistry 353 or 353M; and Chemistry 339K or 369.","upper":true},{"key":"BME 342","name":"Biomechanics of Human Movement","description":"Introduction to computational modeling and simulation of musculoskeletal systems, with emphasis on lumped-parameter models of muscle, bone, tendon, and ligament. Three lecture hours a week for one semester. Prerequisite: Mathematics 340L, and Physics 303K and 103M.","upper":true},{"key":"BME 343","name":"Biomedical Engineering Signal and Systems Analysis","description":"Restricted to biomedical engineering majors. Signals and systems representation; sampling and quantization; time and frequency domains; Laplace and z-transforms, transfer functions, and frequency response; two-port networks; Bode plots; convolution; stability; Fourier series; Fourier transform; AM/FM modulation; filter design; and applications in biomedical engineering. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Biomedical Engineering 314 or 214L, and Mathematics 427K.","upper":true},{"key":"BME 344","name":"Biomechanics","description":"Restricted to biomedical engineering majors. Analysis and modeling of biomechanical systems at the macroscopic scale based on principles of statics, dynamics, and strength of materials. Three lecture hours a week for one semester. Biomedical Engineering 344 and 377T (Topic: Biomechanics) may not both be counted. Prerequisite: Biomedical Engineering 314, Mathematics 427K, and Physics 303K.","upper":true},{"key":"BME 345","name":"Graphics and Visualization Laboratory","description":"Restricted to biomedical engineering majors. Introduction to techniques for graphical display of biological data. Topics include transformations, geometric modeling, and two- and three-dimensional display algorithms. Includes computational projects with biomedical applications. Four and one half laboratory hours a week for one semester. Prerequisite: Electrical Engineering 422C (or 322C) and Mathematics 340L.","upper":true},{"key":"BME 245L","name":"Experimental Principles of Biomedical Engineering Design","description":"Restricted to biomedical engineering majors. Further exploration of biomedical engineering design principles through open-ended hands-on applications. Two lecture hours and three laboratory hours a week for one semester. Biomedical Engineering 221 and 245L may not both be counted. Offered on the letter-grade basis only. Prerequisite: Biomedical Engineering 311, 113L, 214L, 333T, 335, and credit or registration for Biomedical Engineering 343 and 365R.","upper":true},{"key":"BME 346","name":"Computational Biomolecular Engineering","description":"Introduction to computational structural biology and molecular modeling, including the fundamentals of biomolecular structure and molecular thermodynamics. The principles and applications of biomolecular modeling used to explore the critical relationship between structure, function, and thermodynamic driving forces in molecular biology. Two lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Biology 311C, Biomedical Engineering 113L, and Chemistry 353 or 353M.","upper":true},{"key":"BME 347","name":"Fundamentals of Biomedical Optics","description":"Restricted to biomedical engineering majors. Fundamentals of the interaction of light with tissue for the purpose of imaging and treatment of disease. Focuses on quantitative modeling of tissue optical properties, light propagation in the tissue, heat transfer of laser irradiated tissue, and thermal damage models. Includes discussion of applications in laser surgery, pulse oximetry, and disease diagnosis using spectroscopy. Three lecture hours a week for one semester. Biomedical Engineering 347 and 377T (Topic: Fundamentals of Biomedical Engineering Optical Imaging) may not both be counted. Prerequisite: Biomedical Engineering 251.","upper":true},{"key":"BME 348","name":"Modeling of Biomedical Engineering Systems","description":"Restricted to biomedical engineering majors. Lumped and distributed models of physiological system function from molecular through organismal levels. Linear system steady-state and transient behaviors. Interactions among multiple energy domains, including electrical, chemical, diffusional, mechanical, fluid, and thermal. Introduction to feedback control. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Biomedical Engineering 311, 113L, and 314, and Mathematics 427K.","upper":true},{"key":"BME 349","name":"Biomedical Instrumentation","description":"Restricted to biomedical engineering majors. Biomedical diagnostic and therapeutic instrumentation devices and application. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Biomedical Engineering 343.","upper":true},{"key":"BME 352","name":"Engineering Biomaterials","description":"Restricted to biomedical engineering majors. Overview of properties of metallic, ceramic, polymeric, and composite biomaterials used in biomedical applications. Material synthesis and processing. Analysis of mechanical and chemical properties, including stress-strain. Material interactions with the body and blood. Soft and hard biomaterials applications. Three lecture hours a week for one semester. Prerequisite: Biomedical Engineering 314 and 221.","upper":true},{"key":"BME 353","name":"Transport Phenomena in Living Systems","description":"Restricted to biomedical engineering majors. Modeling and analysis of momentum, energy, and mass transport in living systems. Three lecture hours a week for one semester. Prerequisite: Biomedical Engineering 113L, 314, Chemistry 353 or 353M, and Mathematics 427K.","upper":true},{"key":"BME 354","name":"Molecular Sensors and Nanodevices for Biomedical Engineering Applications","description":"Introduction to major types of molecular sensor systems, device miniaturization, and detection mechanisms, including molecular capture mechanisms; electrical, optical, and mechanical transducers; micro-array analysis of biomolecules; semiconductor and metal nanosensors; microfluidic systems; and microelectromechanical systems (MEMS, BioMEMS) fabrication and applications for biomedical engineering. Three lecture hours a week for one semester. Prerequisite: Biomedical Engineering 314 and 352.","upper":true},{"key":"BME 355","name":"Molecular Engineering","description":"Restricted to biomedical engineering majors. Biomedical applications of molecular engineering, including manufacturing of chemical, protein, and genetic materials. Three hours of lecture a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Chemistry 353 or 353M.","upper":true},{"key":"BME 357","name":"Biomedical Imaging Modalities","description":"Introduction to major biomedical imaging modalities, including X-ray radiography, computed tomography (CT), nuclear medicine (SPECT and PET), magnetic resonance imaging (MRI), and ultrasound. Emphasis on principles, approaches, and applications of each imaging modality. Basic physics and imaging equations of the imaging system; hardware and software; sources of noise and primary artifacts; safety and patient risk. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Biomedical Engineering 348 and 251.","upper":true},{"key":"BME 358","name":"Medical Decision Making","description":"Restricted to biomedical engineering majors. Understanding of the nature of expertise and related subjects of cognitive psychology and human-made interaction to be able to design more effective systems for supporting medical decision making. Three lecture hours a week for one semester. Biomedical Engineering 358 and 377T (Topic: Medical Decision-Making) may not both be counted. Offered on the letter-grade basis only. Prerequisite: Biomedical Engineering 335 and 365R.","upper":true},{"key":"BME 359","name":"Cellular and Molecular Biomechanics","description":"Restricted to biomedical engineering majors. Understanding concepts of biomechanics at the cellular and molecular level. Three lecture hours a week for one semester. Prerequisite: Biomedical Engineering 344 and 353.","upper":true},{"key":"BME 261L","name":"Development and Analysis in Biomedical Engineering Design","description":"Restricted to biomedical engineering majors. Further exploration of biomedical engineering design principles through open-ended hands-on applications. Two lecture hours and three laboratory hours a week for one semester. Biomedical Engineering 251 and 261L may not both be counted. Offered on the letter-grade basis only. Prerequisite: Biomedical Engineering 245L and 343.","upper":true},{"key":"BME 362","name":"Introduction to Nonlinear Dynamics in Biological Systems","description":"Restricted to biomedical engineering majors.  Three lecture hours a week for one semester. Biomedical Engineering 362, and 377T (Topic: Introduction to Nonlinear Dynamics in Biological Systems) may not both be counted. Offered on the letter-grade basis only. Prerequisite: Biomedical Engineering 344.","upper":true},{"key":"BME 365R","name":"Quantitative Engineering Physiology I","description":"Restricted to biomedical engineering majors. A quantitative, model-oriented approach to vertebrate systems physiology, including basic cellular physiology, electrophysiology of nerve and muscle, the motor system, the central nervous system, and the cardiovascular system. Three lecture hours and two recitation hours a week for one semester. Prerequisite: Biology 205L or 206L; Biomedical Engineering 311, and 214L or 314; Chemistry 339K or 369; Mathematics 427K; Physics 303L and 103N; and credit or registration for Biomedical Engineering 343.","upper":true},{"key":"BME 365S","name":"Quantitative Engineering Physiology II","description":"Restricted to biomedical engineering majors. Biological control systems: sensory, renal, respiratory, and immune systems. Focuses on a quantitative, model-oriented approach to physiological systems. Three lecture hours and two recitation hours a week for one semester. Prerequisite: Biomedical Engineering 365R.","upper":true},{"key":"BME 370","name":"Biomedical Engineering Capstone Design I","description":"Restricted to biomedical engineering majors. Structured methodologies for designing systems or to interface with living systems. Creative design, analysis, selection, development, and fabrication of biomedical components and systems. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Biomedical Engineering 348, 251, 353, and 365S.","upper":true},{"key":"BME 371","name":"Biomedical Engineering Capstone Design II","description":"Restricted to biomedical engineering majors. Development of team projects in biomedical engineering with emphasis on prototype development and quantitative analysis, and written and oral reporting of the outcome. Two lecture hours and four laboratory hours a week for one semester. Prerequisite: Biomedical Engineering 335 and 370.","upper":true},{"key":"BME 374K","name":"Biomedical Instrument Design","description":"Restricted to biomedical engineering, electrical engineering, or mechanical engineering majors. Application of electrical engineering principles in the design of electronic instrumentation at the circuit-board level for the measurement of pressure, temperature, flow, and impedance. Also includes the study of light intensity, bioelectric potentials, and stimulation devices such as pacemakers and defibrillators. Focus on design considerations specific to electro-medical environments, safety and efficacy, and public policy issues. Three lecture hours a week for one semester. Prerequisite: Biomedical Engineering 311 and Electrical Engineering 438, or Electrical Engineering 313 and 438.","upper":true},{"key":"BME 374L","name":"Applications of Biomedical Engineering Laboratory","description":"Restricted to biomedical engineering, electrical engineering, or mechanical engineering majors. An in-depth examination of selected topics in biomedical engineering, including optical and thermal properties of laser interaction with tissue; measurement of perfusion in the microvascular system; diagnostic imaging; interaction of living systems with electromagnetic fields; robotic surgical tools; ophthalmic instrumentation; and noninvasive cardiovascular measurements. Students have the opportunity to design analog and digital measurements and acquire and process meaningful biomedical signals. Three lecture hours and six laboratory hours a week for one semester. Prerequisite: Biomedical Engineering 374K or Electrical Engineering 374K.","upper":true},{"key":"BME 376","name":"Cell Engineering","description":"Introduction to principles that govern the structure, organization, and processes at cellular and subcellular levels. Special focus on engineering and quantitative aspects of cellular machinery. Employs engineering approaches to study receptors, macromolecular complexes, and cellular signaling; clinical and pharmaceutical approaches to perturb cellular structure and function for disease prevention and drug design. State-of-the-art experimental and computational techniques to study cellular engineering. Three lecture hours a week for one semester. Prerequisite: Biology 311C, Biomedical Engineering 314, and Mathematics 408C.","upper":true},{"key":"BME 377M","name":"Medical Internship","description":"Restricted to biomedical engineering majors. Designed for students considering medical school. Students participate in a variety of medical and clinical activities, including clinical inpatient rounds, outpatient visits, operating room procedures, and medical grand rounds. The equivalent of three lecture hours a week for one semester.","upper":true},{"key":"BME 377P","name":"Integrated Clinical Research Internship","description":"Restricted to biomedical engineering majors. Students perform integrated clinical research at the University of Texas M.D. Anderson Cancer Center and the University of Texas Health Science Center at Houston. Requires a substantial final report. The equivalent of three lecture hours a week for one semester.","upper":true},{"key":"BME 377Q","name":"Integrated Clinical Medical Internship","description":"Restricted to biomedical engineering majors. Students work with physicians at either the University of Texas M.D. Anderson Cancer Center or the University of Texas Health Science Center at Houston and participate in a variety of clinical routines. Requires a substantial final report. The equivalent of three lecture hours a week for one semester.","upper":true},{"key":"BME 377R","name":"Research Internship","description":"Restricted to biomedical engineering majors. Students perform biomedical research with a faculty member at an approved institution. Requires a substantial final report. The equivalent of three lecture hours a week for one semester.","upper":true},{"key":"BME 377S","name":"Industrial Internship","description":"Restricted to biomedical engineering majors. Students conduct research in biomedical companies in Texas and nationwide. Research may include development, management, business administration, and other topics. Requires a substantial final report. The equivalent of three lecture hours a week for one semester.","upper":true},{"key":"BME 678","name":"Undergraduate Thesis in Biomedical Engineering","description":"Restricted to biomedical engineering majors. Research performed during two consecutive semesters under the supervision of a biomedical engineering faculty member or other approved faculty member; topics are selected jointly by the student and faculty member. The student provides a progress report at the end of the first semester and writes a thesis and gives an oral presentation at the end of the second semester. Individual instruction for two semesters. Students pursuing both the Bachelor of Arts, Plan II, and a Bachelor of Science in Biomedical Engineering may use this course to fulfill the thesis requirements for the Bachelor of Arts, Plan II. Prerequisite: For 678A, admission to the major sequence in biomedical engineering and a University grade point average of at least 3.50; for 678B, a University grade point average of at least 3.50 and Biomedical Engineering 678A.","upper":true},{"key":"BME 379","name":"Tissue Engineering","description":"Restricted to biomedical engineering majors. Introduction to biomedical research in tissue engineering. Includes case studies of tissues and organs of the body, physiology and biology of tissue, pathologies of tissue, current clinical treatments, the role of engineers in development of new technologies to diagnose and treat pathologies, quantitative cellular and molecular techniques, and applications of synthetic and natural biomaterials. Three lecture hours a week for one semester. Only one of the following may be counted: Biomedical Engineering 379, Chemical Engineering 339T, 379 (Topic: Cell and Tissue Engineering). Prerequisite: Biology 311C and Biomedical Engineering 352 and 365S.","upper":true},{"key":"BME 679H","name":"Undergraduate Honors Thesis","description":"Restricted to biomedical engineering majors. Research performed during two consecutive semesters under the supervision of an engineering faculty member; topics are selected jointly by the student and the faculty member with approval by the director of the Engineering Honors Program. The student makes an oral presentation and writes a thesis. Individual instruction for two semesters. Students pursuing both the Bachelor of Arts, Plan II, and a bachelor's degree in engineering may use this course to fulfill the thesis requirement for the Bachelor of Arts, Plan II. Prerequisite: For 679HA, enrollment in the Engineering Honors Program; for 679HB, Biomedical Engineering 679HA and enrollment in the Engineering Honors Program.","upper":true}]