[{"key":"P S 303","name":"Introductory Physical Science I: Mechanics and Heat","description":"Designed for students with minimum prior preparation in mathematics and physics. Especially appropriate for prospective elementary school teachers. Inquiry laboratory approach to basic concepts of measurement, forces, motion, energy, temperature, and heat. Four hours of integrated laboratory and lecture a week for one semester. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"P S 350","name":"Physical Science for Elementary and Middle School Teachers","description":"Designed for kindergarten through sixth grade teachers with minimal preparation in mathematics (college algebra) and no preparation in physics. An inquiry laboratory in the basic concepts of light, electricity, and magnetism. Three hours of integrated laboratory and lecture a day for three weeks.","upper":true},{"key":"P S 367M","name":"Physical Science: Methods of Astronomy","description":"Same as Astronomy 367M. An introductory, self-paced course in the methods of astronomy that emphasizes learning astronomical principles through observations. Six laboratory hours a week for one semester. May not be counted toward the Bachelor of Arts, Plan I, degree with a major in astronomy. Prerequisite: Upper-division standing and nine semester hours of coursework in mathematics and/or science, including one of the following: Physical Science 303, 304, Astronomy 301, 302, 303. Equivalent preparation in mathematics, physics, chemistry, or earth sciences may be substituted with written approval of the instructor.","upper":true},{"key":"P S 375","name":"Individual Study in Physical Science","description":"Intended primarily for preservice and in-service teachers. Guided inquiry reading or laboratory research in physical science. Meets three times a week for one semester, for one hour each meeting.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and written consent of instructor.","upper":true}]