[{"key":"PHY 301","name":"Mechanics","description":"Designed for students who intend to major in science or mathematics.  Three lecture hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 301, 302K, 303K, 309K, 317K. Prerequisite: High school physics or consent of the undergraduate adviser; credit with a grade of at least C- or registration for Physics 101L; Mathematics 408C, 408K, and registration for 408L, or Mathematics 408N and registration for 408S.","upper":false},{"key":"PHY 101L","name":"Laboratory for Physics 301","description":"Three laboratory hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 101L, 102M, 103M, 117M. May not be counted toward a degree unless prerequisite is observed. Prerequisite: Credit with a grade of at least C- or registration for Physics 301.","upper":false},{"key":"PHY 102M (TCCN: PHYS 1101)","name":"Laboratory for Physics 302K","description":"Two laboratory hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 101L, 102M, 103M, 117M. May not be counted toward a degree unless prerequisite is observed. Prerequisite: Credit with a grade of at least C- or registration for Physics 302K.","upper":false},{"key":"PHY 102N (TCCN: PHYS 1102)","name":"Laboratory for Physics 302L","description":"Two laboratory hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 102N, 103N, 116L, 117N. May not be counted toward a degree unless prerequisite is observed. Prerequisite: Credit with a grade of at least C- or registration for Physics 302L.","upper":false},{"key":"PHY 303K (TCCN: PHYS 2325)","name":"Engineering Physics I","description":"A general survey of physics; primarily laws of motion, heat, and wave phenomena. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 301, 302K, 303K, 309K, 317K. Prerequisite: High school physics or consent of the undergraduate adviser; Mathematics 408C with a grade of at least C-; Mathematics 408K with a grade of at least C- and registration for 408L, or Mathematics 408N with a grade of at least C- and registration for 408S; and credit with a grade of at least C- or registration for Physics 103M.","upper":false},{"key":"PHY 303L (TCCN: PHYS 2326)","name":"Engineering Physics II","description":"Electricity and magnetism, optics, and atomic phenomena. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 302L, 303L, 309L, 316, 317L. Prerequisite: The following coursework with a grade of at least C- in each: Mathematics 408D, Physics 303K, and 103M; Mathematics 408L with a grade of at least C- and registration for 408M, or Mathematics 408S with a grade of at least C- and registration for 408M; and credit with a grade of at least C- or registration for Physics 103N.","upper":false},{"key":"PHY 103M (TCCN: PHYS 2125)","name":"Laboratory for Physics 303K","description":"Two laboratory hours a week for one semester. Only one of the following may be counted: Physics 101L, 102M, 103M, 117M. May not be counted toward a degree unless prerequisite is observed. Prerequisite: Credit with a grade of at least C- or registration for Physics 303K.","upper":false},{"key":"PHY 103N (TCCN: PHYS 2126)","name":"Laboratory for Physics 303L","description":"Two laboratory hours and one discussion hour a week for one semester. Only one of the following may be counted: Physics 102N, 103N, 116L, 117N. May not be counted toward a degree unless prerequisite is observed. Prerequisite: Credit with a grade of at least C- or registration for Physics 303L.","upper":false},{"key":"PHY 104","name":"Introductory Physics Seminar","description":"Suggested for beginning physics majors. Discussion of the development of important ideas in physics, with emphasis on their relevance to contemporary research. One lecture hour a week for one semester.  Offered on the pass/fail basis only.","upper":false},{"key":"PHY 306","name":"Elementary Physics Methods","description":"Designed for students who have not had high school physics, have weak problem-solving skills, and need preparation for Physics 301 or 303K. Three lecture hours a week for one semester. May not be counted toward any degree. Prerequisite: High school trigonometry or Mathematics 305G.","upper":false},{"key":"PHY 108","name":"Introduction to Research","description":"Introductory laboratory experience; use of tools and test equipment; beginning apprenticeship in active physics research. One class hour a week for one semester.  May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Consent of instructor and approval of an undergraduate adviser.","upper":false},{"key":"PHY 308F","name":"Introduction to Research","description":"Introductory laboratory experience; use of tools and test equipment; beginning apprenticeship in active physics research. One lecture hour and eight laboratory hours a week for one semester. Prerequisite: Consent of instructor and the undergraduate adviser.","upper":false},{"key":"PHY 309K (TCCN: PHYS 1305)","name":"Elementary Physics for Nontechnical Students","description":"Designed for students who do not intend to do further work in natural sciences, engineering, mathematics, or medicine. Mechanics, heat, and sound. Three lecture hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 301, 302K, 303K, 309K, 317K. May not be counted toward a degree in the College of Natural Sciences.","upper":false},{"key":"PHY 309L (TCCN: PHYS 1307)","name":"Elementary Physics for Nontechnical Students","description":"Electricity and magnetism, light, atomic and nuclear physics. Designed for students who do not intend to do further work in natural sciences, engineering, mathematics, or medicine. Three lecture hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 302L, 303L, 309L, 316, 317L. May not be counted toward a degree in the College of Natural Sciences. Prerequisite: Physics 309K with a grade of at least C-.","upper":false},{"key":"PHY 110C","name":"Conference Course","description":"Supervised study of selected topics in physics, by individual arrangement with department and instructor. Conference course. Some sections are offered on the pass/fail basis only; these are identified in the Course Schedule. May be repeated for credit when the topics vary. Prerequisite: Written consent of instructor.","upper":false},{"key":"PHY 315","name":"Wave Motion and Optics","description":"Study of general properties of waves; examples include sound, electromagnetic, and mechanical waves; special emphasis on light and optics. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Mathematics 427K, Physics 316, and 116L; and credit with a grade of at least C- or registration for Physics 115L.","upper":false},{"key":"PHY 115L","name":"Laboratory for Physics 315","description":"Three laboratory hours a week for one semester. May not be counted toward a degree unless prerequisite is observed. Prerequisite: Credit with a grade of at least C- or registration for Physics 315.","upper":false},{"key":"PHY 316","name":"Electricity and Magnetism","description":"Three lecture hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 302L, 303L, 309L, 316, 317L. Prerequisite: The following coursework with a grade of at least C- in each: Mathematics 408D, Physics 301 and 101L; Mathematics 408L with a grade of at least C- and registration for 408M, or Mathematics 408S with a grade of at least C- and registration for 408M; and credit with a grade of at least C- or registration for Physics 116L.","upper":false},{"key":"PHY 116L","name":"Laboratory for Physics 316","description":"Three laboratory hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 102N, 103N, 116L, 117N. May not be counted toward a degree unless prerequisite is observed. Prerequisite: Credit with a grade of at least C- or registration for Physics 316.","upper":false},{"key":"PHY 317K","name":"General Physics I","description":"Mechanics, heat, and sound, with biomedical applications. An introductory course designed and recommended primarily for premedical students and others in the biomedical sciences whose professional or preprofessional training includes an introductory course in calculus. Three lecture hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 301, 302K, 303K, 309K, 317K. May not be counted toward the Bachelor of Science in Astronomy or Bachelor of Science in Physics. Satisfies most medical and dental school requirements for physics. Prerequisite: High school physics or consent of the undergraduate adviser; Mathematics 408C with a grade of at least C-; Mathematics 408K with a grade of at least C- and registration for 408L, or Mathematics 408N with a grade of at least C- and registration for 408S; and credit with a grade of at least C- or registration for Physics 117M.","upper":false},{"key":"PHY 317L","name":"General Physics II","description":"Electricity and magnetism, light, atomic and molecular physics, nuclear physics, and their biomedical applications. Designed and recommended primarily for premedical students and others in the biomedical sciences whose professional or preprofessional training includes an introductory course in calculus. Three lecture hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 302L, 303L, 309L, 316, 317L. May not be counted toward the Bachelor of Science in Astronomy or the Bachelor of Science in Physics. Satisfies most medical and dental school requirements for physics. Prerequisite: Physics 317K and 117M with grades of at least C-; and credit with a grade of at least C- or registration for Physics 117N.","upper":false},{"key":"PHY 117M","name":"Laboratory for Physics 317K","description":"Three laboratory hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 101L, 102M, 103M, 117M. Prerequisite: Credit with a grade of at least C- or registration for Physics 317K.","upper":false},{"key":"PHY 117N","name":"Laboratory for Physics 317L","description":"Three laboratory hours a week for one semester. Only one of the following may be counted without prior approval of the department: Physics 102N, 103N, 116L, 117N. Prerequisite: Credit with a grade of at least C- or registration for Physics 317L.","upper":false},{"key":"PHY 321","name":"Modern Physics: Plan II","description":"Restricted to Plan II students. Conceptual foundations of modern physics. Examines quantum mechanics, quantum field theory, relativity, and general relativity, including large-scale structure and cosmology; and the development of analytic problem-solving skills, including estimation. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"PHY 329","name":"Introduction to Computational Physics","description":"Computational methods for problem solving and research in physics; numerical analysis and computer simulation methods for physics applications using different types of computers. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 367, Mathematics 368K, Physics 329. Prerequisite: The following coursework with a grade of at least C- in each: Physics 315 and 115L; a programming course at the level of Computer Science 303E with a grade of at least C- or consent of instructor; and credit with a grade of at least C- or registration for Mathematics 341 or 340L.","upper":true},{"key":"PHY 329W","name":"Cooperative Physics","description":"Covers the work period of physics students in the Cooperative Education Program, which provides supervised work experience by arrangement with the employer and the supervising instructor. Forty laboratory hours a week for one semester. The student must repeat the course each work period and must take it twice to receive credit toward the degree; at least one of these registrations must be during a long-session semester. No more than three semester hours may be counted toward the major requirement; no more than six semester hours may be counted toward the degree. The student's first registration must be on the pass/fail basis. Prerequisite: Membership application to the Cooperative Physics Program, Physics 316 with a grade of at least C-, and consent of the undergraduate adviser.","upper":true},{"key":"PHY 333","name":"Modern Optics","description":"Review of geometrical optics, polarization, interference, and optical instruments. Subjects include Fourier optics, light propagation in fibers, quantum optics, and coherence. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Mathematics 427K, Physics 315, and 115L.","upper":true},{"key":"PHY 133L","name":"Laboratory for Physics 333","description":"Three laboratory hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Physics 333.","upper":true},{"key":"PHY 336K","name":"Classical Dynamics","description":"Elementary linear vector algebra, Newtonian mechanics, Lagrangian mechanics, central force motion, dynamics of rigid bodies, and theory of small oscillations. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Mathematics 427L or 364K, Physics 315, and 115L.","upper":true},{"key":"PHY 336L","name":"Fluid Dynamics","description":"Fundamental concepts of fluid mechanics developed and applied to laminar and turbulent flows. Subjects include the Navier-Stokes equations, pipe and channel flow, drag, boundary layers, convection, and rotating fluids. Three lecture hours a week for one semester. Prerequisite: Physics 336K with a grade of at least C-.","upper":true},{"key":"PHY 338K","name":"Electronic Techniques","description":"Elementary circuit theory, amplifiers, feedback, pulse and digital techniques, signal processing, and microprocessors as applied to physics instrumentation. One and one-half lecture hours and three laboratory hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Mathematics 427K, Physics 316, and 116L.","upper":true},{"key":"PHY 341","name":"Selected Topics in Physics","description":"Three lecture hours a week for one semester. An additional one-hour problem session is required for some sections; these are identified in the Course Schedule. May not be counted toward the Bachelor of Science in Physics degree without prior approval of the department. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, three semester hours of coursework in a natural science, and three semester hours of coursework in mathematics.","upper":true},{"key":"PHY 345","name":"Biophysics","description":"Basic concepts of physics developed and applied to biological systems. Subjects include energy in living systems, entropic interactions, molecular forces and self-assembly, biopolymers, bio-membranes, cell-cell interactions, pattern formation, collective behavior, higher order systems, population dynamics and evolution. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and the following coursework with a grade of at least C- in each: Biology 311D, Chemistry 302, and Physics 355.","upper":true},{"key":"PHY 352K","name":"Classical Electrodynamics I","description":"Electrostatic fields, magnetostatic fields, derivation of Green's theorems and functions and of Maxwell's equations. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Mathematics 427L or 364K, Physics 315, and 115L.","upper":true},{"key":"PHY 352L","name":"Classical Electrodynamics II","description":"A continuation of Physics 352K, emphasis is placed on conservation laws, electromagnetic waves, potentials and fields, radiation, and Lorentz invariance.  One or more special subjects, such as Rayleigh scattering and energy loss by relativistic charged particles in matter will be developed. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Physics 352K with a grade of at least C-.","upper":true},{"key":"PHY 353L","name":"Modern Physics Laboratory","description":"Laboratory experiments investigating the breakdown of classical physics for microscopic phenomena. Includes absorption and emission spectra, the photoelectric effect, blackbody radiation, the Compton effect, X-ray diffraction, and other experiments in modern physics. Four and one-half laboratory hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Physics 315 and 115L.","upper":true},{"key":"PHY 355","name":"Modern Physics and Thermodynamics","description":"Introduction to modern physics and thermodynamics: photons (spectra, photoelectric effect, blackbody radiation, Compton effect), atoms (Rutherford, Bohr), matter waves (Planck, deBroglie, probability interpretation, Schroedinger), nuclei, particles, special relativity, the laws of thermodynamics, and statistical physics. Three lecture hours a week for one semester. Physics 319 and 355 may not both be counted. Prerequisite: Physics 303L or 316 with a grade of at least C-.","upper":true},{"key":"PHY 362K","name":"Quantum Physics II: Atoms and Molecules","description":"The two-electron atom; spin and statistics; coupling schemes for many-electron atoms; atoms and the radiation field; perturbation methods for decay and collisions; thermal, electrical, and magnetic properties of solids; and free-electron metal and band theory. May include subjects such as superconductivity, Josephson tunneling, and others. Three lecture hours a week for one semester. Prerequisite: Physics 373 with a grade of at least C-.","upper":true},{"key":"PHY 362L","name":"Quantum Physics III: Particles and Nuclei","description":"Nuclei and nucleons, their gross properties; the hadrons; symmetries and conservation laws; nuclear stability; electromagnetic, weak, and hadronic interactions; nuclear reactions at low, medium, and high energies; nucleon structure; tools of experimental nuclear physics; models of theoretical nuclear physics; nuclear technology. Three lecture hours a week for one semester. Prerequisite: Physics 373 with a grade of at least C-; Physics 362K is recommended.","upper":true},{"key":"PHY 369","name":"Thermodynamics and Statistical Mechanics","description":"Basic concepts of thermal physics; entropy, enthalpy, free energy, phase transitions, equilibrium distribution functions, applications. Three lecture hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Physics 373.","upper":true},{"key":"PHY 370C","name":"Individual Study in Physics","description":"Supervised reading or research in physics. Hours to be arranged. Some sections are offered on the pass/fail basis only. May be repeated for credit when the topics vary. Prerequisite: Physics 336K with a grade of at least C-, credit with a grade of at least C- or registration for Physics 352K, and consent of the undergraduate adviser.","upper":true},{"key":"PHY 670T","name":"Senior Thesis","description":"Individual research with faculty supervision. First half involves preparation of proposal; second involves completion of written thesis. Six hours of work a week for one semester, or three hours of work a week for two semesters. Only three semester hours may be counted toward the Bachelor of Science in Physics degree. Prerequisite: Upper-division standing and nine semester hours of upper-division coursework in physics.","upper":true},{"key":"PHY 373","name":"Quantum Physics I: Foundations","description":"Postulates of quantum mechanics, the bound states of the finite square well, the harmonic oscillator, operator-eigenvalue formulism and selected examples, the hydrogen atom, angular momentum, rigid rotor, and spin. May include simple scattering theory. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Physics 336K, 353L, and 355 (or 453).","upper":true},{"key":"PHY 474","name":"Advanced Laboratory I","description":"Modern experimental techniques, theory of error, and analysis of experiments; both modern and classical experiments in atomic and nuclear physics, electricity and magnetism, optics and heat. Three lecture hours and eight laboratory hours a week for one semester, with additional laboratory hours to be arranged. With consent of instructor, may be repeated for credit. Prerequisite: Physics 352K, 353L, and 355 (or 453); or consent of the undergraduate adviser. Physics 338K is recommended.","upper":true},{"key":"PHY 375P","name":"Introductory Plasma Physics","description":"Orbit theory and drifts, introduction to plasma stability and waves, applications to plasma confinement and heating. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Physics 352K and 369.","upper":true},{"key":"PHY 375R","name":"Introduction to Relativity","description":"Overview of the special and general theories of relativity, with emphasis on recent developments in gravitation. Three lecture hours a week for one semester. Prerequisite: Physics 352K with a grade of at least C-.","upper":true},{"key":"PHY 375S","name":"Introductory Solid-State Physics","description":"Crystal structure, classification of solids, cohesion, thermal and electrical properties of solids, magnetic properties of solids, imperfections. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Physics 369 and 373.","upper":true},{"key":"PHY 379H","name":"Honors Tutorial Course","description":"Research project, resulting in a thesis, for outstanding students electing to take the honors program in physics.  Conference course. Prerequisite: A University grade point average of at least 3.00, a grade point average in physics of at least 3.50, twelve semester hours of upper-division coursework in physics, and consent of the student's research supervisor and the departmental honors adviser.","upper":true}]