[{"key":"C S 301K","name":"Foundations of Logical Thought","description":"Introductory logic in the context of computing; introduction to formal notations; basic proof techniques; sets, relations, and functions. Three lecture hours a week for one semester. Some sections also require one discussion hour a week; these are identified in the Course Schedule.","upper":false},{"key":"C S 302","name":"Computer Fluency","description":"An introduction to the fundamental concepts of computing: how computers work, what they can do, and how they can be used effectively. Some programming is required. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Credit for Computer Science 302 may not be earned after a student has received credit for Computer Science 303E, 305J, 307, 312, 312H, 314, or 314H. May not be counted toward a degree in computer science.","upper":false},{"key":"C S 303E","name":"Elements of Computers and Programming","description":"Problem solving and fundamental algorithms for various applications in science, business, and on the World Wide Web, and introductory programming in a modern object-oriented programming language. The equivalent of three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 303E, 305J, 312, 312H. Credit for Computer Science 303E may not be earned after a student has received credit for Computer Science 307, 314, or 314H. May not be counted toward a degree in computer science.","upper":false},{"key":"C S 105","name":"Computer Programming","description":"An introduction to programming in a particular computer language. Students design and implement programs. One lecture hour a week for one semester. May be repeated for credit when the languages vary. Prerequisite: Computer Sciences 307, 313E, 314, 314H, or Electrical Engineering 422C (or 322C), with a grade of at least C-.","upper":false},{"key":"C S 108","name":"Software Systems","description":"Introduction to the use of a particular software system. Students build applications that exploit the system being studied. One lecture hour a week for one semester.  May be repeated for credit when the topics vary. Offered on the pass/fail basis only. Prerequisite: Computer Science 307, 313E, 314, 314H, or Electrical Engineering 422C (or 322C), with a grade of at least C-.","upper":false},{"key":"C S 311","name":"Discrete Mathematics for Computer Science","description":"Restricted to computer science majors. A focus on discrete mathematical tools of fundamental importance to the working computer scientist.  An emphasis is placed on using logical notation to express rigorous mathematical arguments. Topics include proof by induction, introduction to graph theory, recurrences, sets, functions, and an introduction to program correctness. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 311, 311H, 313H, 313K, 336, 336H. Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C-: Computer Science 312 or 312H; and Mathematics 408C, 408K or 408N, or registration for Mathematics 408C.","upper":false},{"key":"C S 311H","name":"Discrete Mathematics for Computer Science: Honors","description":"Restricted to honors computer science majors. A focus on discrete mathematical tools of fundamental importance to the working computer scientist.  An emphasis is placed on using logical notation to express rigorous mathematical arguments. Topics include proof by induction, graph theory, number theory, combinatorics, recurrences, sets, functions, an introduction to program correctness, and discrete probability. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 311, 311H, 313H, 313K, 336, 336H. Offered on the letter-grade basis only. Prerequisite: For computer science majors, the following coursework with a grade of at least C-: Mathematics 408C, 408K, or 408N, or registration for Mathematics 408C; for others, consent of instructor.","upper":false},{"key":"C S 312","name":"Introduction to Programming","description":"First part of a two-part sequence in Java programming. Fundamental concepts of structured programming; procedures and data structures with a focus on problem solving strategies and implementation; introduction to concepts of informal specification, informal reasoning about program behavior, debugging, and ad hoc testing. Three lecture hours and one discussion hour a week for one semester. Only one of the following courses may be counted: Computer Science 303E, 305J, 312, 312H. Credit for Computer Science 312 may not be earned after a student has received credit for Computer Science 314 or 314H. Prerequisite: Credit with a grade of at least C- or registration for Mathematics 408C, 408K, or 408N.","upper":false},{"key":"C S 312H","name":"Introduction to Programming: Honors","description":"Restricted to computer science majors. First part of a two-part sequence in Java programming. Fundamental concepts of structured programming; procedures and data structures with a focus on problem solving strategies and implementation; introduction to concepts of informal specification, informal reasoning about program behavior, debugging, and ad hoc testing. Three lecture hours and one discussion hour a week for one semester. Only one of the following courses may be counted: Computer Science 303E, 305J, 312, 312H. Credit for Computer Science 312H may not be earned after a student has received credit for Computer Science 314 or 314H. Prerequisite: Credit with a grade of at least C- or registration for Mathematics 305G, or a passing score on the College of Natural Sciences mathematics placement examination; and consent of the honors director.","upper":false},{"key":"C S 313E","name":"Elements of Software Design","description":"Object-oriented design of software in a modern high-level language, using software library packages. Introduction to elementary data structures and complexity of algorithms. Three lecture hours a week for one semester. May not be counted toward a degree in computer science. Prerequisite: Computer Science 303E, 305J, 312, or 312H with a grade of at least C-.","upper":false},{"key":"C S 314","name":"Data Structures","description":"Second part of a two-part sequence in Java programming. Introduction to specifications, simple unity testing, and debugging; building and using canonical data structures; algorithm analysis and reasoning techniques such as assertions and invariants. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Computer Science 307, 314, 314H, 315, 315H. Prerequisite: Computer Science 312 or 312H with a grade of at least C-.","upper":false},{"key":"C S 314H","name":"Data Structures: Honors","description":"Second part of a two-part sequence in Java programming. Introduction to specifications, simple unity testing, and debugging; building and using canonical data structures; algorithm analysis and reasoning techniques such as assertions and invariants. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Computer Science 307, 314, 314H. Only one of the following may be counted: Computer Science 314, 314H, 315, 315H. Prerequisite: Computer Science 312 or 312H with a grade of at least C-, and consent of the honors director.","upper":false},{"key":"C S 321H","name":"Functional and Symbolic Programming: Honors","description":"An introduction to functional and symbolic programming and to the use of these concepts throughout computer science. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313K, or 313H; 307, 314, 314H, 315, or 315H; and consent of the honors director.","upper":true},{"key":"C S 323E","name":"Elements of Scientific Computing","description":"Fundamentals of software issues related to scientific computing. Subjects include floating-point computations, numerical computation errors, interpolation, integration, solution of linear systems of equations, optimization, and initial value problems of ordinary differential equations. Implementation of algorithms are investigated using MATLAB for matrix and vector computations. Examples are drawn from a variety of science and mathematics areas. Three lecture hours a week for one semester. May not be counted toward a degree in computer science. Computer Science 323E and 323H may not both be counted. Prerequisite: The following coursework with a grade of at least C-: Computer Science 303E and 313E, or Computer Science 307, 312, 312H, 314, 314H, 315, or 315H; Electrical Engineering 322C or 422C; Mathematics 408D, 408M, or 427L; and credit with a grade of at least C- or registration for Mathematics 340L, 341, or Statistics and Scientific Computation 329C.","upper":true},{"key":"C S 323H","name":"Elements of Scientific Computing: Honors","description":"Fundamentals of software issues related to scientific computing. Subjects include floating-point computations, numerical computation errors, interpolation, integration, solution of linear systems of equations, optimization, and initial value problems of ordinary differential equations. Implementation of algorithms are investigated using MATLAB for matrix and vector computations. Examples are drawn from a variety of science and mathematics areas. Three lecture hours a week for one semester. May not be counted toward a degree in computer science. Computer Science 323E and 323H may not both be counted. Prerequisite: Computer Science 303E, 305J, 307, 312, 312H, 315, or 315H with a grade of at least C-; credit with a grade of at least C- or registration for Mathematics 340L, 341, or Statistics and Scientific Computation 329C; and consent of the honors director.","upper":true},{"key":"C S 324E","name":"Elements of Graphics and Visualization","description":"Basics of two- and three-dimensional computer graphics systems, modeling and rendering, and selected graphics software APIs. Other topics may include interactive graphics, animation, graphical user interfaces, and the graphical presentation of information. Three lecture hours a week for one semester. May not be counted toward a degree in computer science. Prerequisite: One of the following with a  grade of at least C-: Computer Science 303E, 305J, 307, 312, 312H, 314, 314H, 315, 315H, Electrical Engineering 322C, or 422C.","upper":true},{"key":"C S 326E","name":"Elements of Networking","description":"Introduction to the principles and basic concepts of the Internet, networking applications and protocols, and simple client/server applications. Other topics may include network technologies and topologies, packet and circuit switching, LANS and WANS, Internet security, and network management. Three lecture hours a week for one semester. May not be counted toward a degree in computer science. Prerequisite: One of the following with a grade of at least C-: Computer Science 303E, 305J, 307, 312, 312H, 314, 314H, 315, 315H, Electrical Engineering 322C, or 422C.","upper":true},{"key":"C S 327E","name":"Elements of Databases","description":"A practical introduction to database management systems, with discussion of database administration and management. Survey of logical modeling, database design with a focus on relational databases, SQL query language, and current applications. Subjects may include data integrity, performance, concurrency, transaction processing, recovery, security, and Web applications. Three lecture hours a week for one semester. May not be counted toward a degree in computer science. Prerequisite: One of the following with a grade of at least C-: Computer Science 303E, 305J, 307, 312, 312H, 314, 314H, 315, 315H, Electrical Engineering 322C, or 422C.","upper":true},{"key":"C S 429","name":"Computer Organization and Architecture","description":"Restricted to computer science majors. An introduction to low-level computer design ranging from the basics of digital design to the hardware/software interface for application programs. Includes basic systems principles of pipelining and caching, and requires writing and understanding programs at multiple levels. Four lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Computer Science 310, 310H, 429, 429H. Prerequisite: The following courses with a grade of at least C-: Computer Science 311, 311H, 313H, or 313K; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 329E","name":"Topics in Elements of Computing","description":"Three lecture hours a week for one semester. May not be counted toward a degree in computer science. May be repeated for credit when the topics vary. Prerequisite: Consent of instructor; additional prerequisites vary with the topic.","upper":true},{"key":"C S 429H","name":"Computer Organization and Architecture: Honors","description":"Restricted to computer science majors. An introduction to low-level computer design ranging from the basics of digital design to the hardware/software interface for application programs. Includes basic systems principles of pipelining and caching, and requires writing and understanding programs at multiple levels. Four lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Computer Science 310, 310H, 429, 429H. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 314, 314H, 315, or 315H; and consent of the honors director.","upper":true},{"key":"C S 329W","name":"Cooperative Computer Science","description":"This course covers the work period of computer science students in the Cooperative Education program, which provides supervised work experience by arrangement with the employer and the supervising instructor. Forty laboratory hours a week for one semester. The student must repeat the course each work period and must take it twice to receive credit toward the degree; at least one of these registrations must be during a long-session semester. However, no more than three semester hours may be counted toward the major requirement. The student's first registration must be on the pass/fail basis; the second must be on the letter-grade basis. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; 307, 314, 314H, 315, or 315H; 310, 310H, 429, or 429H; and consent of the undergraduate adviser.","upper":true},{"key":"C S 331","name":"Algorithms and Complexity","description":"An investigation of algorithmic paradigms: divide and conquer, dynamic programming, greedy algorithms, graph algorithms, randomized algorithms, undecidability, NP-completeness, and approximation algorithms. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Computer Science 331, 331H, 357, 357H, 378 (Topic: Algorithms and Complexity). Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C-: Computer Science 311, or 311H, (or 313H or 313K); Computer Science 314, or 314H, (or 307, 315, or 315H); Computer Science 429, or 429H, (or 310 or 310H); Mathematics 362K, or Statistics and Data Sciences 321, (or Statistics and Scientific Computation 321); and credit with a grade of at least C- or registration for Mathematics 340L, or Statistics and Data Sciences 329C, (or Statistics and Scientific Computation 329C).","upper":true},{"key":"C S 331H","name":"Algorithms and Complexity: Honors","description":"An investigation of algorithmic paradigms: divide and conquer, dynamic programming, greedy algorithms, graph algorithms, randomized algorithms, undecidability; NP-completeness,  approximation algorithm, sorting lower bound, selected topics from amortized analysis, network flow, and linear programming. Three lecture hours and one hour of discussion a week for one semester. Only one of the following may be counted: Computer Science 331, 331H, 357, 357H, 378 (Topic: Algorithms and Complexity). Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C-: Computer Science 311, or 311H, (or 313H or 313K); Computer Science 314, or 314H, (or 307, 315, or 315H); Computer Science 429, or 429H, (or 310 or 310H); Mathematics 362K, or Statistics and Data Sciences 321, (or Statistics and Scientific Computation 321); and credit with a grade of at least C- or registration for Mathematics 340L, or Statistics and Data Sciences 329C, (or Statistics and Scientific Computation 329C); and consent of the honors director.","upper":true},{"key":"C S 234","name":"Technical Writing","description":"Application of techniques and strategies of effective technical writing, and of conventions used in documents such as letters, memos, proposals, abstracts, and reports. Two lecture hours a week for one semester. Computer Science 234 and 178 (Topic: Technical Writing) may not both be counted. May not be counted toward the number of hours in computer science required for the Bachelor of Science in Computer Science degree. Prerequisite: Computer Science 310, 310H, 429, or 429H with a grade of at least C-.","upper":true},{"key":"C S 337","name":"Theory in Programming Practice","description":"Application of program-analysis theory to program design. Methodologies for large-scale program design. Designed to help students bring together theoretical and programming skills. Three lecture hours and one discussion hour a week for one semester. Computer Science 337 and 337H may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each:  Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Computer Science 331 or 331H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 337H","name":"Theory in Programming Practice: Honors","description":"Application of program-analysis theory to program design. Methodologies for large-scale program design. Designed to help students bring together theoretical and programming skills. Three lecture hours and one discussion hour a week for one semester. Computer Science 337 and 337H may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each:  Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Computer Science 331, 331H, 341, 341H, 357, or 357H; Mathematics 408C, 408K, or 408N; and consent of the honors director.","upper":true},{"key":"C S 439","name":"Principles of Computer Systems","description":"Restricted to computer science majors. An introduction to low-level software abstractions with an emphasis on the connection of these abstractions to underlying computer hardware. Key abstractions include threads, dynamic memory allocation, protection, and IO. Requires writing of synchronized multithreaded programs. Four lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Computer Science 439, 439H, 352, 352H. Only one of the following may be counted: Computer Science 439, 439H, 372, 372H. Prerequisite: Computer Science 310, 310H, 429, or 429H with a grade of at least C-.","upper":true},{"key":"C S 439H","name":"Principles of Computer Systems: Honors","description":"Restricted to computer science majors. An introduction to low-level software abstractions with an emphasis on the connection of these abstractions to underlying computer hardware. Key abstractions include threads, dynamic memory allocation, protection, and IO. Requires writing of synchronized multi-threaded programs. Four lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Computer Science 439, 439H, 352, 352H. Only one of the following may be counted: Computer Science 439, 439H, 372, 372H. Prerequisite: Computer Science 310, 310H, 429, or 429H with a grade of at least C-; and consent of the honors director.","upper":true},{"key":"C S 341","name":"Automata Theory","description":"An introduction to the formal study of automata and of related formal languages with applications in computer science. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 341, 341H, Linguistics 340. Prerequisite: Computer Science 429 or 429H with a grade of at least C-.","upper":true},{"key":"C S 341H","name":"Automata Theory: Honors","description":"An introduction to the formal study of automata and of related formal languages with applications in computer science. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 341, 341H, Linguistics 340. Prerequisite: Computer Science 429 or 429H with a grade of at least C-.","upper":true},{"key":"C S 342","name":"Neural Networks","description":"Biological information processing; architectures and algorithms for supervised learning, self-organization, reinforcement learning, and neuro-evolution; hardware implementations and simulators; applications in engineering, artificial intelligence, and cognitive science. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 342C","name":"Computational Brain","description":"An examination of the brain as a computational system composed of different layers of abstraction. Focus on scientific writing, with weekly reviews of relevant scientific papers. Three lecture hours a week for one semester Computer Science 342C and 378 (Topic: Computational Brain) may not both be counted. Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C- in each:  Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 362K or Statistics and Scientific Computation 321.","upper":true},{"key":"C S 343","name":"Artificial Intelligence","description":"A survey of current artificial intelligence issues, including search, production systems, knowledge representation, knowledge-based systems, planning, natural language processing, and machine learning. Artificial intelligence programming projects are required. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 343, 343H, 378H (Topic: Artificial Intelligence: Honors). Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 362K or Statistics and Scientific Computation 321.","upper":true},{"key":"C S 343H","name":"Artificial Intelligence: Honors","description":"An introduction to the field of artificial intelligence (AI), starting from foundations in search and knowledge representation, and then sampling from major AI topics such as knowledge-based systems, planning, machine learning, probabilistic reasoning, intelligent agents (including for games), natural language processing, robotics, computer vision, and philosophical foundations. Programming projects are required. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 343, 343H, 378H (Topic: Artificial Intelligence: Honors). Prerequisite: The following coursework with a grade of at least C- in each:  Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429 or 429H; Mathematics 362K or Statistics and Scientific Computation 321; and consent of the honors director.","upper":true},{"key":"C S 344M","name":"Autonomous Multiagent Systems","description":"An introduction to autonomous agents, with an emphasis on multiagent systems. Students use a robotics simulator. Emphasis on computer science research activities, including speaking, writing, programming, and working in groups. Three lecture hours a week for one semester. Computer Science 344M and 378 (Topic: Autonomous Multiagent Systems) may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313K, or 313H; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 362K or Statistics and Scientific Computation 321.","upper":true},{"key":"C S 344R","name":"Robotics","description":"A survey of methods and techniques important for intelligent robotics. Students work in teams, applying these methods to get intelligent behavior from physical robots. Three lecture hours a week for one semester. Computer Science 344R and 378 (Topic: Robotics) may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 362K or Statistics and Scientific Computation 321.","upper":true},{"key":"C S 345","name":"Programming Languages","description":"Survey of significant concepts underlying modern programming languages, including syntax, functions, expressions, types, polymorphism, assignment, procedures, pointers, encapsulation, classes, and inheritance, with some discussion of implementation issues. Prominent programming paradigms, such as sequential, concurrent, object-oriented, functional, and logic programming. Illustrative examples drawn from a variety of current languages. Three lecture hours a week for one semester. Computer Science 345 and 345H may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 345H","name":"Programming Languages: Honors","description":"A survey of significant concepts underlying modern programming languages, including syntax, functions, expressions, types, polymorphism, assignment, procedures, pointers, encapsulation, classes, and inheritance, with some discussion of implementation issues. Prominent programming paradigms, such as sequential, concurrent, object-oriented, functional, and logic programming. Illustrative examples drawn from a variety of current languages. Three lecture hours a week for one semester. Computer Science 345 and 345H may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Mathematics 408C, 408K, or 408N; and consent of the honors director.","upper":true},{"key":"C S 346","name":"Cryptography","description":"A theoretical introduction to cryptography. Subjects include private key cryptosystems, public key cryptosystems, digital signatures, secret sharing schemes, and the necessary mathematical background. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Computer Science 331, 331H, 341, 341H, 357, or 357H; Mathematics 408C, 408K, or 408N; and credit with a grade of at least C- or registration for Mathematics 340L or Statistics and Scientific Computation 329C.","upper":true},{"key":"C S 347","name":"Data Management","description":"Concepts of database design and database system implementation. Data models, query processing, database design theory, crash recovery, concurrent control, and distributed databases. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 349","name":"Contemporary Issues in Computer Science","description":"An examination of social, professional, and ethical issues involved in the use of computer technology. Subjects may include software engineering ethics, computer safety and reliability, constitutional issues, intellectual property, computer crime, societal impact, emerging technologies, and philosophical issues. Three lecture hours a week for one semester. Computer Science 349 and 378 (Topic: Contemporary Issues in Computer Science) may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; and Computer Science 310, 310H, 429, or 429H.","upper":true},{"key":"C S 350C","name":"Advanced Computer Architecture","description":"Relationships between programming and hardware design,  high performance and low power microarchitectures, memory system design, technology and workload constraints on design, special techniques for coding, addressing, and control, and evaluation of design alternatives will be explored. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 350C, 352, 352H. Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 307, 314, 314H, 315, or 315H; and Computer Science 439 or 439H.","upper":true},{"key":"C S 350F","name":"Operating Systems","description":"Advanced coverage of core operating systems (virtual memory, file systems, scheduling), and intermediate and advanced operating systems concepts: multiprocessing, multi-core computing, linking, kernel design, virtual machines, and security. Three lecture hours a week for one semester. Only one of the following may be counted:  Computer Science 350F, 372, 372H. Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C- in each:  Computer Science 307, 314, 314H, 315, or 315H; and Computer Science 439 or 439H.","upper":true},{"key":"C S 351","name":"LISP and Symbolic Computation","description":"Subjects include symbolic computation for artificial intelligence, such as pattern-matching, unification, frames, flavors, semantic networks, deductive retrieval, rule-based and constraint-based inference. Substantial programming projects in LISP. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 353","name":"Theory of Computation","description":"A survey of the theoretical bases of computation: computational complexity (including the classes P and NP) and formal models of the semantics of programming languages. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Computer Science 331, 331H, 341, 341H, 357, or 357H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 354","name":"Computer Graphics","description":"Introduction to techniques for human-machine communication through imagery. Subjects include display hardware, transformations, interactive techniques, geometric modeling, two- and three-dimensional display algorithms, graphics software systems architecture, and hidden-line and surface elimination. Projects are assigned and in-depth exploration is encouraged. Three lecture hours a week for one semester. Prerequisite: The following courses with a grade of at least C-: Computer Science 429 or 429H; Computer Science 105 (Topic: Computer Programming: C++), 371P, 373, or 378 (Topic: Generic Programming in the STL); Mathematics 408D, 408M, or 427L; and Mathematics 340L, 341, or Statistics and Data Sciences 329C (or Statistics and Scientific Computation 329C).","upper":true},{"key":"C S 354R","name":"Game Technology","description":"An examination of major technological components of computer games and their integration, modeling and animation, physics simulation, networking for games, interface and interaction techniques, and special effects. Three lecture hours a week for one semester. Computer Science 354R and 378 (Topic: Game Technology) may not both be counted. Offered on the letter-grade basis only. Prerequisite: Computer Science 354 with a grade of at least C-.","upper":true},{"key":"C S 354S","name":"Game Development Capstone: Two-Dimensional Games","description":"Participation in an interdisciplinary team to gain a thorough understanding of the two-dimensional game development process, through modeling of the environment and practices that are used in game studios. Three lecture hours a week for one semester. Computer Science 354S and 378 (Topic: Game Development Capstone: 2D Games) may not both be counted. Prerequisite: Computer Science 429 or 429H with a grade of at least C-, and consent of instructor.","upper":true},{"key":"C S 354T","name":"Game Development Capstone: Three-Dimensional Games","description":"Participation in interdisciplinary teams to gain a thorough understanding of the three-dimensional game development process, through modeling of the environment and practices that are used in game studios. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Computer Science 429 or 429H with a grade of at least C-, and consent of instructor.","upper":true},{"key":"C S 356","name":"Computer Networks","description":"Introduction to computer networks, including common terminology, basic design issues, and types of networks and protocols. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Computer Science 439, 439H, 352, 352H, 372, or 372H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 356R","name":"Introduction to Wireless Networks","description":"An introduction to basic knowledge in wireless networks ranging from the physical layer to the application layer, and across different types of wireless networks such as WiFi, cellular, and multihop networks. Three lecture hours a week for one semester. Computer Science 356R and 378 (Topic: Introduction to Wireless Networks) may not both be counted. Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C-: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K or 408N.","upper":true},{"key":"C S 361","name":"Introduction to Computer Security","description":"An introduction to computer security, both in the abstract and in the context of real systems, including recognizing potential threats to confidentiality, integrity and availability, and developing familiarity with current security-related issues in computer science. Three lecture hours a week for one semester. Computer Science 361 and 378 (Topic: Introduction to Security) may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 361C","name":"Information Assurance and Security","description":"Selected subjects from the broad area of information assurance, including computer security, communications security, operations security, and risk assessment. Three lecture hours a week for one semester. Computer Science 361C and 378 (Topic: Information Assurance and Security) may not both be counted. Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C- in each:  Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 361S","name":"Network Security and Privacy","description":"An examination of common computer security threats; fundamental techniques for implementing secure software systems and networks; practical experience in attacking and defending networked systems. Three lecture hours a week for one semester. Computer Science 361S and 378 (Topic: Network Security and Privacy) may not both be counted. Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C- in each:  Computer Science 311, 311H, 313H, or 313K; Computer Science 310, 310H, 429, or 429H; Mathematics 408C, 408K or 408N; and two of the following courses with a grade of at least C- in each: Computer Science 346, 356, 361, 375, and 439 or 439H.","upper":true},{"key":"C S 363D","name":"Introduction to Data Mining","description":"Introduction to the topic of data mining: data preprocessing regression, classification, clustering, dimensionality reduction, association analysis and anomaly detection. Three lecture hours a week for one semester. Computer Science 363D and 378 (Topic: Introduction to Data Mining) may not both be counted. Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C- in each:  Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Mathematics 362K or Statistics and Scientific Computation 321; and Mathematics 340L or Statistics and Scientific Computation 329C.","upper":true},{"key":"C S 367","name":"Numerical Methods","description":"Subjects include systems of linear equations, numerical integration, ordinary differential equations, and nonlinear equations. Construction and use of large numerical systems. Influence of data representation and computer architecture on algorithm choice and development. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 367, Mathematics 368K, Physics 329. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Mathematics 408D, 408M, or 427L; and Mathematics 340L, 341, or Statistics and Scientific Computation 329C.","upper":true},{"key":"C S 369","name":"Systems Modeling","description":"Introduction to performance modeling, with emphasis on computer systems. Modeling methodology, queueing network models, simulation, analysis of results. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 362K or Statistics and Scientific Computation 321.","upper":true},{"key":"C S 370","name":"Undergraduate Reading and Research","description":"Supervised study of selected problems in computer science, by individual arrangement with supervising instructor. The equivalent of three lecture hours a week for one semester. No more than three semester hours may be counted toward a degree in computer science. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Mathematics 408C, 408K, or 408N; and consent of the undergraduate adviser.","upper":true},{"key":"C S 371D","name":"Distributed Computing","description":"Investigation of models, principles, and fundamental protocols, including event ordering and global predicate detection, atomic commit, state-machine replication, rollback recovery, primary backup, consensus for synchronous and asynchronous systems, and byzantine fault-tolerance. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Computer Science 439, 439H, 352, 352H, 372, or 372H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 371M","name":"Mobile Computing","description":"Overview of mobile computing. Emphasis on mobile application development. Use of mobile capabilities: sensors, location, telephony, and multimedia. Three lecture hours a week for one semester Computer Science 371M and 378 (Topic: Mobile Computing) may not both be counted. Offered on the letter-grade basis only. Prerequisite: The following coursework with a grade of at least C- in each:  Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Mathematics 408C, 408K, or 408N; and credit with a grade of at least C- or registration for Computer Science 439 or 439H.","upper":true},{"key":"C S 371P","name":"Object-Oriented Programming","description":"Programming using class derivation, inheritance, and dynamic polymorphism. Application of a simple object-oriented design methodology to several software development problems. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 371R","name":"Information Retrieval and Web Search","description":"Introduction to traditional and recent methodologies for indexing, processing, querying, and classifying unstructured and semi-structured textual data, including hypertext and World Wide Web documents. Three lecture hours a week for one semester. Computer Sciences 371R and 378 (Topic: Intelligent Information Retrieval and Web Search) may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 371S","name":"Object-Oriented Software Engineering","description":"Object-oriented formulations of software systems as executable specifications, object-oriented analysis, design of software architectures, translation of high-level specification systems. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 373","name":"Software Engineering","description":"Introduction to current knowledge, techniques, and theories in large software system design and development. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 373S","name":"Software Design","description":"Examination of reflection, UML, metamodels and constraints, 3-tiered architectures, model-driven engineering, UML-to-source-code mappings, classical and ad hoc refactorings, event-based programming, design patterns, object-oriented frameworks and plug-ins, architectural styles, layered designs, map-reduce parallel software architecture, case studies, and service-oriented computing. Three lecture hours a week for one semester Computer Science 373S and 378 (Topic: Software Design) may not both be counted. Offered on the letter-grade basis only. Prerequisite: Computer Science 373 with a grade of at least C-; and credit with a grade of at least C- or registration for Computer Science 347 or 375.","upper":true},{"key":"C S 375","name":"Compilers","description":"An examination of formal description of languages, lexical analysis, syntax analysis, syntax-directed translation, run-time system management, code generation, code optimization, compiler-building tools. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; and Mathematics 408C, 408K, or 408N; Computer Science 439, 439H, 352, 352H, 372, or 372H is recommended.","upper":true},{"key":"C S 376","name":"Computer Vision","description":"Explores computer vision, a discipline that develops methods that enable machines to interpret or analyze images and videos. Includes the study of image formation, feature detection, segmentation, multiple-view geometry, recognition and learning, and motion and tracking. Three lecture hours a week for one semester. Computer Science 376 and 378 (Topic: Computer Vision) may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 307, 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Mathematics 340L or Statistics and Scientific Computation 329C; and Mathematics 362K or Statistics and Scientific Computation 321.","upper":true},{"key":"C S 377","name":"Principles and Applications of Parallel Programming","description":"Models of parallel computation, fundamental concepts for representation of parallel computation structures, study of representative parallel programming systems, and programming of parallel algorithms and computations. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Computer Science 439, 439H, 352, 352H, 372, or 372H; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"C S 379H","name":"Computer Science Honors Thesis","description":"Directed reading, research, and/or projects in areas of computer science, under supervision of a faculty member, leading to an honors thesis. The thesis must be approved by a committee of three readers. The equivalent of three lecture hours a week for one semester, by arrangement with a faculty member. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 311, 311H, 313H, or 313K; Computer Science 314, 314H, 315, or 315H; Computer Science 310, 310H, 429, or 429H; Mathematics 408C, 408K, or 408N; nine additional semester hours of upper-division coursework in computer science; and consent of the student's research supervisor and the departmental honors adviser.","upper":true}]