[{"key":"SDS 302","name":"Data Analysis for the Health Sciences","description":"Basic probability and data analysis for the sciences. Subjects include randomness, sampling, distributions, probability models, inference, regression, and nonlinear curve fitting. The equivalent of four lecture hours a week. Statistics and Data Sciences 302 and Statistics and Scientific Computation 302 may not both be counted; may not be counted by students with credit for Educational Pyschology 371, Mathematics 316, Statistics and Data Sciences 303, 304, 305, 306, Statistics and Scientific Computation 303, 304, 305, 306. Prerequisite: An appropriate score on the College of Natural Sciences mathematics placement examination.","upper":false},{"key":"SDS 303","name":"Statistics in Experimental Research","description":"An introduction to the fundamental concepts and methods of statistics, with emphasis on applications in experimental science. Includes exploratory data analysis, correlation and regression, descriptive statistics, sampling distributions, confidence intervals, and hypothesis testing. Three lecture hours a week for one semester. Only one of the following may be counted: Mathematics 316, Statistics and Data Sciences 303, 304, 305, 306, Statistics and Scientific Computation 303, 304, 305, 306. Prerequisite: An appropriate score on the College of Natural Sciences mathematics placement examination.","upper":false},{"key":"SDS 304","name":"Statistics in Health Care","description":"An introduction to the fundamental concepts and methods of statistics, with emphasis on applications in the health sciences. Includes exploratory data analysis, correlation and regression, descriptive statistics, sampling distributions, confidence intervals, and hypothesis testing. Three lecture hours a week for one semester. Only one of the following may be counted: Mathematics 316, Statistics and Data Sciences 303, 304, 305, 306, Statistics and Scientific Computation 303, 304, 305, 306. Prerequisite: An appropriate score on the College of Natural Sciences mathematics placement examination.","upper":false},{"key":"SDS 305","name":"Statistics in Policy Design","description":"An introduction to the fundamental concepts and methods of statistics, with emphasis on applications in policy evaluation and design. Includes exploratory data analysis, correlation and regression, descriptive statistics, sampling distributions, confidence intervals, and hypothesis testing. Three lecture hours a week for one semester. Only one of the following may be counted: Mathematics 316, Statistics and Data Sciences 303, 304, 305, 306, Statistics and Scientific Computation 303, 304, 305, 306. Prerequisite: An appropriate score on the College of Natural Sciences mathematics placement examination.","upper":false},{"key":"SDS 306","name":"Statistics in Market Analysis","description":"An introduction to the fundamental concepts and methods of statistics, with emphasis on applications in the analysis of personal and group behaviors. Includes exploratory data analysis, correlation and regression, descriptive statistics, sampling distributions, confidence intervals, and hypothesis testing. Three lecture hours a week for one semester. Only one of the following may be counted: Mathematics 316, Statistics and Data Sciences 303, 304, 305, 306, Statistics and Scientific Computation 303, 304, 305, 306. Prerequisite: An appropriate score on the College of Natural Sciences mathematics placement examination.","upper":false},{"key":"SDS 318","name":"Introduction to Statistical and Scientific Computation","description":"An introduction to quantitative analysis using fundamental concepts in statistics and scientific computation. Includes probability, distributions, sampling, interpolation, iteration, recursion, and visualization. Three lecture hours and one laboratory hour a week for one semester. Statistics and Data Sciences 318 and Statistics and Scientific Computation 318 may not both be counted.","upper":false},{"key":"SDS 321","name":"Introduction to Probability and Statistics","description":"Covers fundamentals of probability, combinatorics, discrete and continuous random variables, jointly distributed random variables, and limit theorems. Using probability to introduce fundamentals of statistics, including Bayesian and classical inference. The equivalent of four lectures hours a week. Only one of the following may be counted: Mathematics 362K, Statistics and Data Sciences 321, Statistics and Scientific Computation 321. Prerequisite: The following with a grade of at least C-: Computer Science 311, 313K, Mathematics 325K, or the equivalent; and Mathematics 408C, 408K, or 408N.","upper":true},{"key":"SDS 323","name":"Statistical Learning and Inference","description":"An introduction to statistical influence, broadly construed as the process of drawing conclusions from data, and to quantifying uncertainty about said conclusions. Covers the major schools of thought that influence modern scientific practice, including classical frequentist methods, machine learning, and Bayesian inference. Three lecture hours a week for one semester. Statistics and Data Sciences 323 and Statistics and Scientific Computation 323 may not both be counted. Prerequisite: Statistics and Data Sciences 321 (or Statistical and Scientific Computation 321) or the equivalent.","upper":true},{"key":"SDS 325H","name":"Honors Statistics","description":"An introduction to the fundamental theories, concepts, and methods of statistics. Emphasizes probability models, exploratory data analysis, sampling distributions, confidence intervals, hypothesis testing, correlation and regression, and the use of statistical software. Three lecture hours a week for one semester. Statistics and Data Sciences 325H and Statistics and Scientific Computation 325H may not both be counted. Prerequisite: Admission to the Dean's Scholars Honors Program in the College of Natural Sciences or consent of instructor.","upper":true},{"key":"SDS 328M","name":"Biostatistics","description":"Introduction to methods of statistical analysis of biological data. Includes data analysis, basics of experimental design, statistical inference, interval estimation, and hypothesis testing. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Biology 318M, 328M, Statistics and Data Sciences 328M, Statistics and Scientific Computation 318M, 328M. Prerequisite: An appropriate score on the College of Natural Sciences mathematics placement examination, and six semester hours of coursework in biology.","upper":true},{"key":"SDS 329C","name":"Practical Linear Algebra I","description":"Matrix representations and properties of matrices; linear equations, eigenvalue problems and their physical interpretation; and linear least squares and elementary numerical analysis. Emphasis on physical interpretation, practical numerical algorithms, and proofs of fundamental principles. Three lecture hours a week for one semester. Statistics and Data Sciences 329C and Statistics and Scientific Computation 329C may not both be counted. Prerequisite: Credit or registration for Mathematics 408C, 408K, or 408N.","upper":true},{"key":"SDS 329D","name":"Practical Linear Algebra II","description":"Iterative solutions to linear equations and eigenvalue problems; properties of symmetric and nonsymmetric matrices, exploitation of parsity and diagonal dominance; introduction to multivariate nonlinear equations; numerical analysis; and selected applications and topics in the physical sciences. Three lecture hours a week for one semester. Statistics and Data Sciences 329D and Statistics and Scientific Computation 329D may not both be counted. Prerequisite: Mathematics 340L, 341, or Statistics and Data Sciences 329C (or Statistics and Scientific Computation 329C).","upper":true},{"key":"SDS 332","name":"Statistical Models for the Health and Behavioral Sciences","description":"Follow up to introductory statistics with an overview of advanced statistical modeling topic. Subjects may include multiple regression, ANOVA, logistic regression, random and mixed effects models including longitudinal data, time series analysis, survival analysis, factor analysis, and SEM. Use of statistical software is emphasized. Three lecture hours a week for one semester. Prerequisite: Statistics and Data Sciences 302 (or Statistics and Scientific Computation 302), 304 (or Statistics and Scientific Computation 304), 306 (or Statistics and Scientific Computation 306), 328M (or Statistics and Scientific Computation 328M), or the equivalent.","upper":true},{"key":"SDS 335","name":"Scientific and Technical Computing","description":"A comprehensive introduction to computing techniques and methods applicable to many scientific disciplines and technical applications. Covers computer hardware and operating systems, systems software and tools, code development, numerical methods and math libraries, and basic visualization and data analysis tools. Three lecture hours a week for one semester. Statistics and Data Sciences 335 and Statistics and Scientific Computation 335 may not both be counted. Prerequisite: Mathematics 408D or 408M, and prior programming experience.","upper":true},{"key":"SDS 339","name":"Applied Computational Science","description":"Concentrated study in a specific area or areas of application, with an emphasis on modeling and visualization. Areas may include computational biology, computational chemistry, computational applied mathematics, computational economics, computational physics, or computational geology. Three lecture hours a week for one semester. Statistics and Data Sciences 339 and Statistics and Scientific Computation 339 may not both be counted unless topics vary. May be repeated for credit when the topics vary.","upper":true},{"key":"SDS 348","name":"Computational Biology and Bioinformatics","description":"Computational-based data sorting, data transformation, and data analysis; programming in Python and R. Three lecture hours and one laboratory hour per week. Prerequisite: Statistics and Data Sciences 328M (or Statistics and Scientific Computation 328M) with a grade of at least C-.","upper":true},{"key":"SDS 150K","name":"Data Analysis Applications","description":"Introduction to the use of statistical mathematical applications for data analysis. Two lecture hours a week for eight weeks. Statistics and Data Sciences 150K and Statistics and Scientific Computation 150K may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Offered on the pass/fail basis only. Prerequisite: Varies with the topic.","upper":true},{"key":"SDS 352","name":"Statistical Methods","description":"Study of simple and multiple regression, fundamentals of experimental design, and analysis of variance methods. May include logistic regression, Poisson regression, resampling methods, introduction to Bayesian methods, and probability models. Includes substantial use of statistical software. Three lecture hours and one laboratory hour a week for one semester. Statistics and Data Sciences 352 and Statistics and Scientific Computation 352 may not both be counted. Prerequisite: One of the following: Mathematics 316, Statistics and Data Sciences 303 (or Statistics and Scientific Computation 303), 304 (or Statistics and Scientific Computation 304), 305 (or Statistics and Scientific Computation 305), or 306 (or Statistics and Scientific Computation 306).","upper":true},{"key":"SDS 353","name":"Advanced Multivariate Modeling","description":"Advanced topics in statistical modeling, including models for categorical and count data; spatial and time-series data; and survival, hazard, and hierarchical models. Extensive use of statistical software to build on knowledge of introductory probability and statistics, as well as multiple regression. Three lecture hours a week for one semester Statistics and Data Sciences 353 and Statistics and Scientific Computation 353 may not both be counted. Prerequisite: Mathematics 408D or 408M; and Statistics and Data Sciences 325H (or Statistics and Scientific Computation 325H) or 352 (Statistics and Scientific Computation 352).","upper":true},{"key":"SDS 358","name":"Special Topics in Statistics","description":"Three lecture hours a week for one semester. Statistics and Data Sciences 358 and Statistics and Scientific Computation 358 may not both be counted unless topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites may vary with the topic.","upper":true},{"key":"SDS 367S","name":"Simulation Modeling","description":"Basic concepts of discrete-event simulation. Statistical input and output analysis; application of simulation software; modeling of systems under uncertainty. Three lecture hours a week for one semester. Only one of the following may be counted: Statistics and Data Sciences 367S, Statistics and Scientific Computation 358 (Topic: Simulation Modeling), 367S. Prerequisite: Upper-division standing and the following with a grade of at least C-: Mathematics 408C, 408K, or 408N; and Statistics and Data Sciences 321 (or Scientific Computation 321) or an equivalent introductory statistics course.","upper":true},{"key":"SDS 374C","name":"Parallel Computing for Science and Engineering","description":"Study of parallel computing principles, architectures, and technologies; and parallel application development, performance, and scalability. Designed to help prepare students to formulate and develop parallel algorithms to implement effective applications for parallel computing systems. Three lecture hours a week for one semester. Statistics and Data Sciences 374C and Statistics and Scientific Computation 374C may not both be counted. Prerequisite: Mathematics 408D or 408M, 340L, and prior programming experience using C or Fortran on Linux or Unix systems.","upper":true},{"key":"SDS 374D","name":"Distributed and Grid Computing for Science and Engineering","description":"Distributed and grid computing principles and technologies. Covers common modes of grid computing for scientific applications, development of grid-enabled applications, and future trends in grid computing. Three lecture hours a week for one semester. Statistics and Data Sciences 374D and Statistics and Scientific Computation 374D may not both be counted. Prerequisite: Mathematics 408D or 408M, 340L, and prior programming experience using C or Fortran on Linux or Unix systems.","upper":true},{"key":"SDS 374E","name":"Visualization and Data Analysis for Science and Engineering","description":"Scientific visualization principles, practices, and technologies, including remote and collaborative visualization. Introduces statistical analysis, data mining, and feature detection. Three lecture hours a week for one semester. Statistics and Data Sciences 374E and Statistics and Scientific Computation 374E may not both be counted. Prerequisite: Mathematics 408D or 408M, 340, and prior programming experience using C or Fortran on Linux or Unix systems.","upper":true},{"key":"SDS 375","name":"Special Topics in Scientific Computation","description":"Three lecture hours a week for one semester. Statistics and Data Sciences 375 and Statistics and Scientific Computation 375 may not both be counted unless topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites may vary with the topic.","upper":true},{"key":"SDS 378","name":"Introduction to Mathematical Statistics","description":"Same as Mathematics 378K. Sampling distributions of statistics, estimation of parameters (confidence intervals, method of moments, maximum likelihood, comparison of estimators using mean square error and efficiency, sufficient statistics), hypothesis tests (p-values, power, likelihood ratio tests), and other topics. Three lecture hours a week for one semester. Only one the following may be counted: Mathematics 378K, Statistics and Data Sciences 378, Statistics and Scientific Computation 378. Prerequisite: Mathematics 362K with a grade of at least C-.","upper":true}]