[{"key":"NEU 330","name":"Neural Systems I","description":"Introduction to the nervous system with an emphasis on brain organization, neuron physiology, perceptual systems, and motor systems. Intended for neuroscience majors and those considering neuroscience as a major. Three lecture hours a week for one semester. Biology 337 (Topic: Neural Systems I) and Neuroscience 330 may not both be counted.","upper":true},{"key":"NEU 335","name":"Neural Systems II","description":"Introduction to the nervous system with an emphasis on neural development and on the neural mechanisms of memory, emotions, and other higher cognitive functions. Intended for neuroscience majors and those considering neuroscience as a major. Three lecture hours a week for one semester. Only one of the following may be counted: Biology 335, 337 (Topic: Neural Systems II), Neuroscience 335. Prerequisite: One of the following with a grade of at least B-: Neuroscience 330 or 365R (or Biology 365R).","upper":true},{"key":"NEU 365D","name":"Principles of Drug Action","description":"Introduction to the basic principles of pharmacology; including how drugs get into the body, exert their actions, and are metabolized and excreted. Three lecture hours a week for one semester. Biology 365D (Topic: Principles of Drug Action) and Neuroscience 365D may not both be counted. Prerequisite: One of the following with a grade of at least C-: Neuroscience 330 or 365R (or Biology 365R).","upper":true},{"key":"NEU 365L","name":"Neurobiology Laboratory","description":"An introduction to physiological, morphological, and molecular techniques used for analysis of the nervous system. Experiments and computer simulations illustrate basics of information processing by the nervous system. Four laboratory hours and one discussion hour a week for one semester. Biology 365L (Topic: Neurobiology Laboratory) and Neuroscience 365L may not both be counted. Prerequisite: The following with a grade of at least C-: Biology 206L or 226L, and Neuroscience 330 or 365R (or Biology 365R).","upper":true},{"key":"NEU 365R","name":"Vertebrate Neurobiology","description":"Introduction to the nervous system and other excitable tissues. Subjects may include membrane potentials, ion channels, synaptic transmission, learning and memory, skeletal and cardiac muscle, and how systems of neurons lead to sensation and motor output. Human diseases are used to illustrate perturbation of normal function. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Biology 309D, 365R, Neuroscience 365R. Only one of the following may be counted: Biology 365R, 371M, Neuroscience 365R. Biology 365R and Neuroscience 365R may not both be counted by students with credit for Biology 416K with a grade of at least C-. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true},{"key":"NEU 365T","name":"Neurobiology of Disease","description":"The neurobiological basis of disorders of the brain, with the main focus on mental illness. Emphasizes the neural circuitries and neurochemical events that underlie specific mental processes and behaviors. Three lecture hours a week for one semester. Biology 365T and Neuroscience 365T may not both be counted. Prerequisite: Neuroscience 330 or 365R (or Biology 365R) with a grade of at least C-.","upper":true},{"key":"NEU 365W","name":"Neurobiology of Addiction","description":"Study of the neurobiology of neurotransmitters, and the influence of alcohol and drugs of abuse on neurotransmitters. Three lecture hours a week for one semester. Biology 365W and Neuroscience 365W may not both be counted. Prerequisite: Neuroscience 330 or 365R (or Biology 365R) with a grade of at least C-.","upper":true},{"key":"NEU 366C","name":"Ion Channels and the Molecular Physiology of Neuronal Signaling","description":"Explores the role of molecular conformational changes in higher-level neuronal function and sensory transduction, including the generation and regulation of diverse types of neuronal signaling characteristics. Emphasizes a quantitative approach and the use of models to study function. Three lecture hours a week for one semester. Only one of the following may be counted:  Biology 337 (Topic: Ion Channels and the Molecular Physiology of Neuronal Signaling), Biology 366C, Neuroscience 366C. Prerequisite: The following courses with a grade of at least C-: Mathematics 408D, 408L, or 408S; and Physics 303L, 316, or 317L.","upper":true},{"key":"NEU 366D","name":"Synaptic Physiology and Plasticity","description":"Detailed study of the physiology of synaptic transmission in the mammalian central nervous system. Covers dendritic integration and various forms and mechanisms of synaptic plasticity. Three lecture hours a week for one semester. Only one of the following may be counted: Biology 337 (Topic: Synaptic Physiology and Plasticity in the Central  Nervous System), 366D, Neuroscience 366D. Prerequisite: The following courses with a grade of at least C- in each: Mathematics 408D, 408L, or 408S; Neuroscience 330, 365R (or Biology 365R), or 366C; and Physics 303L, 316, or 317L.","upper":true},{"key":"NEU 366E","name":"Visual Neuroscience","description":"Physiology of the eye, the retina, and the visual pathways; prospects for nutritional prevention of blinding eye diseases; functional and ecological adaptations of primate vision. Three lecture hours a week for one semester. Only one of the following may be counted: Biology 337 (Topic: Visual Neuroscience), 366E, Neuroscience 366E. Prerequisite: One of the following with a grade of at least C-: Biomedical Engineering 365R, Neuroscience 330, or 365R (or Biology 365R).","upper":true},{"key":"NEU 466G","name":"Functional and Synaptic Neuroanatomy","description":"Neuroanatomy and functional connectivity as a basis for brain function and behavior examined from gross structure, cytology, and nanoscale synaptic connectivity in the somatosensory, motor, visual, auditory, olfactory, taste, limbic, vestibular, hypothalamus, and other symptoms. Examination of the synaptic basis of learning and memory, fear, sleep, stress, and synaptic changes during development, aging, mental retardation, and neurological diseases. Laboratory projects involve three-dimensional reconstructions from serial section electron microscopy. Three lecture hours and one and one half laboratory hours a week for one semester. Only one of the following may be counted: Biology 337 (Topic: Neurobiology of Synaptic Circuits), 337 (Topic: Human Neuroanatomy), 366F, or Neuroscience 466G. Prerequisite: Neuroscience 330 or 365R (or Biology 365R) with a grade of at least B-.","upper":true},{"key":"NEU 366L","name":"Neuroimaging Laboratory","description":"Basic principles of image formation and techniques of fluorescent imaging and confocal laser-scanning microscopy. Includes image processing and analysis to extract quantitative information from digital images. Survey of imaging techniques, including electron microscopy and functional MRI. One lecture hour and four laboratory hours a week for one semester. Only one of the following may be counted:  Biology 337 (Topic: Microscopy and Fluorescence Imaging Laboratory), 366L, Neuroscience 366L. Prerequisite: Neuroscience 330 or 365R (or Biology 365R) with a grade of at least B.","upper":true},{"key":"NEU 366M","name":"Quantitative Methods In Neuroscience I","description":"Overview of the basic mathematical and computational tools central to the analysis of neural systems in a laboratory setting. Subjects include linear algebra, differential equations, filtering, correlation, probability, and inference, with an emphasis on quantitative methodology and applications to neuroscience. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Mathematics 408D or 408M with a grade of at least C-, and a grade of at least C- or registration in Neuroscience 330 or 365R (or Biology 365R).","upper":true},{"key":"NEU 366N","name":"Quantitative Methods in Neuroscience II","description":"Continuation of Neuroscience 366M. Introduction to basic mathematical and computational tools for the analysis of neural systems. Subjects include computational and quantitative methods, with an emphasis on their applications to neuroscience. Three lecture hours and one laboratory hour a week for one semester. Biology 366N and Neuroscience 366N may not both be counted. Prerequisite: The following courses with a grade of at least C-: Mathematics 408D or 408M; Neuroscience 330 or 365R (or Biology 365R); and Neuroscience 366M.","upper":true},{"key":"NEU 366P","name":"Laboratory in Psychophysics","description":"Studies the principles of experimental design, execution, and interpretation by having students measure their own perceptual and behavioral responses to visual and auditory tests. Includes data analysis, statistical significance, and interpretation. Five laboratory hours a week for one semester. Biology 366P and Neuroscience 366P may not both be counted. Prerequisite: Neuroscience 330 or 365R (or Biology 365R) with a grade of at least C-.","upper":true},{"key":"NEU 366S","name":"Neuromolecular Genetics and Disease Laboratory","description":"Explores techniques used to study the molecular genetic basis for nervous system function and disease with a powerful invertebrate model system. Subjects will range from studying the conserved molecular basis for our senses and male/female-specific behaviors, to exploring how mutations of conserved neural genes cause neurological disorders, such as Parkinson's disease and Alzheimer's disease. Six laboratory hours a week for one semester Biology 366S and Neuroscience 366S may not both be counted. Prerequisite: The following courses with grades of at least C-: Biology 206L; 311C and 311D or 315H and 325H; and Neuroscience 330 or 365R (or Biology 365R).","upper":true},{"key":"NEU 367F","name":"Foundations of Human Neuroimaging","description":"Survey of methods for neuroimaging research. Describes the physics of MRI image acquisition, the physiology of neural responses, and the design and analysis of MRI studies. Three lecture hours a week for one semester. Only one of the following may be counted: Biology 337 (Topic: Foundations of Human Neuroimaging), 367F, Neuroscience 367F. Prerequisite: Neuroscience 330 or 365R (or Biology 365R) with a grade of at least C-.","upper":true},{"key":"NEU 367V","name":"Evolutionary Neurobiology","description":"Examination of the nervous system in an evolutionary context. Three lecture hours a week for one semester. Only one of the following may be counted: Biology 337 (Topic: Evolutionary Neurobiology), 367V, Neuroscience 367V. Prerequisite: Biology 325 or 325H with a grade of at least C-.","upper":true}]