[{"key":"C C 301","name":"Introduction to Ancient Greece","description":"Greatness of Greece as reflected in Greek history, literature, philosophy, art, religion, and politics. No knowledge of Greek is required. Three class hours a week for one semester. Classical Civilization 301 and 342 may not both be counted.","upper":false},{"key":"C C 302","name":"Introduction to Ancient Rome","description":"Survey of the highlights and the influence of Roman civilization. No knowledge of Latin is required. Three class hours a week for one semester. Classical Civilization 302 and 347 may not both be counted.","upper":false},{"key":"C C 303","name":"Introduction to Classical Mythology","description":"Survey of major Greek and Roman myths and their influence on literature, art, and music. Three class hours a week for one semester. Classical Civilization 303 and 352 may not both be counted.","upper":false},{"key":"C C 304C","name":"Topics in the Ancient World","description":"An introductory survey of the highlights of Greek and Roman civilization and early Christianity. No knowledge of Greek or Latin is required. Three lecture hours a week for one semester. Classical Civilization 304C and 348 may not both be counted unless the topics vary. May be repeated for credit when the topics vary.","upper":false},{"key":"C C 305","name":"Topics in Roman Civilization","description":"A survey of the social life and customs of ancient Rome and Pompeii. No knowledge of Latin is required. Three class hours a week for one semester. Classical Civilization 305 and 335 may not both be counted unless the topics vary. May be repeated for credit when the topics vary.","upper":false},{"key":"C C 306","name":"Introduction to the Latin and Greek Element in English","description":"The systematic study of the Latin and Greek elements in the English vocabulary with a view to increasing the student's facility and authority in English. No knowledge of Greek or Latin is required. Three class hours a week for one semester. Classical Civilization 306 and 336 may not both be counted.","upper":false},{"key":"C C 306M","name":"Introduction to Medical and Scientific Terminology","description":"A systematic study of medical and scientific terminology based on Greek and Latin roots. No knowledge of Greek or Latin is required. Three lecture hours a week for one semester. Classical Civilization 306M and 336M may not both be counted.","upper":false},{"key":"C C 307C","name":"Introduction to Greek Archaeology","description":"A survey of the artifacts, monuments, and sites of ancient Greece, and their value for documenting Greek religious, social, and cultural history. No knowledge of Greek is required. Three lecture hours a week for one semester. Classical Civilization 307C and 307K (Topic 1: Greek Archaeology Survey) may not both be counted.","upper":false},{"key":"C C 307D","name":"Introduction to Roman Archaeology","description":"A survey of the artifacts, monuments, and sites of ancient Rome, and their value for documenting Roman religious, social, and cultural history. No knowledge of Latin is required. Three lecture hours a week for one semester.","upper":false},{"key":"C C 307K","name":"Topics in Archaeology","description":"Survey of archaeological discoveries about ancient Greece or Rome in their historical and cultural context; emphasis on the major sites and monuments of architecture and art. No knowledge of Greek or Latin is required. Three class hours a week for one semester.   Classical Civilization 307K and 340 may not both be counted unless the topics vary. May be repeated for credit when the topics vary.","upper":false},{"key":"C C 317","name":"Classical Archaeology: Methods and Approaches","description":"An overview of the history of classical archaeology and its methods and approaches. Focuses on case studies of major sites and their excavation and interpretation. No knowledge of Greek or Latin is required. Three lecture hours a week for one semester. Classical Civilization 302K and 317 may not both be counted. Prerequisite: One of the following courses: Ancient History and Classical Civilization 319 (Topic 1: The Ancient Mediterranean World), Art History 302, Classical Civilization 301, 302, 307C, 307D, 318, 319D, History 319D, Religious Studies 318.","upper":false},{"key":"C C 318","name":"The Rise of Christianity","description":"Same as Religious Studies 318. Introduction to the origins and development of Christianity. Three lecture hours a week for one semester.","upper":false},{"key":"C C 319D","name":"The Ancient Mediterranean World","description":"Same as Ancient History and Classical Civilization 319 (Topic 1: The Ancient Mediterranean World) and History 319D. Survey of the ancient Mediterranean from ca. 3000 BC to AD 476. Focus on the development of ideas and institutions in the Greek and Roman worlds and on the active cultural exchange among the diverse civilizations of the broader region that shaped Greek and Roman history and cultural identity. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"C C 322","name":"Classical Literature in Translation","description":"Survey of Greek and Latin philosophical, literary, and historical classics, in translation. No knowledge of Greek or Latin is required. Three class hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"C C 327","name":"Parageography","description":"Survey of the classical and medieval roots of speculative literature, especially those fantasies that involve the creation and presentation of imaginary places, lands, and worlds. No knowledge of Greek or Latin is required. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"C C 330K","name":"Ancient Philosophy after Aristotle","description":"Same as Philosophy 330K. Epicureans, Stoics, Skeptics, Plotinus and the Neoplatonist tradition. No knowledge of Greek is required. Three class hours a week for one semester. Prerequisite: Six semester hours of coursework in philosophy.","upper":true},{"key":"C C 336M","name":"Medical and Scientific Terminology","description":"A systematic study of medical and scientific terminology based on Greek and Latin roots. No knowledge of Greek or Latin is required. Three lecture hours a week for one semester. Classical Civilization 306M and 336M may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"C C 340","name":"Advanced Topics in Classical Archaeology","description":"Detailed study of topics such as architecture, sculpture, or topography of sites. No knowledge of Greek or Latin is required. Three lecture hours a week for one semester. Classical Civilization 307K and 340 may not both be counted unless the topics vary. Classical Civilization 340 and 375 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"C C 348","name":"Topics in Ancient Civilization","description":"The development and progress of ancient civilization, including history, philosophy, literature, and culture. No knowledge of Greek or Latin is required. Three lecture hours a week for one semester; additional hours may be required for some topics. Classical Civilization 304C and 348 may not both be counted unless the topics vary. Classical Civilization 348 and 375 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"C C 351D","name":"The Hellenistic Age: Alexander to Actium","description":"Same as Ancient History and Classical Civilization 325 (Topic 6: The Hellenistic Age: Alexander to Actium) and History 351D. History of Asia, Egypt, and the Mediterranean world from Alexander's expedition to Asia to Rome's defeat of the last of the Hellenistic monarchs at Actium (ca. 334 to 31 BC). Two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"C C 352","name":"Classical Mythology","description":"Survey of major Greek and Roman myths and their influence on literature, art, and music. Three lecture hours a week for one semester. Classical Civilization 303 and 352 may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"C C 354C","name":"History of Greece to the End of the Peloponnesian War","description":"Same as Ancient History and Classical Civilization 325 (Topic 4: History of Greece to the End of the Peloponnesian War) and History 354C. Survey of Greek history from the emergence of the city-states through the end of the Peloponnesian War (ca. 700 to 404 BC). Two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"C C 354D","name":"History of Greece to 146 BC","description":"Same as Ancient History and Classical Civilization 325 (Topic 5: History of Greece to 146 BC) and History 354D. Survey of Greek history from the end of the Peloponnesian War to the defeat of Greece by Rome (404 to 146 BC). Two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"C C 362","name":"Conference Course in Classical Archaeology","description":"Advanced archaeological instruction and research in classical archaeology. No knowledge of Greek is required. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"C C 363","name":"Conference Course in Classical Civilization","description":"Supervised work in various specialized aspects of classical civilization. No knowledge of Greek or Latin is required. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"C C 375","name":"Seminar in Classical Studies","description":"Restricted to students in the Department of Classics. Study of selected topics in classical studies. Some knowledge of Greek or Latin is expected. Three lecture hours a week for one semester. Classical Civilization 340 and 375 may not both be counted unless the topics vary. Classical Civilization 348 and 375 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"C C 679H","name":"Honors Tutorial Course","description":"Supervised conference course for honors candidates in classics. Three conference hours a week for two semesters. Prerequisite: For 679HA, upper-division standing and admission to the Classics Honors Program; for 679HB, Classical Civilization 679HA.","upper":true}]