[{"key":"AAS 301","name":"Introduction to Asian American Studies","description":"Same as American Studies 315 (Topic 1). Introduces the interdisciplinary study of Asian immigrants and Asian Americans in the United States. Explores key concepts, including immigration history, identity and community formation, cultural representation, and the intersections of race, class, gender, and sexuality. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 315 (Topic: Introduction to Asian American Studies), American Studies 315 (Topic 1),  Asian American Studies 301, Sociology 308 (Topic: Introduction to Asian American Studies).","upper":false},{"key":"AAS 310","name":"Introductory Topics in Asian American Studies","description":"An introduction to Asian American studies through a variety of disciplines. Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history; these are identified in the Course Schedule. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"AAS 312","name":"Introduction to Asian American History","description":"Same as History 317L (Topic 4: Introduction to Asian American History). Introduces students to the national and transnational histories of Asian Americans in the United States. Explores a wide range of themes related to the Asian American experience. Asian American Studies 312 and History 317L (Topic 4) may not both be counted. Partially fulfills legislative requirement for American history.","upper":false},{"key":"AAS 314","name":"Asian American Literature and Culture","description":"Same as English 314V (Topic 2: Asian American Literature and Culture). Explores how authors and artists over the course of the past century have imagined what it means to be Asian American. Covers a diverse range of Asian immigrant histories and the formation of Asian American identities according to ethnicity, gender, sexuality, class, and citizenship. Three lecture hours a week for one semester. Prerequisite: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"AAS 318Q","name":"Supervised Research","description":"For Asian American studies majors only. Supervised, student-derived research in Asian American studies. Individual instruction. May be repeated for credit when the research projects vary. Prerequisite: Rhetoric and Writing 306 and consent of the director of the Center for Asian American Studies.","upper":false},{"key":"AAS 335","name":"Topics in Asian American Studies","description":"Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history; these are identified in the Course Schedule. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"AAS 358Q","name":"Supervised Research","description":"For Asian American studies majors only. Supervised, student-derived research in Asian American studies. Individual instruction. May be repeated for credit when the research projects vary. Prerequisite: Upper-division standing, Rhetoric and Writing 306, and consent of the director of the Center for Asian American Studies.","upper":true},{"key":"AAS 378","name":"Community Internship","description":"Supervised internship in a community, civic, or government organization or program that facilitates the economic, political, and social development of the Asian American community. The equivalent of three lecture hours a week for one semester, with additional field hours to be arranged.  May be repeated for credit. Offered on the letter-grade basis only. Prerequisite: Upper-division standing and consent of the director of the Center for Asian American Studies.","upper":true},{"key":"AAS 379","name":"Conference Course in Asian American Studies","description":"Supervised individual study of selected problems in Asian American studies. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of the director of the Center for Asian American Studies.","upper":true},{"key":"AAS 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, followed by a semester of research and writing to produce a substantial paper on a specific topic in Asian American studies. Conference course for two semesters. Prerequisite: For 679HA, upper-division standing and admission to the Asian American Studies Honors Program; for 679HB, Asian American Studies 679HA.","upper":true}]