[{"key":"HIS 301F","name":"The Premodern World","description":"Survey of world history from human origins to the sixteenth century. Three lecture hours or two lecture hours and one discussion hour a week for one semester. History 301F and 306N (Topic: Premodern World) may not both be counted.","upper":false},{"key":"HIS 301G","name":"Modern World","description":"Survey of world history from the sixteenth century to the present. Three lecture hours or two lecture hours and one discussion hour a week for one semester. History 301G and 306N (Topic: Modern World) may not both be counted.","upper":false},{"key":"HIS 302C","name":"Introduction to China","description":"Same as Asian Studies 302C. Introduction to Chinese civilization, past and present, including religion, literature, arts, philosophy, and history. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 302C, History 302C, 306N (Topic: Introduction to China).","upper":false},{"key":"HIS 304K (TCCN: HIST 2313)","name":"English Civilization before 1603","description":"Survey of English civilization from Roman times to the death of Queen Elizabeth I. Three lecture hours a week for one semester.","upper":false},{"key":"HIS 304L (TCCN: HIST 2314)","name":"English Civilization since 1603","description":"Survey of English history from the seventeenth century to the present. Three lecture hours a week for one semester.","upper":false},{"key":"HIS 305K","name":"History of East Asia to 1800","description":"Same as Asian Studies 301M (Topic 3: History of East Asia to 1800). A survey of the traditional history and culture of China, Japan, Korea, and Vietnam. Three lecture hours a week for one semester.","upper":false},{"key":"HIS 305L","name":"History of East Asia since 1800","description":"Same as Asian Studies 301M (Topic 4: History of East Asia since 1800). A survey of the modern history of China, Japan, Korea, and Vietnam. Three lecture hours a week for one semester.","upper":false},{"key":"HIS 306N","name":"Topics in History","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"HIS 307C","name":"Introduction to the History of India","description":"Same as Asian Studies 307C. Survey of the history of the Indian subcontinent from prehistoric times to the present. Three lecture hours a week for one semester.","upper":false},{"key":"HIS 309K (TCCN: HIST 2311)","name":"Western Civilization in Medieval Times","description":"Survey of medieval Europe from late antiquity to the fifteenth century. Three lecture hours a week for one semester.","upper":false},{"key":"HIS 309L (TCCN: HIST 2312)","name":"Western Civilization in Modern Times","description":"Survey of European civilization since the fifteenth century. Three lecture hours a week for one semester.","upper":false},{"key":"HIS 310","name":"Introduction to Modern Africa","description":"Same as African and African Diaspora Studies 310K. Introduction to modern Africa, with focus on colonial and postcolonial development in political organization, economics, sociolinguistics, and literature. Three lecture hours a week for one semester.","upper":false},{"key":"HIS 310K","name":"Latin American Civilization: The Colonial Experience","description":"Same as Latin American Studies 310 (Topic 1: Latin American Civilization: The Colonial Experience). A broad survey of the political, economic, social, and cultural aspects of the Latin American past, stressing both that area's achievements and its enduring problems. Three lecture hours a week for one semester. Only one of the following may be counted: History 310K, 346K, Latin American Studies 310 (Topic 1), 366 (Topic 2: Latin America before 1810).","upper":false},{"key":"HIS 310L","name":"Latin American Civilization: The National Experience","description":"Same as Latin American Studies 310 (Topic 2: Latin American Civilization: The National Experience). A broad survey of the political, social, and cultural aspects of the Latin American past. Three lecture hours a week for one semester. Only one of the following may be counted: History 310L, 346L, Latin American Studies 310 (Topic 2), 366 (Topic 3: Latin America since 1810).","upper":false},{"key":"HIS 310M","name":"Film and History in Latin America: Colonial Period","description":"Same as Latin American Studies 310 (Topic 5). Introduction to selected subjects in Latin American history and culture through film, readings, documentaries, class discussion, and lectures. Three lecture hours a week for one semester. Only one of the following may be counted: History 306N (Topic: Film History in Latin America: Colonial), 310M, Latin American Studies 310 (Topic: Film History in Latin America:  Colonial), Latin American Studies 310 (Topic 5).","upper":false},{"key":"HIS 310N","name":"Film and History in Latin America: Modern Period","description":"Same as Latin American Studies 310 (Topic 6). Introduction to selected subjects in Latin American history and culture through film, readings, documentaries, class discussion, and lectures. Three lecture hours a week for one semester. Only one of the following may be counted: History 306N (Topic: Film History in Latin America: Modern), 310N, Latin American Studies 310 (Topic: Film History in Latin America: Modern), 310 (Topic 6).","upper":false},{"key":"HIS 311K","name":"Introduction to Traditional Africa","description":"Same as African and African Diaspora Studies 310L. Introductory, interdisciplinary course on the peoples and cultures of Africa. Three lecture hours a week for one semester.","upper":false},{"key":"HIS 314K (TCCN: HIST 2328)","name":"History of Mexican Americans in the United States","description":"Same as Mexican American Studies 316. Examines the origin and growth of the Mexican American community in the United States. Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history.","upper":false},{"key":"HIS 315G","name":"Introduction to American Studies","description":"Same as American Studies 310. An interdisciplinary introduction to the historical exploration of American culture. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 310, History 306N (Topic 2: Introduction to American Studies), 315G. Partially fulfills legislative requirement for American history.","upper":false},{"key":"HIS 315L (TCCN: HIST 1302)","name":"The United States since 1865","description":"Survey of United States history since the Civil War. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Partially fulfills legislative requirement for American history.","upper":false},{"key":"HIS 317L (TCCN: HIST 2381)","name":"Topics in United States History","description":"Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history. May be repeated for credit when the topics vary.","upper":false},{"key":"HIS 317N","name":"Topics in History","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"HIS 318Q","name":"Supervised Research","description":"Individual instruction.","upper":false},{"key":"HIS 319D","name":"The Ancient Mediterranean World","description":"Same as Ancient History and Classical Civilization 319 (Topic 1: The Ancient Mediterranean World) and Classical Civilization 319D. Survey of the ancient Mediterranean from ca. 3000 BC to AD 476. Focus on the development of ideas and institutions in the Greek and Roman worlds and on the active cultural exchange among the diverse civilizations of the broader region that shaped Greek and Roman history and cultural identity. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"HIS 320L","name":"Texas until 1845","description":"Same as Mexican American Studies 320L. A study of Texas from before the European discovery through the exploration and mission periods to status as a Mexican colony and an independent republic. Three lecture hours a week for one semester. Only one of the following may be counted: History 320L, Mexican American Studies 320L, 374 (Topic: Texas until 1845). Three semester hours of Texas history may be substituted for half of the legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 321","name":"The History of Rome: The Empire","description":"Same as Ancient History and Classical Civilization 325 (Topic 2: The History of Rome: The Empire). A survey of the Roman world from Augustus to Constantine the Great. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 321G","name":"Rome and Jerusalem","description":"Same as Ancient History and Classical Civilization 325 (Topic 3: Rome and Jerusalem), Jewish Studies 365 (Topic 7: Rome and Jerusalem), Middle Eastern Studies 342 (Topic 21: Rome and Jerusalem), and Religious Studies 365 (Topic 1: Rome and Jerusalem). A study of daily life in Israel during the Roman period, focusing on Jerusalem, ancient Palestinian synagogues and churches, Jewish and Christian symbolism, agriculture, warfare, and burial practices. Three lecture hours a week for one semester. Only one of the following may be counted: Ancient History and Classical Civilization 325 (Topic 3), Classical Civilization 348 (Topic: Rome and Jerusalem), History 321G, Jewish Studies 365 (Topic 7), Middle Eastern Studies 320 (Topic 2: Rome and Jerusalem), 342 (Topic 21), Religious Studies 365 (Topic 1), Urban Studies 353 (Topic: Rome and Jerusalem). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 321M","name":"The History of Rome: The Republic","description":"Same as Ancient History and Classical Civilization 325 (Topic 1: The History of Rome: The Republic). A survey of Roman history from the founding of Rome to the death of Julius Caesar. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 322C","name":"Cultural History of World Science to 1650","description":"Cultural history of science from ancient times to the seventeenth century. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 322D","name":"The Scientific Revolution of the Seventeenth Century","description":"The history of science and its place in society from the mid-sixteenth century to the time of Isaac Newton. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 322G","name":"History of the Modern Life Sciences","description":"History of the life sciences from the eighteenth century to the present. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 322M","name":"History of Modern Science","description":"The history of science and its place in society from the time of Newton to the present. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 323L","name":"Europe since 1919","description":"Survey course emphasizing the impact of the two world wars on European social, political, and cultural life in the twentieth century. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 328M","name":"Modern Brazil","description":"Same as Latin American Studies 366 (Topic 12: Modern Brazil). The social, economic, political, and cultural forces that have shaped modern Brazil. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 329P","name":"History of the Atomic Bomb","description":"The development, use, and influence of nuclear weapons from the 1930s to 1954. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 329U","name":"Perspectives on Science and Mathematics","description":"An examination of five notable episodes in the history of science: Galileo's conflict with the Catholic Church, Isaac Newton's formulation of the laws of motion, Charles Darwin's proposal of the theory of evolution by natural selection, the development of the atomic bomb, and the discovery of the double helix structure of DNA. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: History 329U, 366N (Topic: Perspectives on Science and Mathematics), Philosophy 329U. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"HIS 331C","name":"History of the Ottoman Empire","description":"Same as Middle Eastern Studies 331C. A survey of Ottoman society and culture and of the empire's place on the world scene. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 331G","name":"History of Iran to 1800","description":"Same as Middle Eastern Studies 343 (Topic 3: History of Iran to 1800). A survey of the social, economic, and religious components unique to Iran from the pre-Islamic empire of the Achaemenids through the development of Iran as a medieval and premodern Islamic state. Three lecture hours a week for one semester. Only one of the following may be counted: History 331G, Middle Eastern Studies 321K (Topic 3 History of Iran to 1800), 343 (Topic 3). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 331J","name":"History of the Arab World","description":"A general survey of the origins and development of Arabic civilization. Three lecture hours a week for one semester. History 331J and Middle Eastern Studies 321K (Topic 2: History of the Arab World) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 331L","name":"Modern Iran","description":"Same as Middle Eastern Studies 343 (Topic 6: Modern Iran). The development of modern Iran; special attention is given to the impact of the West, the constitutional movement, nationalism, the oil crisis, and the Islamic Revolution of 1979. Only one of the following may be counted: History 331L, Middle Eastern Studies 324K (Topic 5: Modern Iran), 343 (Topic 6). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 332G","name":"European Intellectual History from the Enlightenment to Nietzsche","description":"Explores significant intellectual developments in Europe throughout the nineteenth century. Themes include romanticism, positivism, socialism, and nihilism. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 332J","name":"Twentieth-Century European Intellectual History","description":"Explores significant intellectual developments in Europe in the twentieth century. Topics include psychoanalysis, sociology, existentialism, and poststructuralism. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 334E","name":"Modern Egypt: A History","description":"Same as Islamic Studies 373 (Topic 5: Modern Egypt: A History) and Middle Eastern Studies 343 (Topic 1: Modern Egypt: A History). Critically examines the social, political, and intellectual dynamics that shaped the different forms of political community, economic organization, and public culture over the past century. Covers colonialism, liberalism, Arab socialism, authoritarian capitalism, and Islamic republicanism. Three lecture hours a week for one semester. Only one of the following may be counted: Arabic 372 (Topic: Modern Egypt: A History), History 334E, History 364G (Topic: Modern Egypt: A History), Islamic Studies 372 (Topic: Modern Egypt: A History), 373 (Topic 5), Middle Eastern Studies 322K (Topic: Mdern Egypt: A History), 343 (Topic 1). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 334J","name":"History of Britain from the Restoration to 1783","description":"Surveys the political, social, economic, and intellectual history of England and Great Britain from the restoration of the Stuart monarchy in 1660 to the conclusion of the War for American Independence in 1783. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 337N","name":"Germany in the Twentieth Century","description":"Same as Russian, East European, and Eurasian Studies 335 (Topic 11: Germany in the Twentieth Century). Survey of German political and military institutions, economic development, culture, and society. Some sections offered on the letter-grade basis only. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 340L","name":"Post-Mao China: Change and Transformation","description":"Same as Asian Studies 340L. Examines in a historical context the Chinese economy, society, politics, and culture during the reform era that began in the late 1970s. Explores the transformation of rural and urban economies and related social consequences; government systems, political ideologies, and popular values; and China's integration into the global system and its impact on China's role in world politics. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 340L, 361 (Topic: Post-Mao China: Change and Transformation), History 340L, 364G (Topic: Post-Mao China: Change and Transformation). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 340M","name":"Modern China","description":"Same as Asian Studies 340M. History of China from the intrusion of the West circa 1500 to the Communist revolution. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 340P","name":"European Expansion in Asia","description":"Same as Asian Studies 340P. European exploration, the commerce of the East India Companies, and the beginnings of empire in South and Southeast Asia from the fifteenth to the early nineteenth century. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 340R","name":"European Empires in Asia","description":"Same as Asian Studies 340R. The British in India and Malaya, the Dutch in Indonesia, and the French in Indochina since 1800. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 340S","name":"The Chinese in the United States","description":"Same as Asian American Studies 325 (Topic 3: The Chinese in the United States) and Asian Studies 340S. A lecture and discussion course on the history of the Chinese in the United States from their first arrival in significant numbers during the California Gold Rush of the mid-nineteenth century to the present. Three lecture hours a week for one semester. Only one of the following may be counted: Asian American Studies 325 (Topic: Chinese in the United States), 325 (Topic 3), Asian Studies 340S, History 340S. Partially fulfills the legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 341K","name":"Origins of Modern Japan","description":"Same as Asian Studies 341K. Japan to the beginnings of the Industrial Revolution, with a focus on the culminating age of samurai rule, the Tokugawa period (1600-1867). Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 341M","name":"Imperial Japan","description":"Same as Asian Studies 341M. Japan from the Meiji transformation through war, defeat, and occupation. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 342C","name":"Postwar Japan","description":"Same as Asian Studies 341N. Japan since the war and occupation. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 342D","name":"Political Economy of Japan","description":"Same as Asian Studies 342D. Historical development of the Japanese economy since early modern times. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 343","name":"The Age of Reformation","description":"Same as Religious Studies 344. Examines late medieval religion, the rise of Protestant movements, and the Catholic response in their cultural, political, and social contexts. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 343L","name":"History of Russia to 1917","description":"Same as Russian, East European, and Eurasian Studies 335 (Topic 5: History of Russia to 1917). Survey of Russian history from seventeenth-century Muscovy to the fall of the Romanovs in 1917. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 343M","name":"History of Russia since 1917","description":"Same as Russian, East European, and Eurasian Studies 335 (Topic 6: History of Russia since 1917). A survey of Russian history from the revolution of 1917 to the collapse of the Soviet Union. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 343P","name":"History of Witchcraft","description":"A study of witch beliefs and witchcraft prosecutions in western Europe and colonial America, mainly between 1100 and 1700. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 344E","name":"France in the Middle Ages","description":"Social, cultural, political, and economic history of France from the fall of the Roman Empire to the fifteenth century; emphasis on the development of feudalism and nationalism. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 344F","name":"Anglo-Saxon England","description":"The political, social, cultural, and legal history of England from about 410 to 1154. Lectures and discussion of primary sources. Three lecture hours a week for one semester. History 344F and 362K (Topic: Anglo-Saxon England) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 344G","name":"Twelfth-Century Renaissance: 1050-1200","description":"An examination of social, cultural, and intellectual developments in eleventh- and twelfth-century Europe. Three lecture hours a week for one semester. History 344G and 362K (Topic: Twelfth-Century Renaissance: 1050-1200) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 344J","name":"Norman and Angevin England","description":"Political, social, and legal history of England from the Norman conquest in 1066 to the end of the reign of Richard III in 1485. Three lecture hours a week for one semester. History 344J and 362K (Topic: Norman and Angevin England) may not both be counted.","upper":true},{"key":"HIS 344M","name":"Everyday Life in Early Modern Europe","description":"Social history of early modern Europe (1400-1700), with emphasis on material conditions of social existence. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346C","name":"Ancient India","description":"Same as Asian Studies 346C. History and culture of South Asia from its protohistoric beginnings in the Indus Valley through the period of the early empires of the Mauryas and Guptas. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346D","name":"Medieval India","description":"Same as Asian Studies 346D. History and culture of South Asia from approximately 500 to 1500, with emphasis on religious and political institutions and the emergence of regional cultures. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346J","name":"Colonial Latin America through Objects","description":"Same as Latin American Studies 366 (Topic 20). Examines objects, such as paintings, reliquaries, monstrances, and churches from colonial Latin America in order to understand colonial culture. Includes critical reading of original texts. Three lecture hours a week for one semester. Only one of the following may be counted: History 346J, 363K (Topic: Colonial Latin America through Objects), Latin American Studies 366 (Topic 20). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346K","name":"Colonial Latin America","description":"Same as Latin American Studies 366 (Topic 2: Colonial Latin America). Basic survey course, designed as an introduction to Latin American history in the colonial period. Three lecture hours a week for one semester. Only one of the following may be counted: History 310K, 346K, Latin American Studies 310 (Topic 1: Latin American Civilization: The Colonial Experience), 366 (Topic 2). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346L","name":"Modern Latin America","description":"Same as African and African Diaspora Studies 374E (Topic 5) and Latin American Studies 366 (Topic 3). Continuation of History 346K and Latin American Studies 366 (Topic 2). Only one of the following may be counted: African and African Diaspora Studies 374E (Topic: Modern Latin America), 374E (Topic 5), History 310L, 346L, Latin American Studies 310 (Topic 2: Latin American Civilization: The National Experience), 366 (Topic 3). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346M","name":"Early Modern India","description":"Same as Asian Studies 346M. The history and culture of South Asia from approximately 1500 to 1750. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 346M, History 346M, Religious Studies 341 (Topic 6). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346P","name":"The Indian Republic Since 1947","description":"An overview of Contemporary India, a republic that emerged from the British Empire. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346R","name":"Revolution in Modern Latin America","description":"Same as Latin American Studies 366 (Topic 13: Revolution in Modern Latin America). Comparison of the Mexican and Cuban revolutions and of their challenges to inter-American relations. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346S","name":"Revolution in Twentieth-Century Latin America","description":"Same as Latin American Studies 366 (Topic 9: Revolution in Twentieth-Century Latin America). An introduction to recent Latin American history, with emphasis on phenomena that explain the apparent social unrest and political instability of the region. Three lecture hours a week for one semester. Only one of the following may be counted: History 346L, 366N (Topic: Revolution in Twentieth-Century Latin America), Latin American Studies 366 (Topic 9). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346T","name":"The Cuban Revolution and the United States","description":"Same as Latin American Studies 366 (Topic 17: The Cuban Revolution and the United States). The special economic and political relationship between the United States and Cuba from 1898 to 1967; and how the 1959 revolution affected the Cold War relationships between East and West, North and South. Three lecture hours a week for one semester. Only one of the following may be counted: History 346T, 366N (Topic: The Cuban Revolution and the US), Latin American Studies 366 (Topic: The Cuban Revolution and the US), 366 (Topic 17). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346V","name":"Twentieth-Century Rural Latin America","description":"Same as Latin American Studies 366 (Topic 19: Twentieth-Century Rural Latin America). Examines causes of some of the unresolved conflicts affecting Latin America today, including the social-agrarian relationships linking landlords and campesinos; the role of the state and the impact of official ideologies involving indigenous people; religion and the Catholic Church; the history of rural institutions; and the success or failure of land reforms. Three lecture hours a week for one semester. Only one of the following may be counted: History 346V, 363K (Topic: Twentieth-Century Rural Latin America), Latin American Studies 366 (Topic 19). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 346W","name":"Church and State in Latin America","description":"Same as Latin American Studies 366 (Topic 21: Church and State in Latin America) and Religious Studies 368 (Topic 1: Church and State in Latin America). History of Church-state relations and religious politics in modern Latin America, with emphasis on the nineteenth to early twentieth-century periods. Three lecture hours a week for one semester. Only one of the following may be counted: History 346W, 363K (Topic: Church and State in Latin America), Latin American Studies 366 (Topic 21), Religious Studies 368 (Topic 1). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 347L","name":"Seminar in Historiography","description":"Restricted to students in the History Honors Program. Designed to familiarize students in the honors program with general problems of historiography, historical interpretation, and the philosophy of history. Three lecture hours a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"HIS 349R","name":"Military History to 1640","description":"A broad survey of world military systems from ancient times to about 1640. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 350L","name":"Undergraduate Seminar in History","description":"Lectures, discussion, reading, and research on selected topics in the field of history. Three lecture hours a week for one semester. History 350L and 350R may not both be counted unless the topics vary. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 350R","name":"Undergraduate Seminar in United States History","description":"Lectures, discussion, reading, and research on selected topics in the field of United States history. Three lecture hours a week for one semester. History 350L and 350R may not both be counted unless the topics vary. Partially fulfills legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and six semester hours of coursework in history.","upper":true},{"key":"HIS 351D","name":"The Hellenistic Age: Alexander to Actium","description":"Same as Ancient History and Classical Civilization 325 (Topic 6: The Hellenistic Age: Alexander to Actium) and Classical Civilization 351D. History of Asia, Egypt, and the Mediterranean world from Alexander's expedition to Asia to Rome's defeat of the last of the Hellenistic monarchs at Actium (ca. 334 to 31 BC). Two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 351P","name":"History of Religion in America since 1800","description":"Same as Religious Studies 326. Introduction to the history of religion in the United States of America from the nineteenth century to the present. Focuses on how diverse peoples imagined and transformed the landscape, interacted with one another at different sites, and moved within and across national borders. Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 353","name":"The French Revolution and Napoleon","description":"Analysis of the social, political, and economic origins and outcomes of the French Revolution and Napoleon's empire. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 354C","name":"History of Greece to the End of the Peloponnesian War","description":"Same as Ancient History and Classical Civilization 325 (Topic 4: History of Greece to the End of the Peloponnesian War) and Classical Civilization 354C. Survey of Greek history from the emergence of the city-states through the end of the Peloponnesian War (ca. 700 to 404 BC). Two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 354D","name":"History of Greece to 146 BC","description":"Same as Ancient History and Classical Civilization 325 (Topic 5: History of Greece to 146 BC) and Classical Civilization 354D. Survey of Greek history from the end of the Peloponnesian War to the defeat of Greece by Rome (404 to 146 BC). Two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 354N","name":"France in Modern Times","description":"The impact of revolution on French political, economic, and social development in the nineteenth and twentieth centuries. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 355N","name":"Main Currents of American Culture to 1865","description":"Same as American Studies 355. Traces the development of American culture and society from the colonial era until the end of the Civil War. Major themes include racial conflict, religion, slavery, the development of democracy, and cultural reform. Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 355P","name":"The United States since 1941","description":"A history of political, economic, diplomatic, social, and cultural developments in the United States since the nation's entry into World War II. Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 355S","name":"United States Constitutional History","description":"A lecture and discussion course dealing with the history of the development of the American constitutional tradition from colonial times to the present. Three lecture hours a week for one semester. History 355S and 366N (Topic: United States Constitutional History) may not both be counted. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 356G","name":"History of the United States West","description":"Examines the history of the trans-Mississippi West with a special focus on the concepts of conquest, resistance, and region from the nineteenth to the twentieth century. Three lecture hours a week for one semester. History 356G and 365G (Topic: History of the United States West) may not both be counted. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 356K","name":"Main Currents of American Culture since 1865","description":"Same as American Studies 356. Traces the development of American culture and society from the end of the Civil War to the present. Major themes include racial conflict, pluralism, religion, urban development and reform, modernism, government centralization, cultural radicalism, and the rebirth of conservatism. Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 356P","name":"The United States in the Civil Rights Era","description":"Same as African and African Diaspora Studies 374D (Topic 17), American Studies 321 (Topic 9),  and Mexican American Studies 374 (Topic 36). Examines United States history in the post-World War II era, including how civil rights and other racial issues helped shape the politics, popular culture, and social life of this period. Only one of the following may be counted: African and African Diaspora Studies 374D (Topic: The United States in the Civil Rights Era), 374D (Topic 17), American Studies 321 (Topic: The United States in the Civil Rights Era), 321 (Topic 9), History 356P, Mexican American Studies 374 (Topic: The United States in the Civil Rights Era), 374 (Topic 36). Partially fulfills legislative requirement for American history.","upper":true},{"key":"HIS 356R","name":"America and the Holocaust","description":"Same as American Studies 321 (Topic 4: America and the Holocaust) and Jewish Studies 365 (Topic 1: America and the Holocaust).  Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 321 (Topic 4), 370 (Topic: America and the Holocaust), History 350L (Topic: America and the Holocaust), 356R, 365G (Topic: America and the Holocaust), Jewish Studies 361 (Topic: America and the Holocaust), 365 (Topic 1), Liberal Arts Honors 350 (Topic: America and the Holocaust). Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 357C","name":"African American History to 1860","description":"Same as African and African Diaspora Studies 357C and American Studies 321E. Review of West African origins; New World settlement patterns, social life, and culture; discussion of the Atlantic slave trade, the development of capitalism and plantation slavery, and the origins of racism. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 357C, American Studies 321 (Topic: African American History to 1860), 321E, History 357C. Partially fulfills legislative requirement for American History. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 357D","name":"African American History since 1860","description":"Same as American Studies 321F, African and African Diaspora Studies 357D, and Urban Studies 353 (Topic 1: African American History since 1860). Survey of the history of African Americans in the United States from 1860 to the present: Emancipation, Reconstruction politics, migration and urbanization, and the evolution of African American culture; kinds of sources and methods valuable for analyzing African American life and culture. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 357D, American Studies 321 (Topic: African American History since 1860), 321F, History 357D, Urban Studies 353 (Topic 1). Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 358M","name":"History of Britain from 1783 through World War I","description":"Same as European Studies 346 (Topic 1: History of Britain from 1783 through World War I). Surveys the political, social, economic, and intellectual history of Great Britain from the years preceding the outbreak of the French Revolution to the conclusion of World War I. Three lecture hours a week for one semester. Only one of the following may be counted: European Studies 346 (Topic 1), History 358M. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 358Q","name":"Supervised Research","description":"Individual instruction. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 359N","name":"History of Africa since 1800","description":"Same as African and African Diaspora Studies 359N. Development of sub-Saharan Africa from the end of the slave trade to independence. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 359P","name":"History of East Africa","description":"Same as African and African Diaspora Studies 345. A survey of the history of Kenya, Tanzania, and Uganda from prehistoric times to the postindependence era. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 359R","name":"History of West Africa","description":"Same as African and African Diaspora Studies 345C. A history of the West Africa region: the rise and fall of kingdoms, relations with Europe and Asia, the great revolutions of the nineteenth century, colonial administration, decolonization, and the search for economic development and political stability since independence. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 362G","name":"Topics in European History","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 362K","name":"Medieval Civilization","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 362P","name":"Spinoza and Modernity","description":"Same as Core Texts and Ideas 321F, European Studies 346 (Topic 21), Jewish Studies 364 (Topic 9), Philosophy 354 (Topic 7),  and Religious Studies 357 (Topic 8). Introduction to the core of Spinoza's writings and the diverse reactions they have elicited. Examines Spinoza's refusal of mind-body dualism, as well as a transcendent god or ideal as a way of understanding Spinoza's concepts and ideas. Three lecture hours a week for one semester. Only one of the following may be counted: Core Texts and Ideas 335 (Topic: Spinoza and Modernity), 321F, European Studies 346 (Topic: Spinoza and Modernity), 346 (Topic 21), 347 (Topic: Spinoza and Modernity), History 362G (Topic: Spinoza and Modernity), 362P, Jewish Studies 364 (Topic: Spinoza and Modernity), 364 (Topic 9), Philosophy 334K (Topic: Spinoza and Modernity), 354 (Topic: Spinoza and Modernity), 354 (Topic 7), Religious Studies 357 (Topic: Spinoza and Modernity), 357 (Topic 8). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 363K","name":"Topics in Latin American History","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 365G","name":"Topics in United States History","description":"Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 366N","name":"Topics in History","description":"Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 372L","name":"Proseminar in Historical Source Readings","description":"Individual instruction in reading history and historiography. The equivalent of three lecture hours a week for one semester.  May be repeated for credit. Prerequisite: Upper-division standing and written consent of instructor; consent forms are available in the departmental advising office.","upper":true},{"key":"HIS 372M","name":"Proseminar in Historical Writing","description":"Individual instruction in historical research and writing. The equivalent of three lecture hours a week for one semester.  May be repeated for credit. Prerequisite: Upper-division standing and written consent of instructor; consent forms are available in the departmental advising office.","upper":true},{"key":"HIS 375D","name":"Islamic Spain and North Africa to 1492","description":"Same as Middle Eastern Studies 343 (Topic 4: Islamic Spain and North Africa to 1492) and Religious Studies 345. An introduction to the impact of Islam on Spain and North Africa, with emphasis on social, economic, and cultural development. Three lecture hours a week for one semester. Only one of the following may be counted: Ancient History and Classical Civilization 330 (Topic: Islamic Spain and North Africa to 1492), History 375D, Islamic Studies 373 (Topic: Islamic Spain and North Africa to 1492), Middle Eastern Studies 321K (Topic 4: Islamic Spain and North Africa to 1492), 343 (Topic 4), Religious Studies 345, 363 (Topic: Islamic Spain and North Africa to 1492). Prerequisite: Upper-division standing.","upper":true},{"key":"HIS 376F","name":"The United States and the Second World War","description":"Restricted to students in the Normandy Scholars Program.  Three lecture hours a week for one semester, and approximately three weeks of study in France. Partially fulfills legislative requirement for American history.","upper":true},{"key":"HIS 679H","name":"Honors Tutorial Course","description":"An individual instruction course to provide training in the methods and teaching of historical research and writing. The equivalent of three semester hours a week for two semesters. May not be included in the thirty semester hours of coursework required for the major. Prerequisite: For 679HA, upper-division standing and admission to the History Honors Program; for 679HB, History 679HA.","upper":true}]