[{"key":"RTF 301N","name":"Introductory Topics in Radio-Television-Film","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"RTF 305 (TCCN: COMM 1307)","name":"Introduction to Media Studies","description":"Introduction to historical, cultural, political, economic, and international characteristics of film, television, and other media in society. Two lecture hours, one discussion hour, and one two-and-one-half-hour film screening a week for one semester. Required of all radio-television-film majors.","upper":false},{"key":"RTF 309","name":"Communication Technology and Society","description":"Same as Communication 309. Study of communication technologies, from writing to the Internet; their uses in interpersonal, group, mass, and international contexts; and the impact of technologies on work. Three lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"RTF 312C","name":"Introduction to Global Media","description":"A world perspective on information, news, and entertainment communication systems; politics, technology, economics, and culture. Three lecture hours a week for one semester.","upper":false},{"key":"RTF 314 (TCCN: COMM 2366)","name":"The Development of the Motion Picture","description":"Survey of significant movements and schools of filmmaking through viewings and discussions of representative motion pictures; critical approaches to performance, sociological impact, visual aesthetics, and industry structure. Three lecture hours and one two-hour film screening a week for one semester. A one-hour discussion section may also be required.","upper":false},{"key":"RTF 316 (TCCN: COMM 1335)","name":"History of Television and Radio","description":"Survey of evolution of U.S. television and radio programming, aesthetics, production, and policy. Three lecture hours a week for one semester, with one screening of up to two hours a week as required.","upper":false},{"key":"RTF 317","name":"Narrative Strategies","description":"Study of the way meaning is structured and perceived in the screen image; introduction to basic narrative techniques. Includes viewing and analysis of narrative examples. Three lecture hours and two and one-half hours of film screening a week for one semester. Some sections may require an additional discussion hour. Required of all students in the production area. Students may not enroll in this course more than twice. Prerequisite: Three semester hours of lower-division coursework in radio-television-film.","upper":false},{"key":"RTF 318","name":"Introduction to Image and Sound","description":"Exploration of fundamental production concepts and techniques through lectures, projects, and laboratory work. Three lecture hours and three laboratory hours a week for one semester. Students may not enroll in this course more than twice. Prerequisite: Six semester hours of lower-division coursework in radio-television-film and consent of instructor.","upper":false},{"key":"RTF 319","name":"Introduction to Digital Media","description":"Basic information, skills, and theories of digital media. Includes the study of computer-based image construction, Web-based tools for research and production, and theories of interactivity. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Three semester hours of lower-division coursework in radio-television-film.","upper":false},{"key":"RTF 321F","name":"Media Analysis and Criticism","description":"Restricted to radio-television-film majors. A foundational course devoted to the critical analysis of media in a variety of contexts. Three lecture hours a week for one semester. Additional hours may be required for some topics.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and twelve semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 324F","name":"Social Theories of Media","description":"A foundational course exploring social theories of media. Three lecture hours a week for one semester. Additional hours may be required for some topics.  May be repeated for credit when the topics vary. Prerequisite: For radio-television-film majors, upper-division standing and twelve semester hours of lower-division coursework in radio-television-film; for others, upper-division standing.","upper":true},{"key":"RTF 330G","name":"Topics in Media Research","description":"Restricted to radio-television-film majors. Applied research investigating specific media topics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, Radio-Television-Film 305 with a grade of at least C, and nine additional semester hours of lower-division coursework in radio-television-film with a grade of at least C.","upper":true},{"key":"RTF 330K","name":"Introduction to Research Methods","description":"Restricted to radio-television-film majors. Introduction to applied media research and research criticism; fundamentals of audience analysis, survey design, experimental and field research, content analysis. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; and the following coursework, with a grade of at least C in each course: Radio-Television-Film 305 and nine additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 330L","name":"Internship in Film and Electronic Media","description":"Restricted to radio-television-film majors. Practical work experience related to the study of film, television, radio, or other media. Students must make their own arrangements to secure relevant internships. The equivalent of ten lecture hours a week for one semester. Radio-Television-Film 330L and 330M may not both be counted. Offered on the pass/fail basis only. Prerequisite: Upper-division standing, twelve semester hours of lower-division coursework in radio-television-film, and consent of the internship coordinator.","upper":true},{"key":"RTF 330M","name":"Internship in Digital Media","description":"Position availability depends on qualifications of student and number of internships open at time of enrollment. Practical work experience in digital media and postproduction media. One and one-half lecture hours and at least ten hours of fieldwork a week for one semester. Radio-Television-Film 330L and 330M may not both be counted. Offered on the pass/fail basis only. Prerequisite: Upper-division standing, twelve semester hours of coursework in the College of Communication with a grade of at least C in each course, and consent of instructor.","upper":true},{"key":"RTF 331J","name":"Policy Issues in New Communication Technologies","description":"Overview of policy and regulation of communication systems in the United States, with emphasis on contemporary technologies. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Offered on the letter-grade basis only. Prerequisite: Upper-division standing, and the following coursework with a grade of at least C in each course: Radio-Television-Film 305, 309, and six additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 331L","name":"Corporate and Instructional Video","description":"Restricted to radio-television-film majors. Study, design, production, use, and evaluation of corporate and instructional video materials. Three lecture hours a week for one semester, with studio hours to be arranged. Prerequisite: Upper-division standing; Radio-Television-Film 305 and three additional semester hours of lower-division coursework in radio-television-film with a grade of at least C in each course; and Radio-Television-Film 317 and 318 with a grade of at least B in each.","upper":true},{"key":"RTF 331M","name":"New Communication Technologies","description":"Restricted to radio-television-film majors. Survey of history of new communication technologies. Analysis of regulation, policy, economics, and programming of new communication technologies. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, and the following coursework, with a grade of at least C in each course: Radio-Television-Film 305, 309, and six additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 331N","name":"The Information Society","description":"Introduction to information technologies such as the Internet, telephones, and computers and their relation to existing media; includes history, policy, economics, and social impact. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For radio-television-film majors, upper-division standing and twelve semester hours of lower-division coursework in radio-television-film; for others, upper-division standing.","upper":true},{"key":"RTF 331P","name":"Topics in New Communication Technologies","description":"Restricted to radio-television-film majors. Applications and potential effects of new telecommunications and information technologies in the home, workplace, and in education, social services, and politics. Three lecture hours a week for one semester; additional hours may be required for some topics.  May be repeated for credit when the topics vary. Prerequisite: Radio-Television-Film 309 and nine additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 331Q","name":"Topics in Digital Media","description":"Laboratory explorations of the spatial and narrative dimensions of the digital environment. Three lecture hours and three laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For radio-television-film majors, the following coursework with a grade of at least C in each course: Radio-Television-Film 305, 318 or 319, and six additional semester hours of coursework chosen from Radio-Television-Film 309, 314, 316, 317, 318, and 319; for others, upper-division standing.","upper":true},{"key":"RTF 331R","name":"Topics in New Media","description":"Students produce projects in either film, video, computer animation, collage, sculpture, assemblage, soundscape, or performance. Prior experience in one or more media is helpful but not necessary. Three lecture hours and one and one-half studio hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For radio-television-film majors, the following coursework with a grade of at least C in each course: Radio-Television-Film 305, 318 or 319, and six additional semester hours of coursework chosen from Radio-Television-Film 309, 314, 316, 317, 318, and 319; for others, upper-division standing.","upper":true},{"key":"RTF 331T","name":"Topics in Digital Media: Audio","description":"Explorations of the auditory dimensions of the digital environment. Three lecture hours a week for one semester; additional hours may be required for some topics.  May be repeated for credit when the topics vary. Prerequisite: For radio-television-film majors, Radio-Television-Film 318 or 319, and nine additional semester hours of lower-division coursework in radio-television-film; for others, upper-division standing.","upper":true},{"key":"RTF 333","name":"Introduction to Screenwriting","description":"Restricted to radio-television-film majors. An introduction to screenwriting for features, short films, documentaries, and television. Lectures explore the basic theory of story, character, and structure. Students write original screenplays during workshop hours. One and one-half lecture hours and two workshop hours a week for one semester. Prerequisite: Upper-division standing and twelve semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 334","name":"Programming and Audiences","description":"Study of media programming and its cognitive and behavioral impact on audiences. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and twelve semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 335","name":"Television Analysis and Criticism","description":"Analysis of critical methods, selected television programs, and selected critics. Practice in written criticism required of all students. Three lecture hours a week for one semester, with two hours of film screening a week if required by the topic.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and twelve semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 336","name":"Special Projects in Radio-Television-Film","description":"Restricted to radio-television-film majors. Comprehensive research or creative projects in areas of special interest developed and executed by the student under faculty supervision. Individual instruction. May be repeated once for credit. Prerequisite: Upper-division standing, twelve semester hours of lower-division coursework in radio-television-film, and consent of the department.","upper":true},{"key":"RTF 337","name":"Radio Fundamentals","description":"Restricted to radio-television-film majors. Fundamentals of audio program production. Students create either brief or long audio programs. Three lecture hours a week for one semester, with studio hours to be arranged.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; Radio-Television-Film 305 and three additional semester hours of lower-division coursework in radio-television-film with a grade of at least C in each course; and Radio-Television-Film 317 and 318 with a grade of at least B- in each.","upper":true},{"key":"RTF 337P","name":"Multitrack Audio Production","description":"Restricted to radio-television-film majors. Principles and practice of multitrack audio production. Three lecture hours a week for one semester, with studio hours to be arranged. Prerequisite: Upper-division standing; Radio-Television-Film 305 and three additional semester hours of lower-division coursework in radio-television-film with a grade of at least C in each course; and Radio-Television-Film 317 and 318 with a grade of at least B- in each.","upper":true},{"key":"RTF 340","name":"Studio Production","description":"Restricted to radio-television-film majors. Introduction to production of television programs, including the multicamera format. Three lecture hours and six laboratory hours a week for one semester. May not be taken concurrently with Radio-Television-Film 366 or 366K. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, Radio-Television-Film 317 and 318 with a grade of at least B- in each, and six additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 341","name":"Audio Production: Sound for Picture","description":"Restricted to radio-television-film majors. Theory and practice of producing quality audio for television, film, and other picture media. Includes basic editing on a digital audio workstation. Three lecture hours a week for one semester, with studio hours to be arranged.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, Radio-Television-Film 317 and 318 with a grade of at least B- in each, and six additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 341C","name":"Advanced Audio: Sound Design and Postproduction","description":"Restricted to radio-television-film majors. Sound design and editing, and fundamentals of postproduction audio mixing. Three lecture hours a week for one semester, with studio hours to be arranged.  May be repeated for credit when the topics vary. Prerequisite: Radio-Television-Film 337, 337P, or 341.","upper":true},{"key":"RTF 342","name":"Topics in Global Media","description":"Study of political, social, cultural, and economic factors affecting the use and impact of communication systems in an international context. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and twelve semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 342T","name":"International Telecommunications","description":"Restricted to radio-television-film majors. Overview of issues and history of international telecommunication systems, focusing on the roles of business and government. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, and the following coursework, with a grade of at least C in each course: Radio-Television-Film 305, 309, and six additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 343","name":"Advanced Video Production","description":"Restricted to radio-television-film majors. Advanced study in film, television, and media production. Three lecture hours and three laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Radio-Television-Film 340, 366, or 366K; additional prerequisites vary with the topic.","upper":true},{"key":"RTF 343M","name":"Master Class","description":"Restricted to radio-television-film majors. Incorporates a guest speaker series, focused on a particular topic for the semester. Students conduct research, coordinate and attend the speaker series, and pursue creative projects related to the semester's topic. Three lecture hours and three laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, Radio-Television-Film 317 and 318 with a grade of at least B- in each, and six additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 343N","name":"Advanced Three-Dimensional Production","description":"Restricted to radio-television-film majors. Carries the principles developed in Radio-Television-Film 366M into a variety of hands-on production settings and projects, including large-crew productions at Austin City Limits Live at the Moody Theater, as well as smaller shoots in a variety of other studios and locations. Three lecture hours and three laboratory hours a week for one semester, with additional hours to be arranged.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing, Radio-Television-Film 366M, and consent of instructor.","upper":true},{"key":"RTF 343S","name":"Soundstage Production for Television and Film","description":"Restricted to radio-television-film majors. Study of the skills and aesthetics related to professional-level productions in the soundstage format. Three lecture hours and three laboratory hours a week for one semester. Radio-Television-Film 343 (Topic: Soundstage Production for Television and Film) and 343S may not both be counted. Prerequisite: Radio-Television-Film 340 or 366K with a grade of at least C.","upper":true},{"key":"RTF 344","name":"Special Applications of Media Production","description":"Restricted to radio-television-film majors. Special problems involved in audio, film, and video production. Three lecture hours a week for one semester, with studio hours to be arranged if required by the topic.  May be repeated for credit when the topics vary. Prerequisite: Radio-Television-Film 305 and three additional semester hours of lower-division coursework in radio-television-film with a grade of at least C in each course; and Radio-Television-Film 317 and 318 with a grade of at least B- in each. Additional prerequisites vary with the topic.","upper":true},{"key":"RTF 344M","name":"Special Applications of Digital Media Production","description":"Special topics in digital media theory, design, or development. May include visual effects and motion graphics or digital media and digital art. Three lecture hours a week for one semester, with studio hours to be arranged.  May be repeated for credit when the topics vary. Prerequisite: For radio-television-film majors, Radio-Television-Film 318 or 319, and nine additional semester hours of coursework in radio-television-film; for others, upper-division standing.","upper":true},{"key":"RTF 344N","name":"Advanced Applications of Digital Media Production","description":"Restricted to radio-television-film majors. Advanced topics in digital media theory, design, and development. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Offered on the letter-grade basis only. Prerequisite: Upper-division standing and Radio-Television-Film 344M (Topic 3); additional prerequisites may vary with the topic.","upper":true},{"key":"RTF 345","name":"Studies in Film History","description":"Restricted to radio-television-film majors. Critical assessment of major genres, periods, movements, and personalities in United States and international film history. Three lecture hours a week for one semester, with one two-hour film screening a week if required by the topic.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and the following coursework, with a grade of at least C in each course: Radio-Television-Film 305, either 314 or 316, and six additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 346","name":"Introduction to Editing","description":"Restricted to radio-television-film majors. Theory and practice of video and film editing techniques. Three lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Upper-division standing, Radio-Television-Film 317 and 318 with a grade of at least B- in each, and six additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 346E","name":"Advanced Editing","description":"Restricted to radio-television-film majors. In-depth look at the principles, techniques, and aesthetics of editing; building a broad background for students' future professional development. Designed to provide a basic-to-intermediate level of familiarity with Avid editing software, by discussing and working on provided narrative, documentary, and technical exercises; various approaches to editing style in each case. Three lecture hours and two and one-half hours for film screenings a week for one semester, with additional laboratory hours to be arranged. Only one of the following may be counted: Radio-Television-Film 344 (Topic: Advanced Editing), 346C, 346E. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and Radio-Television-Film 346 with a grade of at least B.","upper":true},{"key":"RTF 347C","name":"The Business of Media","description":"Restricted to radio-television-film majors. Survey of business practices in film, television, and music industries: development, production, distribution, and exhibition. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and twelve semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 348","name":"Studies in Media Industries","description":"Examination of the economics and the production, research, management, and distribution practices of the film and electronic media industries. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and twelve semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 351C","name":"Introduction to Two-Dimensional Animation","description":"Restricted to radio-television-film majors. Theory and practice of digital graphics and animation techniques. Three lecture hours a week for one semester, with studio hours to be arranged.  Offered on the letter-grade basis only. Prerequisite: For majors, Radio-Television-Film 318 or 319, and nine additional semester hours of coursework in radio-television-film; for others, upper-division standing.","upper":true},{"key":"RTF 351D","name":"Advanced Two-Dimensional Animation","description":"Restricted to radio-television-film majors. In-depth study of two-dimensional animation techniques and an introduction to stop-motion animation, green screen techniques, and postproduction effects. Three lecture hours a week for one semester, with additional laboratory hours to be arranged. Only one of the following may be counted: Radio-Television-Film 344M (Topic: Advanced Digital Animation), 344M (Topic: Two-Dimensional Animation and Motion Graphics), 351D. Prerequisite: Upper-division standing and Radio-Television-Film 351C.","upper":true},{"key":"RTF 351T","name":"Three-Dimensional Animation","description":"Restricted to radio-television-film majors. Introduction to the art of three-dimensional animation using lectures, workshops, screenings, and labs. Three lecture hours a week for one semester, with additional laboratory hours to be arranged. Radio-Television-Film 344M (Topic: Three-Dimensional Animation) and 351T may not both be counted. Prerequisite: Radio-Television-Film 351D.","upper":true},{"key":"RTF 359","name":"Studies in Media and Culture","description":"Special topics related to the critical analysis of media in cultural contexts. Three lecture hours a week for one semester. Radio-Television-Film 359 and 359S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, Radio-Television-Film 314 or 316, and nine additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 359S","name":"Studies in Media and Culture","description":"Restricted to radio-television-film majors. Special topics related to the critical analysis of media in cultural contexts. Three lecture hours and two hours of film screening a week for one semester. Radio-Television-Film 359 and 359S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, Radio-Television-Film 314 or 316, and nine additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 365","name":"Topics in Media and Society","description":"Restricted to radio-television-film majors. Advanced topics addressing media, communication, and society. Three lecture hours a week for one semester, with additional hours to be arranged if required by the topic.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and twelve semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 365C","name":"Media and Policy","description":"Advanced topics addressing media and policy in society. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For radio-television-film majors, the following coursework with a grade of at least C in each course: Radio-Television-Film 305, either 314 or 316, and six additional semester hours of lower-division coursework in radio-television-film; for others, consent of instructor.","upper":true},{"key":"RTF 365D","name":"Media Literacy","description":"Advanced topics addressing media literacy and education. Three lecture hours a week for one semester; some topics require additional hours.  May be repeated for credit when the topics vary. Prerequisite: For radio-television-film majors, upper-division standing and the following coursework with a grade of at least C in each: Radio-Television-Film 305, and nine additional semester hours of lower-division coursework in radio-television-film; for others, consent of instructor.","upper":true},{"key":"RTF 366","name":"Introduction to Field and Studio Production","description":"Restricted to radio-television-film majors. Basic theory and techniques in single-camera video production; individual and collective production assignments, with emphasis on technical proficiency, examination of the entire production process, visualization of ideas, and critical evaluation of the visual text. Three lecture hours and six laboratory hours a week for one semester. May not be taken concurrently with Radio-Television-Film 340 or 366K. Prerequisite: Upper-division standing; Radio-Television-Film 305 and three additional semester hours of lower-division coursework in radio-television-film with a grade of at least C in each course; and Radio-Television-Film 317 and 318 with a grade of at least B in each.","upper":true},{"key":"RTF 366D","name":"Directing Workshop","description":"Restricted to radio-television-film majors. Explores the role of the director, focusing on the director-actor relationship, narrative structure, and visual language. Three lecture hours and three laboratory hours a week for one semester. Radio-Television-Film 344 (Topic: Directing Workshop) and 366D may not both be counted. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, Radio-Television-Film 317 and 318 with a grade of at least B- in each, and six additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 366K","name":"Introductory Production","description":"Restricted to radio-television-film majors. Workshops in narrative and documentary production. Three lecture hours and three laboratory hours a week for one semester. May not be taken concurrently with Radio-Television-Film 340 or 366. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; Radio-Television-Film 305 and three additional semester hours of lower-division coursework in radio-television-film with a grade of at least C in each course; and Radio-Television-Film 317 and 318 with a grade of at least B- in each.","upper":true},{"key":"RTF 366M","name":"Introduction to Three-Dimensional Production","description":"Restricted to students in radio-television-film. An introduction to the aesthetics, science, theory and practice of three-dimensional production via lectures, screenings, and some hands-on production work in groups. No previous three-dimensional experience is required. Three lecture hours and three laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing, Radio-Television-Film 317 and 318 with a grade of at least B- in each, six additional semester hours of lower-division coursework in radio-television-film, and consent of instructor.","upper":true},{"key":"RTF 367K","name":"Producing Film and Television","description":"Restricted to radio-television-film majors. Comprehensive consideration of the production process from the producer's standpoint regarding fiscal and creative management. Includes development and preproduction and production planning using computer budgeting and scheduling. Three lecture hours a week for one semester, with computer laboratory hours to be arranged.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing; Radio-Television-Film 305 and three additional semester hours of lower-division coursework in radio-television-film with a grade of at least C in each course; and Radio-Television-Film 317 and 318 with a grade of at least B- in each.","upper":true},{"key":"RTF 367L","name":"Narrative Filmmaking: 16-mm","description":"Restricted to radio-television-film majors. Theory and techniques in 16-mm film synchronous sound production; individual and collective production assignments, with emphasis on technical proficiency, examination of entire production process, visualization of ideas, and critical evaluation of the visual text. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Radio-Television-Film 366K.","upper":true},{"key":"RTF 367P","name":"Advanced Producing","description":"Restricted to radio-television-film majors. Advanced practical application of the business and creative skills used to produce and distribute media projects in the marketplace. Three lecture hours a week for one semester.   Radio-Television-Film 344 (Topic: Advanced Producing) and 367P may not both be counted. May be repeated for credit when the topics vary. Prerequisite: Radio-Television-Film 367K.","upper":true},{"key":"RTF 368","name":"Advanced Production Topics","description":"Restricted to radio-television-film majors. Advanced study of production crafts in film, television, and other digital media. Three lecture hours and three laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Radio-Television-Film 343 or 367L.","upper":true},{"key":"RTF 368C","name":"Advanced Directing","description":"Restricted to radio-television-film majors. Creation of collaborative, performance-based works, such as the co-direction of a Dogme-style film, that emphasize simplicity and ingenuity in image and sound choices using the Dogme 95 meets Meisner technique. Works will adhere to the production code that is a modified version of the Dogme 95 Vow of Cinematic Chastity. Three lecture hours and three laboratory hours a week for one semester. Radio-Television-Film 368 (Topic 4: Advanced Directing) and 368C may not both be counted. Offered on the letter-grade basis only. Prerequisite: Upper-division standing, Radio-Television-Film 333, and 366D.","upper":true},{"key":"RTF 368S","name":"Undergraduate Thesis","description":"Restricted to radio-television-film majors. Advanced film production or media studies research. Three lecture hours a week for one semester, with studio hours to be arranged.  May be repeated for credit when the topics vary. Prerequisite: Radio-Television-Film 343, 367L, or 368; and consent of instructor.","upper":true},{"key":"RTF 369","name":"Advanced Screenwriting","description":"Restricted to radio-television-film majors. Students develop and write original screenplays. Includes advanced study of screenplay structure, critical analysis of student and professional work, and intensive writing each week toward a completed script. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Radio-Television-Film 333 with a grade of at least B-.","upper":true},{"key":"RTF 370","name":"Film Analysis and Criticism","description":"Restricted to radio-television-film majors. Analysis of critical methods, selected films, and selected critics. Three lecture hours a week for one semester, with two hours of film screening a week if required by the topic.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, Radio-Television-Film 314 or 316, and nine additional semester hours of lower-division coursework in radio-television-film.","upper":true},{"key":"RTF 178","name":"Radio-Television-Film Internship","description":"Restricted to radio-television-film majors. Practical work experience related to the study of film, television, radio, or other media. Students must make their own arrangements to secure relevant internships. The equivalent of ten lecture hours a week for one semester. May be repeated, but only one hour may be counted toward the Bachelor of Science in Radio-Television-Film. Offered on the pass/fail basis only. Prerequisite: Radio-Television-Film 330L and consent of the internship coordinator.","upper":true},{"key":"RTF 378H","name":"Honors Tutorial Course","description":"Restricted to radio-television-film majors. Intensive reading, research, and/or production project. Individual instruction. May be repeated once for credit. Prerequisite: Upper-division standing, twelve semester hours of lower-division coursework in radio-television-film, a University grade point average of at least 3.00, a grade point average in radio-television- film of at least 3.50, and consent of the department.","upper":true}]