[{"key":"ALD 301C","name":"Freshman Seminar","description":"Restricted to first-semester freshmen. Small-group seminar involving reading, discussion, writing, and oral reports. Introduction to University resources, including libraries, computer and research facilities, and museums. Several sections are offered each semester, with various topics and instructors. Two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"ALD 301D","name":"Connecting Research Experience","description":"Restricted to freshmen and sophomores. Supervised research associated with the Connexus Bridging Disciplines Program. The equivalent of three lecture hours a week for one semester. With consent of the Connexus Bridging Disciplines Program, may be repeated for credit. Prerequisite: Admission to the Connexus Bridging Disciplines Program.","upper":false},{"key":"ALD 320C","name":"Connecting Research Experience","description":"Supervised research associated with the Connexus Bridging Disciplines Program. The equivalent of three lecture hours a week for one semester. With consent of the Connexus Bridging Disciplines Program, may be repeated for credit. Prerequisite: Upper-division standing and admission to the Connexus Bridging Disciplines Program.","upper":true},{"key":"ALD 321","name":"Play in Early Childhood Development","description":"Theoretical and empirical bases for observing children in play; cognitive, social, and communicative stages related to developmental theory; children's adjustment related to social and emotional theories; motivational value of play. Three lecture hours a week for one semester, with field hours to be arranged. Prerequisite: Three semester hours of coursework in psychology.","upper":true},{"key":"ALD 322","name":"Individual Differences","description":"Introduction to individual differences among people through the life span. Examines areas of exceptionality within the context of typical development: current research trends; theoretical and legal considerations; and practice-related issues, including family involvement, cultural and linguistic diversity, and educational perspectives. Orientation to assistive technology. Three lecture hours a week for one semester, with field hours to be arranged. Prerequisite: Three semester hours of coursework in psychology.","upper":true},{"key":"ALD 323","name":"Language Acquisition","description":"Language structure; sequence, process, cognitive and social aspects of language acquisition and use; language variation. Three lecture hours a week for one semester. Required for certification in early childhood education. Prerequisite: Three semester hours of coursework in psychology.","upper":true},{"key":"ALD 324","name":"Literacy Acquisition","description":"Processes of becoming literate; cognitive insights that move a child to literacy; relationships between reading and writing and among individual characteristics, social factors, and literacy growth. Three lecture hours a week for one semester. This course or Psychology 338K is required for the reading specialization. Prerequisite: Three semester hours of coursework in psychology.","upper":true},{"key":"ALD 325","name":"Second Language Acquisition","description":"Acquisition by children or adults of English as a second language. Simultaneous acquisition of two languages, adding a second language, language processing, order of acquisition, role of the first language. Three lecture hours a week for one semester, with field hours to be arranged. Required for certification in bilingual education. Applied Learning and Development 325 and 329 may not both be counted. Prerequisite: Three semester hours of coursework in psychology.","upper":true},{"key":"ALD 326","name":"Language of Children with and without Disabilities","description":"Restricted to special education majors. Physiological, prelinguistic, and linguistic components of language; theoretical framework of communication and language development in monolingual and bilingual populations; problems of language development in special populations; language assessment tools. Technological skills component. Three lecture hours a week for one semester. Required for certification in generic special education.","upper":true},{"key":"ALD 327","name":"Sociocultural Influences on Learning","description":"Human learning in multisocial, multilingual, and multicultural contexts; realities of society and their impact on learning; social concerns such as prejudice, stereotyping, cross-cultural attitudes, bilingual issues, parent and community involvement. Three lecture hours a week for one semester, with field hours to be arranged. Only one of the following may be counted: African and African Diaspora Studies 374D (Topic: Sociocultural Influences on Learning), 372D (Topic 2), Applied and Learning Development 327. Prerequisite: Three semester hours of coursework in psychology.","upper":true},{"key":"ALD 328","name":"Applied Human Learning","description":"Development, cognition, language, and sociocultural influences in learning contexts; child assessment, identification of learning styles, and tests and measurements. Fieldwork to provide a theoretical basis for professional assessment, referral, and placement. Three lecture hours a week for one semester, with fieldwork to be arranged. Prerequisite: Admission to the professional development sequence of the Bachelor of Science in Applied Learning and Development degree program.","upper":true},{"key":"ALD 329","name":"Acquisition of Language and Literacies","description":"Subjects include initial language and literacy acquisition theory; second language acquisition theory; relations among first and additional languages in literacy and language acquisition; home, school, and learners' perspectives; and current issues in literacy and multilingual classrooms. Three lecture hours a week for one semester. Additional fieldwork hours may be required. Applied Learning and Development 325 and 329 may not both be counted. Required for students seeking certification in early childhood through grade six generalist. Prerequisite: Three semester hours of coursework in psychology and completion of or concurrent enrollment in Applied Learning and Development 327.","upper":true},{"key":"ALD 330","name":"Language in Education","description":"Theoretical and practical perspectives on the nature of language in education, with a focus on implications for English language learners in classroom settings; linguistic structures and functions; discourse, phonology, morphology, syntax, and semantics across languages and throughout development; and language varieties. Three lecture hours a week for one semester.  Additional fieldwork hours may be required. Applied Learning and Development 330 and Curriculum and Instruction 371 (Topic 13: Applied Linguistics and Methods in English as a Second Language) may not both be counted. Prerequisite: Three semester hours of coursework in psychology.","upper":true},{"key":"ALD 333","name":"Children's Literature","description":"For future teachers, an investigation of literature written for children from early childhood through age twelve. Includes an investigation of genres, authors, themes, and forms, and an introduction to ways of bringing literature to children, facilitated by extensive discussion. Three lecture hours a week for one semester, with field hours to be arranged.","upper":true}]