[{"key":"G E 206D","name":"Supplemental Instruction for Chemistry 301","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Chemistry 301. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Chemistry 301.","upper":false},{"key":"G E 206E","name":"Supplemental Instruction for Chemistry 302","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Chemistry 302. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Chemistry 302.","upper":false},{"key":"G E 207C","name":"Supplemental Instruction for Mathematics 408C","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Mathematics 408C. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Mathematics 408C.","upper":false},{"key":"G E 207D","name":"Supplemental Instruction for Mathematics 408D","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Mathematics 408D. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Mathematics 408D.","upper":false},{"key":"G E 207E","name":"Supplemental Instruction for Mathematics 340L","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Mathematics 340L. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Mathematics 340L.","upper":false},{"key":"G E 207K","name":"Supplemental Instruction for Mathematics 427K","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Mathematics 427K. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Mathematics 427K.","upper":false},{"key":"G E 207L","name":"Supplemental Instruction for Mathematics 427L","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Mathematics 427L. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Mathematics 427L.","upper":false},{"key":"G E 207R","name":"Supplemental Instruction for Mathematics 408K","description":"Restricted to engineering students.  Four lecture hours a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Mathematics 408K.","upper":false},{"key":"G E 207S","name":"Supplemental Instruction for Mathematics 408L","description":"Restricted to engineering students.  Four lecture hours a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Mathematics 408L.","upper":false},{"key":"G E 207T","name":"Supplemental Instruction for Mathematics 408M","description":"Restricted to engineering students.  Four lecture hours a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Mathematics 408M.","upper":false},{"key":"G E 208K","name":"Supplemental Instruction for Physics 303K","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Physics 303K. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Physics 303K.","upper":false},{"key":"G E 208L","name":"Supplemental Instruction for Physics 303L","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Physics 303L. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Physics 303L.","upper":false},{"key":"G E 209","name":"Supplemental Instruction for Engineering Courses","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in selected engineering courses. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":false},{"key":"G E 212","name":"Supplemental Instruction for Electrical Engineering 312","description":"Restricted to engineering students. Development of problem-solving skills in the material covered in Electrical Engineering 312. Two two-hour laboratory sessions a week for one semester. May not be counted toward any engineering degree. Prerequisite: Concurrent enrollment in Electrical Engineering 312.","upper":false},{"key":"G E 222","name":"Topics in Professional Development","description":"Restricted to engineering students. Small-group seminar involving reading, discussion, and oral reports. Two lecture hours a week for one semester. Engineering Studies 222 and General Engineering 222 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Offered on the pass/fail basis only.","upper":true}]