[{"key":"T D 301 (TCCN: DRAM 1310)","name":"Introduction to Theatre","description":"Open to all University students except majors in the Department of Theatre and Dance. A study of theatrical texts and practices of the past and present. Three lecture hours a week for one semester; attendance at all major productions of the department is required.","upper":false},{"key":"T D 303","name":"Fundamentals of Acting","description":"Not open to theatre and dance majors. Basic principles of acting and practical work in scenes from plays. Three lecture hours a week for one semester. Theatre and Dance 303 and 313C may not both be counted.","upper":false},{"key":"T D 303C (TCCN: DRAM 2336)","name":"Training the Speaking Voice","description":"Restricted to non-theatre and dance majors. Exercising the fundamental principles of vocal production and speech. Three lecture hours a week for one semester.","upper":false},{"key":"T D 303V","name":"Acting for Voice Performance Majors I","description":"Fundamental inquiry into the acting process. Three lecture hours a week for one semester. Prerequisite: A major in voice performance in the Butler School of Music.","upper":false},{"key":"T D 303W","name":"Acting for Voice Performance Majors II","description":"Techniques for playing and shaping action within scene structures. Three lecture hours a week for one semester. Prerequisite: Theatre and Dance 303V.","upper":false},{"key":"T D 306","name":"Introduction to Improvisational Drama","description":"General introduction to improvisational activities with application to the theatre. Three lecture hours a week for one semester.","upper":false},{"key":"T D 109C","name":"Musical Theatre Performing Ensemble","description":"Restricted to Department of Theatre and Dance majors. Rehearsing and performing solo and group numbers from musical theatre and other genres in cabaret-style entertainment and musical revues for on- and off-campus events. Three laboratory hours a week for one semester, with additional laboratory hours to be arranged. Theatre and Dance 109C and 113P, 213P, 313P may not both be counted. May be repeated for credit. Prerequisite: Consent of Instructor.","upper":false},{"key":"T D 109D","name":"Studio Voice I","description":"Restricted to Department of Theatre and Dance majors. Establishes foundational vocal technique for musical theatre singing. Develops successful vocal practice strategies and effective, healthy technique through the study of a comprehensive range of musical theatre styles including musical comedy, Golden Age musical drama, and concept and rock musicals. One laboratory hour a week for one semester, with additional laboratory hours to be arranged.  May be repeated for credit. Prerequisite: Consent of Instructor.","upper":false},{"key":"T D 109E","name":"Studio Voice II","description":"Restricted to Department of Theatre and Dance majors. Continuation of Theatre and Dance 109D. Focus on vocal range, flexibility, and endurance. Text analysis through the study of music and lyrics, using these components as the basis of character development. One laboratory hour a week for one semester, with additional laboratory hours to be arranged.  May be repeated for credit. Prerequisite: Two semesters of Theatre and Dance 109D and consent of instructor.","upper":false},{"key":"T D 311","name":"Languages of the Stage","description":"Introduction to the ways that performance communicates meaning, as a foundation for further study in theatre and dance. Three lecture hours a week for one semester. Prerequisite: A major in the Department of Theatre and Dance or consent of instructor.","upper":false},{"key":"T D 112","name":"Freshman Movement and Physical Conditioning","description":"Restricted to Department of Theatre and Dance majors. Principles and techniques of physical conditioning. One lecture hour and one laboratory hour a week for one semester.  May be repeated for credit. Prerequisite: Consent of the dance faculty.","upper":false},{"key":"T D 312M","name":"Movement Improvisation","description":"Exploration and study of elements of movement design. Three hours a week for one semester, with additional laboratory hours as required.  May be repeated for credit. Prerequisite: A major in the Department of Theatre and Dance.","upper":false},{"key":"T D 312N","name":"Movement Composition","description":"Continuation of Theatre and Dance 312M. Three hours a week for one semester, with additional laboratory hours as required. Prerequisite: Theatre and Dance 312M or consent of instructor.","upper":false},{"key":"T D 313C (TCCN: DRAM 1351)","name":"Acting I","description":"Restricted to Department of Theatre and Dance majors. Approaches to incorporating Stanislavski-based principles in acting, including dramatic action, given circumstances, subtext, sense memory, the magic if, and tempo/rhythm. Three lecture hours a week for one semester, with additional hours to be arranged.","upper":false},{"key":"T D 313D (TCCN: DRAM 1352)","name":"Acting II","description":"Restricted to Department of Theatre and Dance majors. Continuation of Acting I. Application of Stanislavksi-based principles to scene work selected from realistic genres. Three lecture hours a week for one semester, with additional hours to be arranged. Prerequisite: Theatre and Dance 313C.","upper":false},{"key":"T D 313E (TCCN: DRAM 2351)","name":"Acting III","description":"Restricted to Department of Theatre and Dance majors. Continuation of Acting II, with greater emphasis on personalization of character needs, given circumstances, actor-to-actor communication, and emotional life. Three lecture hours a week for one semester, with additional hours to be arranged. Prerequisite: Theatre and Dance 313D.","upper":false},{"key":"T D 313F","name":"Voice and Movement I","description":"Understanding the relationship between voice and body in acting, with a focus on freeing tension, releasing vocal power, and enabling physical expression. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: A major in acting or consent of instructor.","upper":false},{"key":"T D 313G","name":"Voice and Movement II","description":"Continuation of Voice and Movement I. Deeper understanding of the vocal-physical connection as a means of playing dramatic action. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: Theatre and Dance 313F.","upper":false},{"key":"T D 313K","name":"Voice Laboratory I","description":"Advanced voice and speech work in breath, support, placement, focus, range, resonance, articulation and endurance. Emphasis placed on personalization of language and text from selected plays. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: Theatre and Dance 313G or consent of instructor.","upper":false},{"key":"T D 313L","name":"Voice Laboratory II","description":"Continuation of Voice Laboratory I. Advanced voice and speech work connected to personalization and truth in classical and heightened text. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: Theatre and Dance 313K.","upper":false},{"key":"T D 313M","name":"Movement Laboratory I","description":"Using the body as an instrument for playing action and bringing the actor to a deeper understanding of physical stage presence. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: Theatre and Dance 313G or consent of instructor.","upper":false},{"key":"T D 313N","name":"Movement Laboratory II","description":"Continuation of Movement Laboratory I. The practice of physical theatre disciplines as a means of deepening the actor's understanding of character and behavior. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: Theatre and Dance 313M.","upper":false},{"key":"T D 314C (TCCN: DRAM 1330)","name":"Design for Performance","description":"Introduction to the techniques, practices, and processes in costume, lighting, scenic, and sound design. Three lecture hours a week for one semester, with laboratory hours as required. Prerequisite: A major in the Department of Theatre and Dance.","upper":false},{"key":"T D 314M (TCCN: DRAM 2331)","name":"Technical Theatre","description":"Introduction to the techniques, practices, and processes in technical theatre. Three lecture hours a week for one semester, with laboratory hours as required. Prerequisite: A major in the Department of Theatre and Dance.","upper":false},{"key":"T D 314P (TCCN: DRAM 1320)","name":"Production Laboratory","description":"Three hours a week for one semester and additional laboratory hours as required.  May be repeated for credit. Prerequisite: A major in the Department of Theatre and Dance; and Theatre and Dance 314M, except for dance majors in the BFA degree program.","upper":false},{"key":"T D 315","name":"Playwriting I","description":"The study and practice of writing plays. Three lecture hours a week for one semester.","upper":false},{"key":"T D 317C (TCCN: DRAM 2361)","name":"Theatre History through the Eighteenth Century","description":"Three lecture hours a week for one semester. Prerequisite: For theatre and dance majors, Theatre and Dance 311; for others, none.","upper":false},{"key":"T D 317D (TCCN: DRAM 2362)","name":"Theatre History since the Eighteenth Century","description":"Three lecture hours a week for one semester. Prerequisite: For theatre and dance majors, Theatre and Dance 311; for others, none.","upper":false},{"key":"T D 317M","name":"Dance History I","description":"An exploration of world dance as an expression of cultural identity and change. Three lecture hours a week for one semester. Prerequisite: Theatre and Dance 311.","upper":false},{"key":"T D 317N","name":"Dance History II","description":"Continuation of Theatre and Dance 317M. Three lecture hours a week for one semester. Prerequisite: Theatre and Dance 317M.","upper":false},{"key":"T D 322","name":"Dance Pedagogy","description":"Techniques and materials used in the teaching of dance. Two lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"T D 322C","name":"Contemporary Dance Technique","description":"Intensive study of principles, technique, and vocabulary of contemporary dance. Six laboratory hours a week for one semester. May not be counted toward the Bachelor of Fine Arts degree with a major in dance. May be repeated for credit. Prerequisite: A major in the Department of Theatre and Dance and consent of the dance faculty.","upper":true},{"key":"T D 322D","name":"Intermediate Contemporary Dance Technique","description":"Intensive study of intermediate-level theory, technique, and vocabulary of contemporary dance. Six laboratory hours a week for one semester. May not be counted toward the Bachelor of Fine Arts degree with a major in dance. May be repeated for credit. Prerequisite: A major in the Department of Theatre and Dance and consent of the dance faculty.","upper":true},{"key":"T D 322E","name":"Advanced Contemporary Dance Technique","description":"Intensive study of advanced theory, technique, and style of contemporary dance. Six laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: A major in the Department of Theatre and Dance and consent of the dance faculty.","upper":true},{"key":"T D 322F","name":"Ballet Technique","description":"Intensive study of principles, technique, and vocabulary of ballet. Six laboratory hours a week for one semester. May not be counted toward the Bachelor of Fine Arts degree with a major in dance. May be repeated for credit. Prerequisite: A major in the Department of Theatre and Dance and consent of the dance faculty.","upper":true},{"key":"T D 322G","name":"Intermediate Ballet Technique","description":"Study of intermediate-level theory, technique, and vocabulary of ballet as a supporting style. Six laboratory hours a week for one semester. May not be counted toward the Bachelor of Fine Arts degree with a major in dance. May be repeated for credit. Prerequisite: A major in the Department of Theatre and Dance and consent of the dance faculty.","upper":true},{"key":"T D 322J","name":"Advanced Ballet Technique","description":"Study of advanced theory, technique, and vocabulary of ballet as a supporting style. Six laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: A major in the Department of Theatre and Dance and consent of the dance faculty.","upper":true},{"key":"T D 323C","name":"Directing I","description":"Study and practice of the fundamentals of stage directing: composition, picturization, movement, gesture, and unit structure. Three lecture hours a week for one semester, with laboratory hours as required. Prerequisite: Upper-division standing and a major in the Department of Theatre and Dance.","upper":true},{"key":"T D 323D","name":"Directing II","description":"Dramatic and environmental analysis of full-length plays. Three lecture hours a week for one semester, with laboratory hours as required. Prerequisite: Theatre and Dance 323C.","upper":true},{"key":"T D 323E","name":"Directing III","description":"Theory and techniques of play directing, with practical applications in projects and scenes. Three lecture hours a week for one semester, with laboratory hours as required. Prerequisite: Upper-division standing, Theatre and Dance 323D, and consent of instructor.","upper":true},{"key":"T D 323F","name":"Acting Shakespeare","description":"Incorporating language as action by applying basic acting principles to the demand of Shakespearean text. Three laboratory hours a week for one semester, with additional hours to be arranged. Theatre and Dance 323F and 353T (Topic: Acting Shakespeare) may not both be counted. Prerequisite: Theatre and Dance 313E or consent of instructor.","upper":true},{"key":"T D 323G","name":"Acting in Period Plays","description":"Exploration of classical and idiosyncratic texts to enable personal and artistic growth in actors. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: Upper-division standing, and Theatre and Dance 323F or consent of instructor.","upper":true},{"key":"T D 324","name":"Design and Technology for Performance","description":"Exploration of aspects of design and technology in performance, including costume, lighting, scenery, and sound. Three lecture hours a week for one semester, with laboratory hours as required.  May be repeated for credit. Prerequisite: Theatre and Dance 314C, 314M, and consent of instructor.","upper":true},{"key":"T D 325","name":"Playwriting II","description":"Emphasis on the form and writing of the full-length play or equivalent. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, Theatre and Dance 315, and consent of instructor.","upper":true},{"key":"T D 326","name":"Dramatic Activities for the Classroom","description":"Theory, materials, and practice, including story dramatization, storytelling, puppets, pantomime, shadow plays, role-playing, and theatre games. Three lecture hours a week for one semester, with laboratory hours as required. Prerequisite: Upper-division standing.","upper":true},{"key":"T D 326C","name":"Theatre Studies: Creative Drama","description":"Theory and practice of creative drama for children, both as an art form and as a process for emphasizing creative expression and aesthetic growth. Three lecture hours a week for one semester, with laboratory hours as required. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"T D 326D","name":"Theatre Studies: Theatre for Young Audiences","description":"Theory and practice of all phases of play production for young audiences. Three lecture hours a week for one semester, with laboratory hours as required. Prerequisite: Upper-division standing.","upper":true},{"key":"T D 329C","name":"Musical Theatre Performance Workshop","description":"Restricted to Department of Theatre and Dance majors. Private coaching, master classes, and small and large group rehearsals, culminating in staged public performances of musical revues and/or chamber musicals. Three laboratory hours a week for one semester, with additional hours to be arranged.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"T D 129D","name":"Studio Voice III","description":"Restricted to Department of Theatre and Dance majors. Continuation of Theatre and Dance 109E. Emphasizes the synthesis of singing and acting skills. One laboratory hour a week for one semester, with additional laboratory hours to be arranged.  May be repeated for credit. Prerequisite: Upper-division standing, two semesters of Theatre and Dance 109E, and consent of instructor.","upper":true},{"key":"T D 129E","name":"Studio Voice IV","description":"Restricted to Department of Theatre and Dance majors. Continuation of Theatre and Dance 129D. Refines, expands, and strengthens the specialized performance skills required of a musical theatre performer, including studio recording techniques. One laboratory hour a week for one semester, with additional laboratory hours to be arranged.  May be repeated for credit. Prerequisite: Upper-division standing and two semesters of Theatre and Dance 109D.","upper":true},{"key":"T D 332M","name":"Choreography","description":"Advanced study of the principles and practices of choreography. Three hours a week for one semester, with additional laboratory hours as required.  May be repeated for credit. Prerequisite: Upper-division standing, Theatre and Dance 312N, and consent of instructor.","upper":true},{"key":"T D 332N","name":"Choreography: Design for Dance and Movement Theatre","description":"Continuation of Theatre and Dance 332M. Three hours a week for one semester, with additional laboratory hours as required.  May be repeated for credit. Prerequisite: Theatre and Dance 332M.","upper":true},{"key":"T D 332R","name":"Dance Pedagogy Theory","description":"Principles, techniques, and materials used in the teaching of dance. Three lecture hours a week for one semester; with additional laboratory hours to be arranged.  May be repeated for credit. Prerequisite: Upper-division standing, a major in the Department of Theatre and Dance, and consent of the dance faculty instructor.","upper":true},{"key":"T D 332S","name":"Dance Pedagogy Practicum","description":"Practical application techniques and materials used in the teaching of dance. Four and one-half laboratory hours a week for one semester, with additional hours as required.  May be repeated for credit. Prerequisite: Upper-division standing, Theatre and Dance 332R, a major in the Department of Theatre and Dance, and consent of the dance faculty.","upper":true},{"key":"T D 351S","name":"Seminar in Theatre and Dance","description":"Three lecture hours a week for one semester. Prerequisite: Completion of at least ninety semester hours of coursework, a major in the Department of Theatre and Dance, and consent of instructor.","upper":true},{"key":"T D 352","name":"Experiential Anatomy","description":"Restricted to Department of Theatre and Dance majors. Principles and techniques of physical conditioning with practical applications to injury prevention for dance and theatre practitioners. Three laboratory hours a week for one semester, with additional hours to be arranged.  May be repeated for credit. Prerequisite: Upper-division standing, Theatre and Dance 232P (or 332P), and consent of the dance faculty.","upper":true},{"key":"T D 353C","name":"Devised Work","description":"A survey of contemporary devising techniques. Work explores present-day parallels for making performance for both individual and collaborative practices. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: Upper-division standing, and Theatre and Dance 323G or consent of instructor.","upper":true},{"key":"T D 353D","name":"Acting for the Camera I","description":"Fundamentals of acting for the camera; adjusting from the stage to the demands of the camera. Six laboratory hours a week for one semester. Theatre and Dance 351T (Topic: Acting for the Camera) and 353D may not both be counted. Prerequisite: For Bachelor of Fine Arts in Acting majors, upper-division standing and Theatre and Dance 353C; for others, upper-division standing, and Theatre and Dance 313E with a grade of at least B- or consent of instructor.","upper":true},{"key":"T D 353E","name":"Acting for the Camera II","description":"Advanced technique for the camera. Professional audition protocols and career preparation. Six laboratory hours a week for one semester. Theatre and Dance 351T (Topic: Acting for the Camera II) and 353E may not both be counted. Prerequisite: Upper-division standing and Theatre and Dance 353D.","upper":true},{"key":"T D 353K","name":"Voice-Over and Narration","description":"Microphone technique and the use of the voice to create character in various media applications such as narration, video games, and commerical copy. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: Upper-division standing; and Theatre and Dance 313L and 323F, or consent of instructor.","upper":true},{"key":"T D 353Q","name":"Portfolio Preparation","description":"Restricted to Bachelor of Fine Arts in Acting majors. Selection and rehearsal of materials in preparation for professional acting interviews and auditions. Three laboratory hours a week for one semester, with additional hours to be arranged. Prerequisite: Upper-division standing.","upper":true},{"key":"T D 353R","name":"Business of Acting","description":"Restricted to majors in the Department of Theatre and Dance. Survey of marketing oneself as an actor, the actor's relationship to agents and casting directors, and methods for initiating and maintaining a professional acting career. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"T D 353T","name":"Topics in Acting and Directing","description":"Restricted to majors in the Department of Theatre and Dance. Topics in acting including voice/speech, movement, and directing. Three lecture hours a week for one semester, with additional hours to be arranged.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, and Theatre and Dance 313E with a grade of at least B - or consent of the acting/directing faculty.","upper":true},{"key":"T D 354T","name":"Topics in Design and Technology","description":"Three lecture hours a week for one semester, with laboratory hours as required.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"T D 355T","name":"Topics in Playwriting","description":"Three lecture hours a week for one semester, with laboratory hours as required.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"T D 356T","name":"Topics in Theatre Studies","description":"Topics in theatre studies, including creative drama, theatre for children and youth, and theatre with young adults. Three lecture hours a week for one semester, with laboratory hours as required.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true}]