[{"key":"MNS 307 (TCCN: GEOL 1345)","name":"Introduction to Oceanography","description":"Introduction to the sciences of oceanography: geological, physical, and biological. Two lecture hours and two laboratory hours a week for one semester. Marine Sciences 307 and Geological Sciences 307 may not both be counted. Offered on the letter-grade basis only.","upper":false},{"key":"MNS 308","name":"Humans and a Changing Ocean","description":"The consequences of human-induced alteration of the marine environment including the impact on fisheries, marine mammals, food-web changes, and changes in species composition and ecological function will be explored. Designed for non-science majors. Two lecture hours and two laboratory hours a week for one semester. Marine Sciences 309 (Topic: Humans and a Changing Ocean) and 308 may not both be counted. Offered on the letter-grade basis only. Prerequisite: Marine Sciences 307.","upper":false},{"key":"MNS 309","name":"Topics in Marine Science","description":"Designed for nonscience majors. Selected topics in marine science, including marine biology, marine chemistry, and physical oceanography. Two lecture hours and one and one-half laboratory hours a week for one semester. May not be counted toward a degree in marine science. May be repeated for credit when the topics vary. Prerequisite: Marine Sciences 307.","upper":false},{"key":"MNS 310","name":"Fundamentals of Marine Science","description":"Designed for students pursuing a degree option in Marine and Freshwater Science. In-depth introduction to physical, chemical, geological, and biological processes in marine systems. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Biology 311D and Chemistry 302 or 302H.","upper":false},{"key":"MNS 320","name":"Marine Ecology","description":"Study of ecological processes at different levels of integration in marine ecosystems. Three lecture hours a week for one semester. Prerequisite: Biology 311D, and Chemistry 302 or 302H.","upper":true},{"key":"MNS 120L","name":"Laboratory Studies in Marine Ecology","description":"A laboratory course with two weekend field trips to the Marine Science Institute at Port Aransas to perform ecological studies in the Texas coastal zone. Two weekend field trips, with pre- and post-field trip laboratory hours required. Prerequisite: Credit or registration for Marine Sciences 320.","upper":true},{"key":"MNS 440","name":"Limnology and Oceanography","description":"Same as Biology 456L. An introduction to the study of the interactions between aquatic organisms and their environments. Two lecture hours and six laboratory hours a week for one semester. Prerequisite: Biology 325 or 325H with a grade of at least C-, and Chemistry 302 or 302H.","upper":true},{"key":"MNS 344K","name":"Marine Mining and Minerals","description":"Same as Geological Sciences 344K. Overview of seafloor mineral deposits, their exploration, and mining. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Geological Sciences or the Bachelor of Science in Environmental Sciences degrees. Prerequisite: Geological Sciences 401 or 303, 416K, and 416M.","upper":true},{"key":"MNS 352","name":"Principles of Marine Science","description":"Lectures, laboratory, and fieldwork. The equivalent of three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"MNS 352C","name":"Estuarine Ecology","description":"General ecological principles of estuarine environments in Texas, including physiography, hydrography, and plant and animal community structure and productivity. Requires several field trips in addition to lecture hours, including one weekend trip. Marine Sciences 352 (Topic 8: Estuarine Ecology) and 352C may not both be counted. Offered on the letter-grade basis only. Prerequisite: Upper-division standing and six semester hours of coursework in biology, chemistry, geological sciences, or physics.","upper":true},{"key":"MNS 352D","name":"Marine Botany","description":"Exploration of the marine algae and seagrasses of the south Texas coast, with emphasis on their taxonomy, physiology, and ecology; field trips to representative coastal habitats. Requires several field trips in addition to lecture hours, including one weekend trip.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing; one of the following courses: Biology 322, 324, 325 or 325H, 328, Marine Sciences 352C; and three additional semester hours of coursework in biology.","upper":true},{"key":"MNS 353","name":"Topics in Marine Science","description":"Two lecture hours and one laboratory hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"MNS 354","name":"Marine Invertebrates","description":"Study of invertebrate taxonomy, structure, behavior, and ecology, with emphasis on field sampling and laboratory studies of invertebrate habitats of the Texas coast. One lecture hour and four laboratory/field hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and six semester hours of biology coursework.","upper":true},{"key":"MNS 354C","name":"Biology of Fishes","description":"Anatomy, physiology, behavior, life history, taxonomy, and distribution of fishes, with emphasis on field sampling and laboratory studies of the coastal biota. Requires several field trips in addition to lecture hours, including one weekend trip. Prerequisite: Upper-division standing, six semester hours of coursework in biological sciences, or consent of instructor.","upper":true},{"key":"MNS 354E","name":"Aquatic Microbiology","description":"Ecology, physiology, distribution, and growth of heterotrophic and autotrophic bacteria and fungi in waters and sediments. Three lecture hours a week for one semester. Marine Sciences 354E and 384E may not both be counted. Prerequisite: Biology 311D, Chemistry 302 or 302H, and consent of instructor.","upper":true},{"key":"MNS 354F","name":"Marine Geology","description":"Survey of the origin, structure, stratigraphy, and sedimentology of marine basins and continental margins. Three lecture hours a week for one semester. Marine Sciences 354F and 384F may not both be counted. Prerequisite: Upper-division standing; and six semester hours of coursework in chemistry, marine science, or geological sciences, or consent of instructor.","upper":true},{"key":"MNS 354J","name":"Marine Chemistry","description":"Introduction to marine and environmental chemistry, including the distribution of elements in seawater, the geochemical and oceanographic processes controlling and affected by these distributions, and the effects of human activities on marine chemical processes. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and Chemistry 301 and 302; or consent of instructor.","upper":true},{"key":"MNS 354Q","name":"Marine Environmental Science","description":"Application of the principles of marine science to the study of environmental issues: toxicology, biogeochemical cycles, and biological and ecological impacts of zenobiotic materials in the coastal zone. One lecture hour and four laboratory/field hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing; Biology 311D; and Chemistry 302 or 302H.","upper":true},{"key":"MNS 354T","name":"Biological Oceanography","description":"Introduction to the organisms in the sea, their adaptations to the environment, and the factors that control their distribution and abundance. The course emphasizes laboratory and field work with organisms found in the coastal waters of Texas. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and Biology 311D.","upper":true},{"key":"MNS 355C","name":"Physiology of Fishes","description":"Physiology of major organ systems of both marine and freshwater fishes. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; and Biology 311D, and Chemistry 302 or 302H, or consent of instructor.","upper":true},{"key":"MNS 356","name":"Ecosystem Oceanography","description":"An exploration of interconnections within and among marine ecosystems as well as their linkages to climate, human activity, and adjacent freshwater and terrestrial environments. Emphasis will be placed on Gulf of Mexico ecosystems and students will directly investigate linkages among agricultural landscapes, rivers, estuaries, and the open ocean through a variety of hands-on field and laboratory activities. One lecture hour and four laboratory/field hours a week for one semester. Marine Sciences 352 (Topic: Ecosystem Oceanography) and 356 may not both be counted. Offered on the letter-grade basis only. Prerequisite: Upper-division standing; Biology 311D; and Chemistry 302 or 302H","upper":true},{"key":"MNS 357","name":"Marine Phytoplankton Diversity","description":"The taxonomy of the major phytoplankton groups, their physiology, and their role in marine ecosystems will be explored. Investigating the composition and distribution of planktonic algae and how they respond to environmental change through combination of field sampling, lectures, and practical laboratory exercises. An introduction to sampling regimes, identification techniques, counting methods, and a variety of modern analytical tools used to study phytoplankton. One lecture hour and four lab/field hours a week for one semester. Marine Sciences 353 (Topic: Diversity Marine Phytoplankton) and 357 may not both be counted. Offered on the letter-grade basis only. Prerequisite: Upper-division standing; Biology 311D; and Chemistry 302 or 302H.","upper":true},{"key":"MNS 367K","name":"Human Exploration and Exploitation of the Sea","description":"Review of the history of ocean exploration including major oceanographic expeditions. Discussion of current topics in ocean exploration and exploitation of marine resources, the impact of resource exploitation on biological systems, and the development of marine policy. An oral presentation is required. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and Marine Sciences 307 with a grade of at least B-.","upper":true}]