[{"key":"E E 302 (TCCN: ENGR 2305)","name":"Introduction to Electrical Engineering","description":"The scope and nature of professional activities of electrical engineers, including problem-solving techniques; analysis and design methods; engineering professional ethics; analysis of analog resistive circuits, including Thevenin/Norton equivalents, mesh analysis, and nodal analysis; and operational amplifiers (DC response). Substantial teamwork is required for laboratory work in this course. Three lecture hours and two laboratory hours a week for one semester. Electrical Engineering 302 and 302H may not both be counted. Prerequisite: Credit with a grade of at least C- or registration for Mathematics 408C or 408K.","upper":false},{"key":"E E 302H","name":"Introduction to Electrical Engineering: Honors","description":"Restricted to students in the Engineering Honors Program. The scope and nature of professional activities of electrical engineers, including problem-solving techniques; analysis and design methods; engineering professional ethics; analysis of analog resistive circuits, including Thevenin/Norton equivalents, mesh analysis, and nodal analysis; and operational amplifiers (DC response). Three lecture hours and two laboratory hours a week for one semester. Electrical Engineering 302 and 302H may not both be counted. Prerequisite: Credit with a grade of at least C- or registration for Mathematics 408C or 408K.","upper":false},{"key":"E E 306","name":"Introduction to Computing","description":"Motivated, bottom-up introduction to computing; bits and operations on bits; number formats; arithmetic and logic operations; digital logic; the Von Neumann model of processing, including memory, arithmetic logic unit, registers, and instruction decoding and execution; introduction to structured programming and debugging; machine and assembly language programming; the structure of an assembler; physical input/output through device registers; subroutine call/return; trap instruction; stacks and applications of stacks. Three lecture hours and one recitation hour a week for one semester. Prerequisite: Credit with a grade of at least a C- or registration for Mathemathics 408C or 408K.","upper":false},{"key":"E E 309K","name":"Topics in Electrical Engineering","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":false},{"key":"E E 309S","name":"Development of a Solar-Powered Vehicle","description":"Analysis, design, and construction of a solar-powered car for national competitions involving other universities. Study of electrical, mechanical, and aerodynamic systems. Three lecture hours and three laboratory hours a week for one semester. Electrical Engineering 309K (Topic: Development of a Solar Car for NASC) and 309S may not both be counted.","upper":false},{"key":"E E 411","name":"Circuit Theory","description":"Capacitance and inductance; first- and second-order transient circuit response, including operational amplifier circuits; sinusoidal steady state analysis; Bode plots; complex power in single and balanced three-phase systems; transformers; two-port networks (Z-parameters and Y-parameters); and computer-aided analysis and design. Three lecture hours and two recitation hours a week for one semester. Prerequisite: Electrical Engineering 302 or 302H with a grade of at least C-; credit with a grade of at least C- or registration for Mathematics 427K; and credit with a grade of at least C- or registration for Physics 303L and 103N.","upper":false},{"key":"E E 312","name":"Software Design and Implementation I","description":"Basic problem solving, design and implementation techniques for imperative programming; structured programming in the C/C++ language; programming idioms; introduction to software design principles, including modularity, coupling and cohesion; introduction to software engineering tools; elementary data structures; asymptotic analysis. Three lecture hours and one recitation hour a week for one semester. Prerequisite: The following coursework with a grade of at least C-: Biomedical Engineering 303 or Electrical Engineering 306, and Electrical Engineering 319K.","upper":false},{"key":"E E 313","name":"Linear Systems and Signals","description":"Representation of signals and systems; system properties; sampling; Laplace and z-transforms; transfer functions and frequency response; convolution; stability; Fourier transform;  feedback; and control applications. Computer analysis using MATLAB. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 411, 331, or Biomedical Engineering 311 with a grade of at least C-; Mathematics 427K with a grade of at least C-; and credit with a grade of at least C- or registration for Mathematics 340L.","upper":false},{"key":"E E 316","name":"Digital Logic Design","description":"Boolean algebra; analysis and design of combinational and sequential logic circuits; state machine design and state tables and graphs; simulation of combinational and sequential circuits; applications to computer design; and introduction to hardware description languages (HDLs) and field-programmable gate arrays (FPGAs). Three lecture hours and one recitation hour a week for one semester. Prerequisite: Computer Science 429 or Electrical Engineering 306 with a grade of at least C-.","upper":false},{"key":"E E 319K","name":"Introduction to Embedded Systems","description":"Embedded systems; machine language execution; assembly and C language programming; local variables and subroutines; input/output synchronization; analog to digital conversion and digital to analog conversion; debugging; and interrupts. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Biomedical Engineering 303 or Electrical Engineering 306 with a grade of at least C-.","upper":false},{"key":"E E 321K","name":"Mixed Signal and Circuits Laboratory","description":"Digital and analog parametric testing of mixed-signal circuits and systems, including frequency response, harmonic and intermodulation, and noise behavior; use of system-level test equipment, including network analyzers, spectrum analyzers, and probe stations; coherent v. noncoherent measurements; design for testability. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 438 with a grade of at least C-; and credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 422C","name":"Software Design and Implementation II","description":"Methods for engineering software with a focus on abstraction; specification, design, implementation, and testing of object-oriented code using a modern development tool-set for complex systems; design and implementation of object-oriented programs in Java; abstract data types; inheritance; polymorphism; parameterized types and generic programming; the operation and application of commonly used data structures; exception handling and fault tolerance; introduction to algorithm analysis; teamwork models. Three lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Computer Science 312 or Electrical Engineering 312 with a grade of at least C-.","upper":true},{"key":"E E 325","name":"Electromagnetic Engineering","description":"Electrostatics and magnetostatics; properties of conductive, dielectric, and magnetic materials; solutions of Maxwell's equations; uniform plane wave applications; frequency- and time-domain analyses of transmission lines. Three lecture hours a week for one semester. Prerequisite: Physics 303L, 103N, and Mathematics 427K with a grade of at least C- in each, and credit with a grade of at least C- or registration for Mathematics 427L.","upper":true},{"key":"E E 325K","name":"Antennas and Wireless Propagation","description":"Solutions of time-varying Maxwell's equations with applications to antennas and wireless propagation; antenna theory and design, array synthesis; electromagnetic wave propagation, scattering, and diffraction; numerical methods for solving Maxwell's equations. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 325 with a grade of at least C-.","upper":true},{"key":"E E 325L","name":"Cooperative Engineering","description":"This course covers the work period of electrical and computer engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for three semesters. The student must complete Electrical Engineering 325LX, 325LY, and 325LZ before a grade and degree credit are awarded. May be repeated for credit. Prerequisite: For 325LX, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 325LY, Electrical Engineering 325LX and appointment for a full-time cooperative work tour; for 325LZ, Electrical Engineering 325LY and appointment for a full-time cooperative work tour.","upper":true},{"key":"E E 225M","name":"Cooperative Engineering","description":"This course covers the work period of electrical engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for two semesters. The student must complete Electrical Engineering 225MA and 225MB before a grade and degree credit are awarded. Prerequisite: For 225MA, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 225MB, Electrical Engineering 225MA and appointment for a full-time cooperative work tour.","upper":true},{"key":"E E 125N","name":"Cooperative Engineering","description":"This course covers the work period of electrical engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Electrical Engineering 325LZ or 225MB, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour.","upper":true},{"key":"E E 125S","name":"Internship in Electrical and Computer Engineering","description":"Practical work experience in industry or a research lab under the supervision of an engineer or scientist. Requires a substantial final report. At least ten hours of work a week, for a total of 150 hours a semester or summer session. May be repeated for credit, but only three hours may be counted toward an electrical engineering degree. Offered on the pass/fail basis only. Prerequisite: Consent of the undergraduate adviser.","upper":true},{"key":"E E 333T","name":"Engineering Communication","description":"Advanced engineering communication skills, with emphasis on technical documents, oral reports, and graphics; collaborative work involving online communication and research. Three lecture hours a week for one semester. Prerequisite: One of the following with a grade of at least C-: English 316L (or 316K), 316M (or 316K), 316N (or 316K), or 316P (or 316K).","upper":true},{"key":"E E 334K","name":"Quantum Theory of Engineering Electronic Materials","description":"Introduction to quantum mechanics; atoms and molecules; electron statistics; quantum theory of solids; electronic phenomena in semiconductors; and device applications based on these phenomena. Three lecture hours a week for one semester. Prerequisite: Mathematics 427K, Physics 303L, and 103N with a grade of at least C- in each.","upper":true},{"key":"E E 438","name":"Fundamentals of Electronic Circuits I Laboratory","description":"Analysis and design of electronic circuits using semiconductor devices. Basic device physics and small-signal modeling for diodes, bipolar junction transistors, and metal-oxide-semiconductor transistors; operation region and biasing; basic switching circuits; single-stage and multi-stage amplifier design and analysis; input and output impedance characteristics of amplifiers; frequency response; AC and DC coupling techniques; differential amplifiers and output stages. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 411 with a grade of at least C-; credit with a grade of at least C- or registration for Biomedical Engineering 343 or Electrical Engineering 313; and credit with a grade of at least C- or registration for one of the following: Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 438K","name":"Analog Electronics","description":"Analysis and design of analog electronic circuits; transistor models; single-ended amplifiers; differential amplifiers; operational amplifiers ; frequency response; feedback theory; stability analysis; circuit nonidealities; op-amp-based circuits; output stages; power amplifiers; passive and active analog filters; and relaxation oscillators. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 438 with a grade of at least C-.","upper":true},{"key":"E E 338L","name":"Analog Integrated Circuit Design","description":"Analysis and design of analog integrated circuits; transistor models; simple and advanced current mirrors; single-ended amplifiers; differential amplifiers; operational amplifiers; frequency response; feedback theory; stability analysis; circuit nonidealities and noise; output stages; analog filters. CAD tools for circuit analysis and design. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 438 with a grade of at least C-.","upper":true},{"key":"E E 339","name":"Solid-State Electronic Devices","description":"Semiconductor materials; atomic orbitals to energy band structure of semiconductors; charge carrier transport, electron-hole generation and recombination; p-n junctions and Schottky barriers; bipolar and filed-effect transistors; and introduction to optoelectronic devices. Three lecture hours a week for one semester. Prerequisite: Mathematics 427K, Physics 303L, and 103N with a grade of at least C- in each.","upper":true},{"key":"E E 339S","name":"Solar Energy Conversion Devices","description":"An investigation of basic principles of photovoltaic devices which convert light into charger carriers (electrons and holes).  Topics include electrons and holes in semiconductors, generation and recombination, junctions, analysis of the p-n junction, silicon and III-V semiconductor solar cell design and optimization, thin film solar cell technologies, managing light, strategies for higher efficiency, and a brief overview of non-photovoltaic approaches to solar energy conversion. Electrical Engineering 339S and 379K (Topic 4: Solar Energy Conversion Devices) may not both be counted. Prerequisite: Credit with a grade of at least C- or registration for Electrical Engineering 339.","upper":true},{"key":"E E 440","name":"Integrated Circuit Nanomanufacturing Techniques","description":"Integrated circuit processing; crystal growth and wafer preparation; epitaxial growth; oxidation, diffusion, and ion implantation; thin-film deposition techniques; and lithography and etching. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 339 with a grade of at least C-; and credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 341","name":"Electric Drives and Machines","description":"Fundamentals of electric machines. Electromechanical energy conversion; magnetic circuits, transformers, and energy conversion devices; and an introduction to power electronics. Motor drive fundamentals and applications. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 313 or 331 with a grade of at least C-.","upper":true},{"key":"E E 445L","name":"Embedded Systems Design Laboratory","description":"Design of microcontroller-based embedded systems; interfacing from both a hardware and software perspective; and applications, including audio, data acquisition, and communication systems. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 312 and 319K with a grade of at least C- in each; Electrical Engineering 411 and 313, or Biomedical Engineering 311 and 343, with a grade of at least C- in each; and credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 445M","name":"Embedded and Real-Time Systems Laboratory","description":"Embedded microcomputer systems; implementation of multitasking, synchronization, protection, and paging; operating systems for embedded microcomputers; design, optimization, evaluation, and simulation of digital and analog interfaces; real-time microcomputer software; and applications, including data acquisition and robotics. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 445L (or 345L) or 445S (or 345S) with a grade of at least C-; and credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 445S","name":"Real-Time Digital Signal Processing Laboratory","description":"Architectures of programmable digital signal processors; programming for real-time performance; design and implementation of digital filters, modulators, data scramblers, pulse shapers, and modems in real time; and interfaces to telecommunication systems. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 312 and 319K with a grade of at least C- in each; Biomedical Engineering 343 or Electrical Engineering 313 with a grade of at least C-; credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T; and credit with a grade of at least C- or registration for Biomedical Engineering 335 or Electrical Engineering 351K.","upper":true},{"key":"E E 347","name":"Modern Optics","description":"Modern optical wave phenomena with applications to imaging, holography, fiber optics, lasers, and optical information processing. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 313 and 325 with a grade of at least C- in each, or Biomedical Engineering 343 with a grade of at least C-.","upper":true},{"key":"E E 348","name":"Laser and Optical Engineering","description":"Principles of operation and applications of lasers, optical modulators, and optical detectors. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 339 with a grade of at least C-.","upper":true},{"key":"E E 351K","name":"Probability and Random Processes","description":"Probability, random variables, statistics, and random processes, including counting, independence, conditioning, expectation, density functions, distributions, law of large numbers, central limit theorem, confidence intervals, hypothesis testing, statistical estimation, stationary processes, Markov chains, and ergodicity. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 313 with a grade of at least C-.","upper":true},{"key":"E E 351M","name":"Digital Signal Processing","description":"Sampling, aliasing, truncation effects; discrete and fast Fourier transform methods; convolution and deconvolution; finite and infinite impulse response filter design methods; Wiener, Kalman, noncausal, linear phase, median, and prediction filters; and spectral estimation. Three lecture hours a week for one semester. Prerequisite: Biomedical Engineering 343 or Electrical Engineering 313 with a grade of at least a C-, and credit with a grade of at least C- or registration for Biomedical Engineering 335 or Electrical Engineering 351K.","upper":true},{"key":"E E 155","name":"Electrical and Computer Engineering Seminar","description":"Presentations by speakers from industry, government, academia, and professional private practice. Topics include environmental and other ethical concerns, safety awareness, quality management, technical career descriptions, and professionalism. Substantial practice in engineering communication. One lecture hour a week for one semester. Electrical Engineering 155 and 364D may not both be counted. Prerequisite: One of the following with a grade of at least C-: English 316L (or 316K), 316M (or 316K), 316N (or 316K), or 316P (or 316K).","upper":true},{"key":"E E 155L","name":"Engineering Leadership Seminar","description":"Presentations by speakers from industry, government, academia, and professional private practice. Topics include environmental and other ethical concerns, safety awareness, quality management, technical career descriptions, and professionalism. One lecture hour a week for one semester. Prerequisite: Consent of the dean and one of the following with a grade of at least C-: English 316L (or 316K), 316M (or 316K), 316N (or 316K), or 316P (or 316K).","upper":true},{"key":"E E 155R","name":"Undergraduate Research Seminar","description":"Restricted to students in electrical and computer engineering. Seminar on topics of research in electrical and computer engineering. One lecture hour a week for a semester.  Offered on the pass/fail basis only.","upper":true},{"key":"E E 360C","name":"Algorithms","description":"Advanced problem solving methods; algorithm design principles; complexity analysis; study of the nature, impact, and handling of intractability; study of common algorithmic classes and their applications. Three lecture hours a week for one semester. Prerequisite: Computer Science 312 or Electrical Engineering 312 with a grade of at least C-; and Computer Science 313K or Mathematics 325K with a grade of at least C-.","upper":true},{"key":"E E 360F","name":"Introduction to Software Engineering","description":"Introduction to the discipline of software engineering. Includes software system creation and evolution; fundamental concepts and principles of software product and software process systems, including requirements, architecture and design, construction, deployment, and maintenance; and documentation and document management, measurement and evaluation, software evolution, teamwork, and project management. Three lecture hours a week for one semester. Prerequisite: One of the following with a grade of at least C-: Computer Science 314 or 314H, or Electrical Engineering 422C (or 332C).","upper":true},{"key":"E E 360K","name":"Introduction to Digital Communications","description":"Communication channels and their impairments; modulation; demodulation; probability-of-error analysis; source coding; error control coding; link budget analysis; equalization; synchronization and multiple access; spread spectrum; applications in wireline and wireless communication systems. Three lecture hours a week for one semester. Prerequisite: Biomedical Engineering 335 or Electrical Engineering 351K with a grade of at least C-, and Biomedical Engineering 343 or Electrical Engineering 313 with a grade of at least C-.","upper":true},{"key":"E E 460M","name":"Digital Systems Design Using HDL","description":"Organization, design, simulation, synthesis, and testing of digital systems; hardware description languages (HDLs); field programmable gate arrays (FPGAs); hardware implementation of arithmetic and other algorithmic processes; state machine charts; microprogramming; and microprocessor design. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 316 and 319K with a grade of at least C- in each.","upper":true},{"key":"E E 460N","name":"Computer Architecture","description":"Characteristics of instruction set architecture and microarchitecture; physical and virtual memory; caches and cache design; interrupts and exceptions; integer and floating-point arithmetic; I/O processing; buses; pipelining, out-of-order execution, branch prediction, and other performance enhancements; design trade-offs; case studies of commercial microprocessors. Laboratory work includes completing the behavioral-level design of a microarchitecture. Three lecture hours and one and one-half laboratory/recitation hours a week for one semester. Prerequisite: Electrical Engineering 316 and 319K with a grade of at least C- in each.","upper":true},{"key":"E E 360P","name":"Concurrent and Distributed Systems","description":"An investigation of concurrency, lock-based and lock-free synchronization, resource allocation, multi-threaded programming, distributed systems programming, mutual exclusion, global snapshots, global property evaluation, message ordering,consensus, Byzantine agreement, commit protocols. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 422C (or 322) with a grade of at least C-.","upper":true},{"key":"E E 460R","name":"Introduction to VLSI Design","description":"Theory and practice of very-large-scale integration (VLSI) circuit design. Metal-oxide-semiconductor (MOS) transistors; static and dynamic complementary metal-oxide-semiconductor (CMOS) combinational and sequential circuits; design of adders, multipliers, and shifters; performance, power consumption and testing.  CAD tools for layout, timing analysis, synthesis, physical design, and verification. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 316 and 438 with a grade of at least C- in each.","upper":true},{"key":"E E 360S","name":"Digital Integrated Circuit Design","description":"Circuit-level aspects of metal oxide silicon (MOS) and bipolar integrated circuit technologies. Logic gates and latches; propagation delays; circuit simulation models. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 438 and 339 with a grade of at least C- in each.","upper":true},{"key":"E E 360T","name":"Software Testing","description":"Basic concepts and techniques used in testing software and finding bugs. Includes process, unit, integration, and system testing; manual and automatic techniques for generation of test inputs and validation of test outputs; and coverage criteria. Focus on functional testing. Three lecture hours a week for one semester. Electrical Engineering 360T and 379K (Topic: Software Testing) may not both be counted. Prerequisite: One of the following with a grade of at least C-: Computer Science 314 or 314H, or Electrical Engineering 422C (or 322C).","upper":true},{"key":"E E 361D","name":"System Design Metrics","description":"Survey of engineering design, manufacturing, and lifetime support issues; implications of customer perceptions of quality on design; economics of design; legal implications of design decisions. The equivalent of three lecture hours a week for one semester. Prerequisite: Electrical Engineering 364D with a grade of at least C-.","upper":true},{"key":"E E 461L","name":"Software Engineering and Design Laboratory","description":"The design and development of large-scale software systems using automated analysis tools. Generation of concrete software engineering artifacts at all stages of the software life-cycle. Design principles and methods; design and modeling tools; collaborative development environment; object-oriented design and analysis; design patterns and refactoring; integration and testing tools; debugger and bug finder; program comprehension; software life-cycle and evolution. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Computer Science 314, 314H, or Electrical Engineering 422C (or 322C) with a grade of at least C-; Mathematics 325K with a grade of at least C-; and credit or registration with a grade of at least C- for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 361M","name":"Introduction to Data Mining","description":"Goals, methods, and applications of data mining. Includes data preprocessing, sampling, and visualization; algorithms for machine learning; clustering, classification, and predicting and forecasting; mining the Internet for content, link structure, and usage information; search engine design and social network analysis; and statistical methods. Three lecture hours a week for one semester. Electrical Engineering 361M and 379K (Topic: Introduction to Data Mining) may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Computer Science 314 or 314H or Electrical Engineering 422C (or 322C); Electrical Engineering 351K or Mathematics 362K; and Mathematics 340L.","upper":true},{"key":"E E 361Q","name":"Requirements Engineering","description":"Methods and technology for acquiring, representing, documenting, verifying, validating, and maintaining requirements; text-based, graphic-based, and computational requirements model representations; requirements analysis to synthesize and resolve conflicts among disparate stakeholder viewpoints; requirements traceability and evolution, and change management. The equivalent of three lecture hours a week for one semester. Electrical Engineering 361Q and 379K (Topic: Requirements Engineering) may not both be counted. Prerequisite: Computer Science 312, 312H, or Electrical Engineering 312 with a grade of at least C-.","upper":true},{"key":"E E 361R","name":"Radio-Frequency Electronics","description":"Modeling of active and passive devices and transmission line structures at high frequencies. Analysis and design of radio-frequency electronic circuits including amplifiers, mixers, multipliers, detectors, and oscillators; transistor-, circuit-, and system-level design methods, challenges, and topologies; noise and distortion analysis; and evaluation of modern radio systems. The equivalent of three lecture hours a week for one semester. Electrical Engineering 361R and 379K (Topic: Radio Frequency Circuit Design) may not both be counted. Prerequisite: Electrical Engineering 325 and 438 with a grade of at least C- in each.","upper":true},{"key":"E E 362K","name":"Introduction to Automatic Control","description":"Analysis of linear automatic control systems in time and frequency domains; stability analysis; state variable analysis of continuous-time and discrete-time systems; root locus; Nyquist diagrams; Bode plots; sensitivity; lead and lag compensation. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and Electrical Engineering 313 and Mathematics 340L with a grade of at least C- in each.","upper":true},{"key":"E E 462L","name":"Power Electronics Laboratory","description":"Analysis, design, and operation of power electronic circuits; power conversion from AC to DC, DC to DC, and DC to AC; rectifiers, inverters, and pulse width modulated motor drives. Laboratory work focuses on the use of energy from renewable sources such as photovoltaics and wind. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 362Q","name":"Power Quality and Harmonics","description":"Introduction to and analysis of power quality and harmonic phenomena in electric power systems. Includes characteristics and definitions, voltage sags, electrical transients, harmonics, mitigation techniques, and standards of power quality and harmonics. The equivalent of three lecture hours a week for one semester. Electrical Engineering 362Q and 379K (Topic: Power Quality and Harmonics) may not both be counted. Prerequisite: Electrical Engineering 331 or 411 with a grade of at least C-.","upper":true},{"key":"E E 362R","name":"Renewable Energy and Power Systems","description":"Introduction to renewable energy sources and their integration into power systems. Includes wind energy: resources, turbines, blades, rotor power characteristics, generators, active and reactive power, variability, and voltage regulation; solar energy: resources, solar radiation measurements, photovoltaic materials and properties, photovoltaic electrical characteristics, and system integration; and demonstrations with commercial-grade solar panels and laboratory-scale wind turbines. Three lecture hours a week for one semester. Electrical Engineering 362R and 379K (Topic: Renewable Energy and Power Systems) may not both be counted. Prerequisite: Electrical Engineering 411 or 331 with a grade of at least C-.","upper":true},{"key":"E E 362S","name":"Development of a Solar-Powered Vehicle","description":"Analysis, design, and construction of a solar-powered car for national competitions involving other universities. Study of electrical, mechanical, and aerodynamic systems. Three lecture hours and three laboratory hours a week for one semester. Electrical Engineering 362S and 379K (Topic: Development of a Solar Car for NASC) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"E E 363M","name":"Microwave and Radio Frequency Engineering","description":"Design principles in microwave and radio frequency systems; transmission lines and waveguides; S-parameter representation; impedance matching; microwave network analysis; microwave devices and components; electromagnetic effects in high-speed/high-frequency applications. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 325 with a grade of at least C-.","upper":true},{"key":"E E 363N","name":"Engineering Acoustics","description":"Same as Mechanical Engineering 379N. Principles of acoustics, with applications drawn from audio engineering, biomedical ultrasound, industrial acoustics, noise control, room acoustics, and underwater sound. Three lecture hours a week for one semester. Prerequisite: Mathematics 427K with a grade of at least C-.","upper":true},{"key":"E E 464C","name":"Corporate Senior Design Project","description":"Design and experimental projects, done in the laboratories of local companies, for electrical engineering students working full-time in industry; the ethics of design for safety and reliability; emphasis on written and oral reporting of engineering projects. Three lecture hours a week for one semester, with additional laboratory hours to be arranged. Prerequisite: Electrical Engineering 364D with a grade of at least C-; and Electrical Engineering 440, 445L (or 345L), 445S (or 345S), 461L, or 462L (or 362L) with a grade of at least C-.","upper":true},{"key":"E E 364D","name":"Introduction to Engineering Design","description":"Introduction to the engineering design process; assessing engineering problems and customer needs; acquiring, documenting, and verifying requirements; high-level system design principles; effects of economic, environmental, ethical, safety, and social issues in design; writing design specifications. Two lecture hours and three laboratory hours a week for one semester. Additional laboratory hours may be required for some sections; these are identified in the Course Schedule. Electrical Engineering 155 and 364D may not both be counted. Prerequisite: Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T, with a grade of at least C-; and credit with a grade of at least C- or registration for Electrical Engineering 438, 440, 445L (or 345L), 445S (or 345S), 461L, or 462L (or 362L).","upper":true},{"key":"E E 364E","name":"Interdisciplinary Entrepreneurship","description":"First course in a two-semester sequence that concludes with Electrical Engineering 464S. Teams of students starting companies focus on skill development and mentoring in start-up formation, technology development, market validation, marketing, sales, operations, human resources, program management, and finance. Includes discussion of the role of intellectual property, the social issues in design, as well as ethical and safety considerations. Emphasis on written and oral presentation of start-up activities. The equivalent of three lecture hours a week for one semester, with additional hours to be arranged. Only one of the following may be counted: Computer Science 378 (Topic: Interdisciplinary Entrepreneurship), Electrical Engineering 364E, Engineering Studies 377 (Topic: Interdisciplinary Entrepreneurship), Management 337 (Topic: Interdisciplinary Entrepreneurship). Electrical Engineering 364E and 464S may not be counted by students with credit for Electrical Engineering 364D, 464H, 464K, or 464R. Prerequisite: Credit with a grade of at least C- in Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T; credit with a grade of at least C- or registration for Electrical Engineering 440, 445L (or 345L), 445S (or 345S), and 461L or 462L (or 362L); and consent of instructor.","upper":true},{"key":"E E 464G","name":"Multidisciplinary Senior Design Project","description":"Design and experimental projects done with teams of students from multiple engineering disciplines; the ethics of design for safety and reliability; emphasis on written and oral reporting of engineering projects. Three lecture hours a week for one semester, with additional laboratory hours to be arranged. Prerequisite: Electrical Engineering 364D with a grade of at least C-; and Electrical Engineering 440, 445L (or 345L), 445S (or 345S), 461L, or 462L (or 362L) with a grade of at least C-.","upper":true},{"key":"E E 464H","name":"Honors Senior Design Project","description":"Restricted to students in the Engineering Honors Program. Design and experimental projects done under the direction of a University faculty member; the ethics of design for safety and reliability; emphasis on written and oral reporting of engineering projects. Three lecture hours a week for one semester, with additional laboratory hours to be arranged. Prerequisite: Electrical Engineering 364D with a grade of at least C-, and one of the following with a grade of at least C-: Electrical Engineering 438, 440, 445L (or 345L), 445S (or 345S), 461L, 462L (or 362L).","upper":true},{"key":"E E 464K","name":"Senior Design Project","description":"Design and experimental projects done in Department of Electrical and Computer Engineering laboratories; the ethics of design for safety and reliability; emphasis on written and oral reporting of engineering projects. Three lecture hours and six laboratory hours a week for one semester. Prerequisite: Electrical Engineering 364D with a grade of at least C-, and one of the following with a grade of at least C-: Electrical Engineering 438, 440, 445L (or 345L), 445S (or 345S), 461L, 462L (or 362L).","upper":true},{"key":"E E 464R","name":"Research Senior Design Project","description":"Design and experimental projects done under the supervision of a University faculty member; the ethics of design for safety and reliability; emphasis on written and oral reporting of engineering projects. Three lecture hours a week for one semester, with additional laboratory hours to be arranged. Prerequisite: Electrical Engineering 364D with a grade of at least C-, and one of the following with a grade of at least C-: Electrical Engineering 438, 440, 445L (or 345L), 445S (or 345S), 461L, 462L (or 362L).","upper":true},{"key":"E E 464S","name":"Start-Up Senior Design Project","description":"Continuation of Electrical Engineering 364E. Completion of a practical engineering product design; validation of the design through prototype construction and testing, modeling and simulation, and manufacturability analysis. Development of a completed company prospectus, seeking venture funding for the project, and participating in an innovative technology forum to present the proposed start-up company to potential investors. Three lecture hours and six laboratory hours a week for one semester. Electrical Engineering 364E and 464S may not be counted by students with credit for 364D, 464H, 464K, or 464R. Prerequisite: Electrical Engineering 364E with a grade of at least C-; one of the following courses with a grade of at least C-: Electrical Engineering 438, 449, 445L (or 345L), 445S (or 345S), 461L, 462L (or 362L); and consent of instructor.","upper":true},{"key":"E E 366","name":"Engineering Economics I","description":"Business organization; discounted cash flow calculations, including present-worth and rate-of-return calculations; replacement analyses; financial analyses; accounting and depreciation; income taxes; inflation; risk analysis, utility theory, decision models, sequential decision making; value of information. Three lecture hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Electrical Engineering 351K.","upper":true},{"key":"E E 366K","name":"Engineering Economics II","description":"Fundamentals of risk management, including portfolio theory, capital asset pricing theory, and optimal project mix; hedging financial risk; advanced economic analysis of alternative energy systems; and advanced mathematical modeling techniques for economic analysis. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 366 with a grade of at least C-.","upper":true},{"key":"E E 366L","name":"Statistics for Manufacturing","description":"Statistical analysis applied to the development and control of manufacturing operations; quality control, statistical process control, and design of experiments. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 351K with a grade of at least C-.","upper":true},{"key":"E E 368L","name":"Power Systems Apparatus and Laboratory","description":"Fundamentals of power systems emphasized through laboratory experiments; complex power, three-phase circuits, per-unit system, transformers, synchronous machines, transmission line models, steady-state analysis, induction machines, capacitor banks, protective relaying, surge arrestors, and instrumentation. Three lecture hours and three laboratory hours a week for one semester. Electrical Engineering 368L and 379K (Topic: Power Systems Apparatus and Laboratory) may not both be counted. Prerequisite: Electrical Engineering 411 or 331 with a grade of at least C-; and credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 369","name":"Power Systems Engineering","description":"Three-phase power systems, system component models, symmetrical components, and admittance and impedance matrices. Formulation and analysis of loadflow, short circuit, and stability for electric grids. Economic operation. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and Electrical Engineering 313 or 331 with a grade of at least C-.","upper":true},{"key":"E E 369L","name":"Relay Protection of Power Systems","description":"Theory, principles, and practices for protecting medium-voltage industrial power systems and high-voltage transmission grids. Includes symmetrical components; fault calculations and grounding; protection of motors, generators, cables, and transmission lines; and relay settings, fusing, and coordination of multiple protection devices. Two lecture hours and three laboratory hours a week for one semester. Prerequisite: Electrical Engineering 411 with a grade of at least C-.","upper":true},{"key":"E E 370","name":"Automatic Control II","description":"Introduction to modern control theory, nonlinear and optimal control systems; controllability, observability, stability; state feedback, observers, eigenvalue assignment. Three lecture hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Electrical Engineering 362K.","upper":true},{"key":"E E 370K","name":"Computer Control Systems","description":"Analysis and design of linear discrete time control systems; z-transform theory; modified z-transforms; stability; multirate systems; digital simulation of discrete time systems; synthesis of algorithms for computer controllers. Three lecture hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Electrical Engineering 362K.","upper":true},{"key":"E E 370L","name":"Introduction to Manufacturing Systems Automation","description":"Applications of automation techniques to manufacturing systems; robotics and computer vision. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 362K with a grade of at least C-.","upper":true},{"key":"E E 370N","name":"Introduction to Robotics and Mechatronics","description":"Structures for industrial robots; geometry and transformation; direct and inverse kinematics; differential kinematics; dynamics; trajectory planning; actuators and sensors; adaptive control and learning compliance; vision and pattern recognition; expert systems. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 362K with a grade of at least C-.","upper":true},{"key":"E E 471C","name":"Wireless Communications Laboratory","description":"The fundamentals of wireless communication from a digital signal processing perspective; linear modulation, demodulation, and orthogonal frequency division multiplexing; synchronization, channel estimation, and equalization; communication in fading channels; and wireless standards. Three lecture hours and three laboratory hours a week for one semester. Electrical Engineering 371C and 379K (Topic: Wireless Communications Laboratory) may not both be counted. Prerequisite: Electrical Engineering 445S (or 345S), 351M, or 360K with a grade of at least C-; and credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 371D","name":"Introduction to Neural Networks","description":"Characteristics of artificial neural networks, feedforward networks, and recurrent networks; learning algorithms; self-organization; biological links; data mining and other applications. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 351K and Mathematics 340L with a grade of at least C- in each.","upper":true},{"key":"E E 371M","name":"Communication Systems","description":"Analog and digital modulation; noise in communication systems; signal-to-noise ratio; coding; optimal receiver design; phase-locked loops; and performance analysis. Three lecture hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Biomedical Engineering 335 or Electrical Engineering 351K.","upper":true},{"key":"E E 371R","name":"Digital Image and Video Processing","description":"Digital image acquisition, processing, and analysis; algebraic and geometric image transformations; two-dimensional Fourier analysis; image filtering and coding. Three lecture hours a week for one semester. Prerequisite: Biomedical Engineering 335 or Electrical Engineering 351K with a grade of at least C-.","upper":true},{"key":"E E 372L","name":"Network Engineering Laboratory","description":"Local, metropolitan, and wide-area operations; telecommunication common carrier organization and services; administrative and political considerations; premise distribution systems; name resolution, address assignment, and mail; datagrams, packets, frames, and cells; addressing and network-level interconnection; internetwork architecture; TCP/IP protocol suite (v. 4 and 6); Ethernet and IEEE 802.3 standards; IEEE 802.11 standards and wireless access points; repeaters, hubs, bridges, routers; local area network emulation; public switched network access through POTS and ISDN; intradomain and interdomain routing; routing protocols, including RIP, OSPF, and BGP; multicast; media testing; local- and wide-area diagnostic tools. The equivalent of three lecture hours a week for one semester. Prerequisite: Electrical Engineering 372N with a grade of at least C-; and credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 372N","name":"Telecommunication Networks","description":"Circuit and packet-switched networks; local area networks; protocol stacks; ATM and broadband ISDN; Internet; routing, congestion control, and performance evaluation; multimedia applications. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 351K with a grade of at least C-.","upper":true},{"key":"E E 372S","name":"Cryptography and Network Security","description":"Distributed information system security; cryptographic tools; authentication; message security; system management. The equivalent of three lecture hours a week for one semester. Prerequisite: Mathematics 325K or 340L with a grade of at least C-.","upper":true},{"key":"E E 374K","name":"Biomedical Electronic Instrument Design","description":"Application of electrical engineering principles in the design of electronic instrumentation at the circuit-board level for the measurement of pressure, temperature, flow, and impedance. Also includes the study of light intensity, bioelectric potentials, and stimulation devices such as pacemakers and defibrillators. Focus on design considerations specific to electro-medical environments, safety and efficacy, and public policy issues. Three lecture hours a week for one semester. Prerequisite: Electrical Engineering 438 with a grade of at least C-.","upper":true},{"key":"E E 374L","name":"Applications of Biomedical Engineering","description":"An in-depth examination of selected topics in biomedical engineering, such as optical and thermal properties of laser interaction with tissue; measurement of perfusion in the microvascular system; diagnostic imaging; interaction of living systems with electromagnetic fields; robotic surgical tools; ophthalmic instrumentation; noninvasive cardiovascular measurements. Three lecture hours and six laboratory hours a week for one semester. Prerequisite: Electrical Engineering 374K with a grade of at least C-; and credit with a grade of at least C- or registration for Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, Mechanical Engineering 333T, or Petroleum and Geosystems Engineering 333T.","upper":true},{"key":"E E 377E","name":"Interdisciplinary Entrepreneurship: Elective","description":"Same as Engineering Studies 377E. Restricted to engineering students. Projects must differ significantly from those developed for Electrical Engineering 364D and 364E. Focus on skill development and mentoring in start-up formation, technology development, market validation, marketing, sales, operations, human resources, program management, and finance. Includes discussion of intellectual property, social issues in design, as well as ethical and safety considerations. Emphasis on written and oral presentation of start-up activities. The equivalent of three lecture hours a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"E E 679H","name":"Undergraduate Honors Thesis","description":"Research performed during two consecutive semesters under the supervision of an engineering faculty member; topics are selected jointly by the student and the faculty member with approval by the director of the Engineering Honors Program. The student makes an oral presentation and writes a thesis. Individual instruction for two semesters. Students pursuing both the Bachelor of Arts, Plan II, and a bachelor's degree in engineering may use this course to fulfill the thesis requirement for the Bachelor of Arts, Plan II. Prerequisite: For 679HA, enrollment in the Engineering Honors Program; for 679HB, Electrical Engineering 679HA with a grade of at least C- and enrollment in the Engineering Honors Program.","upper":true},{"key":"E E 379K","name":"Topics in Electrical Engineering","description":"The equivalent of three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true}]