[{"key":"MUS 101G","name":"Beginning Music Performance","description":"Class instruction in music performance for nonmusic majors and for music majors studying a secondary instrument. Sections are offered in the following instruments: bassoon, clarinet, double bass, euphonium, flute, French horn, guitar, harpsichord, oboe, organ, percussion, recorder, saxophone, trombone, trumpet, tuba, viola, violin, violoncello, and voice. Laboratory hours as required. May be repeated for credit when the instruments vary. Prerequisite: Ability to read music. Students studying guitar must provide their own six-string nylon (classical) guitar.","upper":false},{"key":"MUS 201J","name":"Beginning Class Piano for Nonmusic Majors","description":"Open to all University students, except music majors, who have no experience in piano.  Three class hours a week for one semester.  May be repeated for credit.","upper":false},{"key":"MUS 201K","name":"Second-Semester Class Piano for Nonmusic Majors","description":"Open to all University students, except music majors, who can fulfill the prerequisite.  Three class hours a week for one semester.  May be repeated for credit. Prerequisite: Credit with a grade of at least C or registration for Music 201J, or consent by audition; and consent of instructor.","upper":false},{"key":"MUS 201M","name":"Beginning Music Performance: Class Piano","description":"Open only to music majors.  Three laboratory hours a week for one semester.   Credit granted only when taken as a secondary instrument. May be repeated for credit. Prerequisite: Ability to read music, and concurrent enrollment in Music 605A or consent of instructor. No experience on the instrument required; for those with experience, consent by audition required.","upper":false},{"key":"MUS 201N","name":"Beginning Music Performance: Second-Semester Class Piano","description":"Open only to music majors. Continuation of Music 201M. Three laboratory hours a week for one semester. Credit granted only when taken as a secondary instrument. May be repeated for credit. Prerequisite: Music 201M completed the previous semester with a grade of at least C, or consent by audition.","upper":false},{"key":"MUS 201S","name":"Beginning Music Performance: Class Harp","description":"Open to all University students who can fulfill the prerequisite.  Three laboratory hours a week for one semester.   For music majors, credit granted only when taken as a secondary instrument. May be repeated for credit. Prerequisite: Ability to read music and consent of instructor. No previous experience on the instrument required.","upper":false},{"key":"MUS 201T","name":"Beginning Music Performance: Second-Semester Class Harp","description":"Open to all University students who can fulfill the prerequisite.  Three laboratory hours a week for one semester.   For music majors, credit granted only when taken as a secondary instrument. May be repeated for credit. Prerequisite: Music 201S completed the previous semester with a grade of at least C, or consent by audition.","upper":false},{"key":"MUS 302L (TCCN: MUSI 1306)","name":"An Introduction to Western Music","description":"Open to all University students except music majors. Information and techniques for the intelligent appreciation of music: its elements, basic forms, and major style periods from the Middle Ages to the present. Three lecture hours a week for one semester, with one laboratory hour a week as required.","upper":false},{"key":"MUS 302P","name":"Introductory Topics in Western Music","description":"May not be counted by music majors.  Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"MUS 303M","name":"Introduction to Music in World Cultures","description":"Open to all University students. Exploration of practices, beliefs, and issues through the study of various musical genres in the regions of Asia, the Middle East, Africa, the Pacific, Europe, and the Americas. Three lecture hours a week for one semester, with one laboratory hour a week as required. Asian Studies 303M and Music 303M may not both be counted.","upper":false},{"key":"MUS 303N","name":"Introduction to Popular Music in World Cultures","description":"Open to all University students. Exploration of practices, beliefs, and issues through the study of various mass-mediated and commercial musical genres in the regions of Asia, the Middle East, Africa, the Pacific, Europe, and the Americas. Three lecture hours a week for one semester, with one laboratory hour a week as required. Asian Studies 303N and Music 303N may not both be counted.","upper":false},{"key":"MUS 303P","name":"Topics in Music of World Cultures","description":"May not be counted by music majors.  Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"MUS 306M","name":"Elements of Music","description":"Open to all University students except music majors. Fundamentals of music including the study of notation and the elements of rhythm, melody, and harmony; development of elementary aural skills; and writing of simple compositions. Three lecture hours a week for one semester. Music 606 and 306M may not both be counted.","upper":false},{"key":"MUS 307 (TCCN: MUSI 1310)","name":"Topics in Popular Music","description":"Open to all University students. Studies of the popular music of a selected culture or geographical area. Three lecture hours a week for one semester, with one laboratory hour a week as required.  May be repeated for credit when the topics vary.","upper":false},{"key":"MUS 007P","name":"String Education: Teaching and Learning","description":"Restricted to current String Project program instructors in the Butler School of Music. Discussion of curriculum planning, lesson observation, and program management topics, as well as guest pedagogues and master teacher presentations. One lecture hour a week for one semester.  May be repeated for credit. Prerequisite: Acceptance of teaching application for the String Project program.","upper":false},{"key":"MUS 210J","name":"Beginning Instruction in Music Performance: Third-Semester Class Piano","description":"Open only to music majors. Continuation of Music 201N. Three laboratory hours a week for one semester.   Credit granted only when taken as a secondary instrument. May be repeated for credit. Prerequisite: Music 201N completed the previous semester with a grade of at least C, or consent by audition.","upper":false},{"key":"MUS 210K","name":"Beginning Instruction in Music Performance: Fourth-Semester Class Piano","description":"Open only to music majors. Continuation of Music 210J. Three laboratory hours a week for one semester.   Credit granted only when taken as a secondary instrument. May be repeated for credit. Prerequisite: Music 210J completed the previous semester with a grade of at least C, or consent by audition.","upper":false},{"key":"MUS 111E (TCCN: MUSI 1161)","name":"English Diction and Phonetic Translation","description":"Open only to music majors. Study of English diction and phonetic translation specifically for musicians. Emphasis on the International Phonetic Alphabet. One lecture hour a week for one semester.","upper":false},{"key":"MUS 311F","name":"French for Musicians","description":"Open only to music majors. French language and diction specifically for musicians. Three lecture hours and one laboratory hour a week for one semester.","upper":false},{"key":"MUS 311G","name":"German for Musicians","description":"Open only to music majors. German language and diction specifically for musicians. Three lecture hours and one laboratory hour a week for one semester.","upper":false},{"key":"MUS 311J","name":"Italian for Musicians","description":"Open only to music majors. Italian language and diction specifically for musicians. Three lecture hours and one laboratory hour a week for one semester.","upper":false},{"key":"MUS 313","name":"Fundamentals of Music","description":"Designed to familiarize students who are not music majors with the meaning of musical notation and with the harmonic, melodic, and rhythmic structure of music. Three lecture hours and one laboratory hour a week for one semester. Music 605 and 313 may not both be counted.","upper":false},{"key":"MUS 313M","name":"History of Music I","description":"The history of music from the beginning of notation to the eighteenth century. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Music 605 or consent of instructor.","upper":false},{"key":"MUS 313N","name":"History of Music II","description":"The history of music from the eighteenth century to the early twentieth century. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Music 313M or consent of instructor.","upper":false},{"key":"MUS 214C (TCCN: MUSI 1286)","name":"Beginning Composition","description":"Introduction to contemporary composition through the analysis and writing of short studies and through supervised original projects. Two lecture hours and one laboratory hour a week for one semester.  May be repeated for credit. Prerequisite: Concurrent enrollment in Music 411 and 612, or consent of instructor.","upper":false},{"key":"MUS 115D","name":"String Instrument Fundamentals","description":"Beginning instruction in string instrument performance and pedagogy. This course is offered in the following instruments: double bass, viola, violin, and violoncello. Individual or class instruction in music performance. Laboratory hours as required. May not be repeated for credit on the same instrument. May not be taken by music majors in their principal instrument. Prerequisite: A major in music.","upper":false},{"key":"MUS 115E","name":"Brass Instrument Fundamentals","description":"Beginning instruction in brass instrument performance and pedagogy. This course is offered in the following instruments: euphonium, French horn, trombone, trumpet, and tuba. Individual or class instruction in music performance. Laboratory hours as required. May not be repeated for credit on the same instrument. May not be taken by music majors in their principal instrument. Prerequisite: A major in music.","upper":false},{"key":"MUS 115F","name":"Woodwind Instrument Fundamentals","description":"Beginning instruction in woodwind instrument performance and pedagogy. This course is offered in the following instruments: bassoon, clarinet, flute, oboe, and saxophone. Individual or class instruction in music performance. Laboratory hours as required. May not be repeated for credit on the same instrument. May not be taken by music majors in their principal instrument. Prerequisite: A major in music.","upper":false},{"key":"MUS 115G","name":"Guitar Fundamentals","description":"Beginning instruction in guitar performance and pedagogy. Individual or class instruction in music performance. Laboratory hours as required. Prerequisite: A major in music or consent of instructor.","upper":false},{"key":"MUS 115T","name":"Lower-Division Reed Making","description":"Individual instruction.  May be repeated for credit. Prerequisite: Consent of instructor.","upper":false},{"key":"MUS 218J","name":"Beginning Jazz Improvisation","description":"Study of basic jazz improvisational skills through performance of standard literature. Two class hours a week for one semester. Prerequisite: Music 605 or consent of instructor.","upper":false},{"key":"MUS 319D","name":"Foundations of Digital Sound and Music","description":"Introduction to the practice of creating music with computer technologies and the basic techniques of recording, editing and producing digital audio tracks, including introduction to musical acoustics and psychoacoustics, fundamentals of audio recording, editing, mixing, and processing, MIDI, digital audio workstations, and syncing sound to video. Three hours a week for one semester. Fine Arts 310 (Topic: Foundations of Digital Sound and Music) and Music 319D may not both be counted. Prerequisite: Consent of instructor.","upper":false},{"key":"MUS 420J","name":"Junior Jazz Recital","description":"Preparation and performance of a half-hour public recital in the major jazz instrument. Individual instruction. Prerequisite: For jazz composition majors, course 212J in the major jazz instrument for two semesters, or the equivalent, and approval of the jazz faculty; for jazz performance majors, course 412J in the major jazz instrument for two semesters, or the equivalent, and approval of the jazz faculty.","upper":true},{"key":"MUS 220P","name":"Practicum in a World Music Tradition","description":"Open to any University student who can qualify by audition. Advanced training on a non-Western musical instrument such as Javanese gender barung, Indian sitar, Arabic qanun, or Korean kayakeum, or advanced training in a non-Western vocal style, and other approved musical practices. Two lecture hours a week for one semester.  May be repeated for credit. Prerequisite: Upper-division standing; two semesters of enrollment in a non-Western music ensemble, such as Javanese Gamelan, Middle Eastern or North Indian Music ensemble, or other approved music ensembles, and consent of instructor.","upper":true},{"key":"MUS 420R","name":"Junior Recital","description":"Preparation and performance of a half-hour public recital in the major instrument. Individual instruction. Prerequisite: Course 412 (or 410) in the major instrument for four semesters, or the equivalent, and approval of the faculty.","upper":true},{"key":"MUS 321J","name":"Twentieth-Century Musical Analysis","description":"Introduction to the theory and practice of music since 1900. Includes various analytical approaches to the wide range of musical styles developed over the course of the twentieth- and twenty-first-centuries, as well as the music of mainstream twentieth century composers and living composers. Both analytical and aural skills are emphasized. Three lecture hours a week for one semester. Prerequisite: Music 411 and 612.","upper":true},{"key":"MUS 222J","name":"Instrumental Conducting","description":"Designed for those who have had no experience in conducting. Includes rudimentary use of baton, regular and irregular beat patterns, subdivisions and beat pattern variations as applied to simple instrumental literature, and practical experience in conducting instrumental groups. Two class hours a week for one semester. Prerequisite: Upper-division standing in music or consent of instructor.","upper":true},{"key":"MUS 222K","name":"Instrumental Conducting","description":"Continuation of Music 222J. Further technical study in irregular meters, polyrhythmic and polymetrical patterns and scores; emphasis on expressive gestures, phrasal and compound beat conducting. Two class hours a week for one semester. Prerequisite: Music 222J or consent of instructor.","upper":true},{"key":"MUS 223J","name":"Choral Conducting","description":"Designed for those who have had no experience in conducting. Includes regular and irregular beat patterns, subdivisions and beat pattern variations as applied to simple choral literature, and practical experience in conducting vocal groups. Two class hours a week for one semester. Prerequisite: Upper-division standing in music.","upper":true},{"key":"MUS 223K","name":"Choral Conducting","description":"Continuation of Music 223J. Further technical study in irregular meters, polyrhythmic and polymetrical patterns and scores; emphasis on expressive gestures, phrasal and compound beat conducting. Two class hours a week for one semester. Prerequisite: Music 223J or consent of instructor.","upper":true},{"key":"MUS 224G","name":"Intermediate Composition","description":"Continuation of Music 214C. The equivalent of two lecture hours and one laboratory hour a week for one semester.  May be repeated for credit. Prerequisite: Music 214C with a grade of at least B, and approval of the music theory and composition faculty.","upper":true},{"key":"MUS 224J","name":"Advanced Composition","description":"Continuation of Music 224G for composition majors only. The equivalent of two lecture hours and one laboratory hour a week for one semester. With consent of the music theory and composition faculty, may be repeated for credit. Prerequisite: Music 224G with a grade of at least B, and approval of the music theory and composition faculty.","upper":true},{"key":"MUS 325L","name":"Counterpoint","description":"Development of contrapuntal skill in sixteenth-century style and in related late-twentieth-century styles; the teaching of counterpoint, including Fuxian species. Three lecture hours a week for one semester. Prerequisite: Music 411 and 612.","upper":true},{"key":"MUS 325M","name":"Counterpoint","description":"Analysis of eighteenth-century inventions, fugues, and passacaglias; development of contrapuntal skills in twentieth-century styles that draw on these historical models; the teaching of counterpoint. Three lecture hours a week for one semester.","upper":true},{"key":"MUS 226G","name":"Orchestration and Arranging","description":"Techniques of instrumentation, arranging, and orchestration for band, orchestra, and chamber ensembles. Two lecture hours a week for one semester. Prerequisite: Music 411 and 612.","upper":true},{"key":"MUS 226J","name":"Orchestration and Instrumentation","description":"Study of the characteristics of individual instruments; writing for various combinations; study of scores of different periods; listening to recordings and live performances. Two lecture hours a week for one semester. Prerequisite: Music 411 and 612.","upper":true},{"key":"MUS 226K","name":"Orchestration and Instrumentation","description":"Continuation of Music 226J. Two lecture hours a week for one semester. Prerequisite: Music 226J.","upper":true},{"key":"MUS 226N","name":"Choral Arranging","description":"Techniques of voicing and arranging for choirs, vocal ensembles, and vocal chamber groups. Two lecture hours a week for one semester. Prerequisite: Music 411 and 612.","upper":true},{"key":"MUS 228G","name":"Jazz Theory I","description":"Study of the elements of jazz and popular styles, with emphasis on written theory and keyboard skills. Two lecture hours a week for one semester. Prerequisite: Music 201N and 605, or consent of instructor.","upper":true},{"key":"MUS 228J","name":"Intermediate Jazz Improvisation","description":"Continuation of Music 218J. Two class hours a week for one semester. Prerequisite: Music 201N, 605, 218J, and 228G; or consent of instructor.","upper":true},{"key":"MUS 228K","name":"Beginning Jazz Piano Techniques","description":"Designed for music majors (pianists and nonpianists) seeking basic skills in chord notation, chord interpretation and voicing, voice leading, and chord and scale relationships for improvisation. Three laboratory hours a week for one semester. Prerequisite: Music 210K and 612, or consent of instructor.","upper":true},{"key":"MUS 228L","name":"Jazz Theory II","description":"Continuation of the concepts taught in Music 228G, with an emphasis on ear training, harmonic motion of jazz, and harmonic embellishment. Two lecture hours a week for one semester. Prerequisite: Music 228G.","upper":true},{"key":"MUS 328M","name":"Studio Arranging","description":"Techniques of composing and arranging for standard jazz and popular music instrumental combinations in varied styles. Three lecture hours a week for one semester. With consent of instructor, may be repeated for credit. Prerequisite: Music 612 and 228G, or consent of instructor.","upper":true},{"key":"MUS 228P","name":"Jazz Composition","description":"Individual instruction in the creative process of composition, involving the melodic, harmonic, and rhythmic components of various jazz styles. Individual instruction.  May be repeated for credit. Prerequisite: Music 328M or consent of instructor.","upper":true},{"key":"MUS 329E","name":"Introduction to Electronic Media","description":"Introduction to the fundamentals of recording, tape editing, and electronic music synthesis. Three lecture hours and six laboratory hours a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"MUS 329F","name":"Projects in Electronic Media","description":"Continuation of Music 329E for nontheory and noncomposition majors. One and one-half lecture hours and eight laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Music 329E and consent of instructor.","upper":true},{"key":"MUS 329G","name":"Intermediate Electronic Composition","description":"Continuation of Music 329E for music theory or composition majors. Three lecture hours and six laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Music 329E and consent of instructor.","upper":true},{"key":"MUS 329J","name":"Introduction to Computer Music","description":"An introduction to the basic concepts of digital music synthesis and signal processing. One and one-half lecture hours and eight laboratory hours a week for one semester. Prerequisite: Music 329E and consent of instructor.","upper":true},{"key":"MUS 329M","name":"Intermediate Computer Music","description":"Continuation of Music 329J. One and one-half lecture hours and eight laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Music 329J and consent of instructor.","upper":true},{"key":"MUS 330L","name":"History of Music III","description":"The history of music from the early twentieth century to the present. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Music 313N or consent of instructor.","upper":true},{"key":"MUS 331J","name":"Advanced Studies in Music Theory","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Offered on the letter-grade basis only. Prerequisite: Music 612 and 313N, or upper-division standing and consent of instructor.","upper":true},{"key":"MUS 334","name":"The Music of the Americas","description":"Studies of both indigenous and borrowed traditions in the popular, folk, and art music of the Americas from the colonial period to the present. Three lecture hours a week for one semester, with one laboratory hour a week as required.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"MUS 337","name":"Music and Film Sound","description":"History of music and the soundtrack; analysis of interactions between image and sound; and aesthetics and issues of production and postproduction. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"MUS 338","name":"Masterpieces of Music","description":"Study of the works of specific composers or of specific genres in the Western musical tradition. Three lecture hours a week for one semester.   May not be counted by music majors. May be repeated for credit when the topics vary. Prerequisite: Music 302L or consent of instructor.","upper":true},{"key":"MUS 342","name":"Area Studies in Ethnomusicology","description":"Studies of the musical traditions of selected cultures or geographical areas. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"MUS 343J","name":"History of Jazz","description":"Survey of the history of jazz from its origins to the present. Three lecture hours a week for one semester. Prerequisite: Upper-division standing in music or consent of instructor.","upper":true},{"key":"MUS 354","name":"Musical Development of Children","description":"The processes of musical development in young children. Topics include music in multicultural contexts, music in the cognitive and social development of young children, and special issues concerning music and exceptional children. Three lecture hours a week for one semester. Prerequisite: Upper-division standing or consent of instructor.","upper":true},{"key":"MUS 354C","name":"Children's Music Literature and Performance I","description":"Literature, materials, and music performance activities appropriate for young children. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Music 605 or 313, upper-division standing in music studies, or consent of instructor.","upper":true},{"key":"MUS 354D","name":"Children's Music Literature and Performance II","description":"Continuation of Music 354C. Three lecture hours a week for one semester. Prerequisite: Music 354C or consent of instructor.","upper":true},{"key":"MUS 155C","name":"Techniques of Percussion Performance","description":"Percussion performance techniques for individual and ensemble settings, including appropriate literature and rehearsal procedures. Two laboratory hours a week for one semester. Prerequisite: Upper-division standing in music studies.","upper":true},{"key":"MUS 255D","name":"Techniques of String Performance","description":"String instrument performance techniques for individual and ensemble settings, including appropriate literature and rehearsal procedures. Two lecture hours a week for one semester. Prerequisite: Upper-division standing in music studies.","upper":true},{"key":"MUS 255E","name":"Techniques of Brass Performance","description":"Brass instrument performance techniques for individual and ensemble settings, including appropriate literature and rehearsal procedures. Two lecture hours a week for one semester. Prerequisite: Upper-division standing in music studies.","upper":true},{"key":"MUS 255F","name":"Techniques of Woodwind Performance","description":"Woodwind instrument performance techniques for individual and ensemble settings, including appropriate literature and rehearsal procedures. Two lecture hours a week for one semester. Prerequisite: Upper-division standing in music studies.","upper":true},{"key":"MUS 255M","name":"Marching Band Techniques","description":"Literature, materials, and techniques of the marching band. Two lecture hours and one laboratory hour a week for one semester. Prerequisite: Upper-division standing in music studies.","upper":true},{"key":"MUS 255V","name":"Techniques of Vocal Performance","description":"Technique of individual and ensemble singing practiced through the study of vocal literature. Two lecture hours a week for one semester. Prerequisite: Upper-division standing in music studies.","upper":true},{"key":"MUS 356G","name":"Choral Ensemble Literature and Performance","description":"Choral music literature; rehearsal and performance techniques for choirs and small ensembles. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Upper-division standing in music studies or consent of instructor.","upper":true},{"key":"MUS 356J","name":"Instrumental Ensemble Literature and Performance","description":"Study of the literature and of performance and rehearsal techniques for heterogeneous instrumental ensembles. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Upper-division standing in music studies and Music 210K.","upper":true},{"key":"MUS 159J","name":"Harp Repertoire","description":"Study and performance of the harp repertoire. One laboratory hour a week for one semester.  May be repeated for credit. Prerequisite: Consent of instructor.","upper":true},{"key":"MUS 259L","name":"Vocal Repertoire Coaching","description":"Two lecture hours and one laboratory hour a week for one semester.  May be repeated for credit. Prerequisite: Consent of instructor.","upper":true},{"key":"MUS 259N","name":"Chamber Music: Strings and Piano","description":"The equivalent of two lecture hours and one laboratory hour a week for one semester.  May be repeated for credit. Prerequisite: Music 411, 612, and consent of instructor.","upper":true},{"key":"MUS 259P","name":"Chamber Music: Winds and Percussion","description":"The equivalent of two lecture hours and one laboratory hour a week for one semester.  May be repeated for credit. Prerequisite: Music 411, 612, and consent of instructor.","upper":true},{"key":"MUS 259T","name":"Topics in Instrumental Technology","description":"Two lecture hours and one laboratory hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"MUS 160C","name":"Senior Composition Recital","description":"Open only to music composition majors. Preparation and performance of a thirty-minute public recital of the student's original compositions. Individual instruction.","upper":true},{"key":"MUS 460J","name":"Senior Jazz Recital","description":"Open only to jazz performance majors. Preparation and performance of a one-hour public recital in the major jazz instrument. Individual instruction. Prerequisite: Music 420J and approval of the jazz faculty.","upper":true},{"key":"MUS 260M","name":"Pedagogy","description":"An intensive study of repertoire and methods, designed for students planning to specialize in teaching.  May be repeated for credit when the topics vary.","upper":true},{"key":"MUS 460P","name":"Pedagogy","description":"Designed primarily for students planning teaching careers. This course is offered in harp, piano, strings, woodwinds, brass, percussion, and voice. Methods of individual and class instruction through the use of music literature and the teaching repertoire. Practice teaching and laboratory for diagnostic and corrective methods are required. Two lecture hours a week for two semesters. Upon recommendation of the faculty, Music 460P and two semesters of instrument course 260 and approval of the faculty in the student's instrument may be substituted for instrument course 462 and Music 460R. Prerequisite: For 460PA, instrument course 462 and approval of the faculty, and consent of instructor; for 460PB, Music 460PA.","upper":true},{"key":"MUS 460R","name":"Senior Recital","description":"Open only to music performance majors. Preparation and performance of a one-hour public recital in the major instrument. Individual instruction. Prerequisite: For performance majors approved to pursue a pedagogy emphasis, approval of the faculty; for other performance majors, Music 420R and approval of the faculty.","upper":true},{"key":"MUS 262","name":"Intermediate Instrumental Conducting","description":"Problems and interpretation of larger band and orchestral works; analytical study of musical form as it relates to conducting; a synthesis of musical understanding and expansion of comprehensive musicianship through conducting problems. Two class hours and one laboratory hour a week for one semester.  May be repeated for credit. Prerequisite: Music 222K or consent of instructor.","upper":true},{"key":"MUS 366P","name":"Senior Piano Pedagogy Project","description":"Open only to senior piano performance majors pursuing the pedagogy option. Students complete a research paper on a piano pedagogy topic, such as methodology, skills development, or repertoire. Individual instruction. Prerequisite: Upper-division standing and Music 460P with a grade of at least B.","upper":true},{"key":"MUS 368L","name":"Review of Music Theory","description":"An intensive review of the skills and concepts required for the study of music theory at the graduate level. Three lecture hours a week for one semester. May not be counted toward a graduate degree. Prerequisite: Upper-division or graduate standing in music.","upper":true},{"key":"MUS 375J","name":"Twentieth-Century Music Techniques","description":"Restricted to music majors. Review of techniques and methods for analyzing twentieth-century music. Three lecture hours a week for one semester. Music 375J and Music 376J (Topic 1) may not both be counted. Offered on the letter-grade basis only.","upper":true},{"key":"MUS 376G","name":"Special Topics in Music Literature","description":"Three class hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"MUS 376J","name":"Special Topics in Music Theory","description":"Three class hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"MUS 176M","name":"Special Topics in Music Studies","description":"One class hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"MUS 677P","name":"Internship and Final Project","description":"Restricted to seniors. Practical experience in the music and recording industry related to the student's area of interest within the music business, recording technology, or electronic media. Comprehensive final project addresses entrepreneurship, as well as technical and business elements of the music and recording industry. Forty hours a week for one semester. Prerequisite: Completion of the program requirements for enrollment in an internship course and consent of the program director.","upper":true},{"key":"MUS 379K","name":"Advanced Topics in Music Literature","description":"Three lecture hours a week for one semester. Two or more topics may be taken concurrently. May be repeated for credit when the topics vary. Prerequisite: Music 612 and 313N, or upper-division standing and consent of instructor.","upper":true}]