[{"key":"MBU 339M","name":"Introduction to the Music Business and Entrepreneurship","description":"An overview of the dynamics and business challenges of the contemporary music performance world, with an emphasis on the study of the rapidly changing musical culture and an increasingly competitive and diversified marketplace. Guest lecturers include professional conductors, directors of large performance venues, classical and pop music performers, music critics, songwriters, music publishers, entertainment law attorneys, and record producers. Three lecture hours a week for one semester. Only one of the following may be counted: Music 339M, 376C (Topic: Business of Music), Music Business 339M. Prerequisite: Upper-division standing.","upper":true},{"key":"MBU 339N","name":"Music Entrepreneurship","description":"Further exploration of the dynamics and business challenges of the contemporary music performance world, with emphasis on entrepreneurial savvy, communication skills, fluency with emerging technologies, commitment to audience education, public advocacy for music, and the future health and growth of musical culture. Three lecture hours a week for one semester. Music 339N and Music Business 339N may not both be counted. Prerequisite: Upper-division standing and Music 339M or Music Business 339M.","upper":true},{"key":"MBU 347M","name":"Music Copyright and Publishing","description":"Recording, music publishing, and personal management agreements and how they affect the artist and writer. Includes negotiation considerations, deal points, record company economics and profitability, intellectual property rights, publishing and the control and exploitation of publishing rights in music property, publishing activities, performing rights organizations, catalog sales and acquisitions, publisher and songwriter relations, and royalty accounting. Three lecture hours a week for one semester. Music 347M and Music Business 347M may not both be counted. Prerequisite: Upper-division standing, and credit or registration for Music 339M or Music Business 339M.","upper":true},{"key":"MBU 347N","name":"Topics in the Business of Music and the Arts","description":"Three lecture hours a week for one semester. Music 347N and Music Business 347N may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, and Music 339M or Music Business 339M.","upper":true},{"key":"MBU 377P","name":"Internship and Final Project","description":"Restricted to seniors in the music business concentration. Practical experience in the music industry related to the student's area of interest within the music business. Comprehensive final project addresses entrepreneurship, as well as business elements of the music industry. Forty hours a week for one semester. Only one of the following may be counted: Music 677P, Music Business 377P, Music Recording Technology 377P. Prerequisite: Completion of the program requirements for enrollment in an internship course and consent of the program director.","upper":true}]