[{"key":"MRT 316M","name":"Introduction to Audio Recording","description":"Fundamentals of modern multitrack audio recording, including analog and digital recording, microphones and microphone techniques, basic mixing and signal processing, technology, and terminology. Three lecture hours and three laboratory hours a week for one semester. Music 316M and Music Recording Technology 316M may not both be counted. Prerequisite: Consent of instructor.","upper":false},{"key":"MRT 316N","name":"Intermediate Audio Recording","description":"Intermediate techniques of modern multitrack audio recording, including stereo and remote location recording, intermediate microphone techniques, signal processing and automated mixing, and modern production techniques. Three lecture hours and three laboratory hours a week for one semester, with additional laboratory hours as required. Music 316N and Music Recording Technology 316N may not both be counted. Prerequisite: Music 316M or Music Recording Technology 316M, or consent of instructor.","upper":false},{"key":"MRT 335M","name":"Fundamentals of Digital Audio Workstations","description":"An overview of the history and theory behind digital audio and digital audio recording, including stand-alone and computer-based digital audio workstations. Three lecture hours a week for one semester. Music 335M and Music Recording Technology 335M may not both be counted. Prerequisite: Music 316N or Music Recording Technology 316N, or consent of instructor.","upper":true},{"key":"MRT 335N","name":"Advanced Digital Audio Workstations","description":"Includes advanced editing, MIDI control surfaces, use of Beat Detective application, surround and synchronization, advanced mixing, plug-ins, third-party digital audio workstation add-ons, soft synthesizers and samplers, and digital mastering techniques and practices. Three lecture hours a week for one semester. Music 335N and Music Recording Technology 335N may not both be counted. Prerequisite: Music 335M or Music Recording Technology 335M, or consent of instructor.","upper":true},{"key":"MRT 336C","name":"Computer Audio Production","description":"Desktop music production, including the history of computer music, MIDI and specialized digital audio for multimedia production, loop-based music, contemporary production styles, and music production environments. Three lecture hours a week for one semester. Music 336C and Music Recording Technology 336C may not both be counted. Prerequisite: Music 335N or Music Recording Technology 335N, or consent of instructor.","upper":true},{"key":"MRT 345","name":"Advanced Audio Recording","description":"Contemporary audio recording and production styles. Advanced techniques for specific recordings and musical styles, including ensemble recording in a multitrack environment. Three lecture hours and three laboratory hours a week for one semester, with additional laboratory hours as required. Music 345 and Music Recording Technology 345 may not both be counted. Prerequisite: Music 336C or Music Recording Technology 336C, or consent of instructor.","upper":true},{"key":"MRT 377P","name":"Internship and Final Project","description":"Restricted to seniors in the music recording technology concentration. Practical experience in the music recording industry related to the student's area of interest within recording technology or electronic media. Comprehensive final project addresses entrepreneurship, as well as technical elements of the music recording industry. Forty hours a week for one semester. Only one of the following may be counted: Music 677P, Music Business 377P, Music Recording Technology 377P. Prerequisite: Completion of the program requirements for enrollment in an internship course and consent of the program director.","upper":true}]