[{"key":"PRF 201","name":"Lower-Division Music Performance: Secondary","description":"Individual instruction in music performance for nonmusic majors and for music majors studying a secondary instrument. This course is offered in the following instruments: bassoon, clarinet, double bass, euphonium, flute, French horn, guitar, harp, oboe, organ, percussion, piano, recorder, saxophone, trombone, trumpet, tuba, viola, violin, violoncello, and voice. Individual instruction.  May be repeated for credit. Prerequisite: The ability to read music, and, for most instruments, an audition. For Guitar 201, at least two years of classical guitar lessons. For Piano 201, at least one year of piano lessons.","upper":false},{"key":"PRF 202","name":"Lower-Division Piano: Secondary","description":"Individual instruction beyond Music 210K.  May be repeated for credit when the topics vary. Prerequisite: Consent by audition.","upper":false},{"key":"PRF 210","name":"Lower-Division Music Performance: Principal","description":"Individual instruction in the principal instrument for students pursuing the Bachelor of Arts in Music or the Bachelor of Music with a major in music studies, music theory, composition, music literature, or music performance. This course is offered in the following instruments: bassoon, clarinet, double bass, euphonium, flute, French horn, guitar, harp, oboe, organ, percussion, piano, saxophone, trombone, trumpet, tuba, viola, violin, violoncello, and voice. Individual instruction.  May be repeated for credit. Prerequisite: For Organ 210, Piano 201 or the equivalent.","upper":false},{"key":"PRF 251","name":"Upper-Division Music Performance: Secondary","description":"Individual instruction in music performance for nonmusic majors and for music majors studying a secondary instrument. This course is offered in the following instruments: bassoon, clarinet, double bass, euphonium, flute, French horn, guitar, harp, harpsichord, oboe, organ, percussion, piano, recorder, saxophone, trombone, trumpet, tuba, viola, violin, violoncello, and voice. Individual instruction.  May be repeated for credit. Prerequisite: Course 201 in the secondary instrument for four semesters, or the equivalent, and approval of the area faculty.","upper":true},{"key":"PRF 260","name":"Upper-Division Music Performance: Principal","description":"Individual instruction in the principal instrument for students pursuing the Bachelor of Arts in Music or the Bachelor of Music with a major in music studies, music theory, composition, music literature, or music performance. This course is offered in the following instruments: bassoon, clarinet, double bass, euphonium, flute, French horn, guitar, harp, harpsichord, oboe, organ, percussion, piano, saxophone, trombone, trumpet, tuba, viola, violin, violoncello, and voice. Individual instruction.  May be repeated for credit. Prerequisite: Course 210 in the principal instrument for four semesters, or the equivalent, and approval of the music faculty.","upper":true}]