[{"key":"HDF 304 (TCCN: TECA 1303)","name":"Family Relationships","description":"Same as Women's and Gender Studies 301 (Topic 4: Family Relationships). The process of family interaction over the life cycle. Application of research findings to the understanding of relationships. Only one of the following may be counted: Human Development and Family Sciences 304, 304H, Women's and Gender Studies 301 (Topic 4).","upper":false},{"key":"HDF 304H","name":"Family Relationships: Honors","description":"The process of family interaction over the life cycle. Application of research findings to the understanding of relationships. Three lecture hours a week for one semester. Only one of the following may be counted: Human Development and Family Sciences 304, 304H, Women's and Gender Studies 301 (Topic 4). Offered on the letter-grade basis only. Prerequisite: Consent of the department.","upper":false},{"key":"HDF 312","name":"Family Resource Management","description":"Management concepts and theory in resource allocation used to meet family and life demands. Three lecture hours a week for one semester. Prerequisite: Credit or registration for Human Development and Family Sciences 304.","upper":false},{"key":"HDF 313 (TCCN: TECA 1354)","name":"Child Development","description":"Same as Women's and Gender Studies 313. Motor, language, cognitive, social, and emotional development in the family context. Three lecture hours a week for one semester. Only one of the following may be counted: Human Development and Family Sciences 313, 313H, Women's and Gender Studies 301 (Topic 5), 313. Prerequisite: Credit or registration for Human Development and Family Sciences 113L, and Psychology 301 with grade of at least C-.","upper":false},{"key":"HDF 313H","name":"Child Development: Honors","description":"Motor, language, social, and emotional development of children in the family context, with an emphasis on research findings and evaluations. Three lecture hours a week for one semester. Only one of the following may be counted: Human Development and Family Sciences 313, 313H, Women's and Gender Studies 301 (Topic 5: Child Development). Offered on the letter-grade basis only. Prerequisite: Psychology 301 with a grade of at least B-, credit or registration for Human Development and Family Sciences 113L, and consent of the department.","upper":false},{"key":"HDF 113L","name":"Child Development Laboratory","description":"Students observe children at the University Child and Family Laboratory and relate their observations to the issues discussed in Human Development and Family Sciences 313 and 313H. One and one-half laboratory hours a week for one semester. Prerequisite: Psychology 301 with a grade of at least C- and credit or registration for Human Development and Family Sciences 313 or 313H.","upper":false},{"key":"HDF 315L","name":"Research Methods in Human Development and Family Sciences","description":"Survey of research methods, including observational and experimental techniques. Three lecture hours a week for one semester. Prerequisite: Statistics and Data Sciences 302 (or Statistics and Scientific Computation 302); credit or registration for Human Development and Family Sciences 304, 313, 113L.","upper":false},{"key":"HDF 322","name":"Personal and Family Finance","description":"Overview from the individual and family perspectives of financial planning tools, cash management, consumer credit, basic tax preparation, and insurance selection. Includes application of knowledge to hypothetical situations and case studies. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"HDF 335","name":"Adult Development","description":"Adulthood and the development, changes, and maturation that occurs, including the impact of relationships in adulthood. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and Human Development and Family Sciences 313 and 113L.","upper":true},{"key":"HDF 337","name":"Personal Relationships","description":"Studies intimate relationships, including dating, cohabitation, marriage, and gay and lesbian relationships, as well as situational factors that may influence basic relationship processes. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and Human Development and Family Sciences 304 and 315L with a grade of at least C- in each.","upper":true},{"key":"HDF 338","name":"Developmentally Appropriate Practices with Young Children","description":"Developmentally appropriate practices, the importance of play, arranging environments, material selection, and a basic understanding about centers and activities for young children. Three lecture hours a week for one semester, with an additional three to six hours of fieldwork sometime during the semester. Prerequisite: Upper-division standing; and Human Development and Family Sciences 313 and 113L, or Psychology 304.","upper":true},{"key":"HDF 342","name":"Development of Psychopathology from Infancy through Adolescence","description":"A developmental approach to the study of emotional and behavioral disorders from infancy through adolescence, including attachment disorders, autism, attention deficit disorder, conduct disorder, phobias, obsessive-compulsive disorder, depression, eating disorders, and schizophrenia. Also includes contrasting theories of psychopathology, epidemiology and outcomes of childhood disorders, therapeutic approaches and their efficacy, and developmental resilience. Three lecture hours a week for one semester. Only one of the following may be counted: Human Development and Family Sciences 339, 342, Psychology 339. Prerequisite: Upper-division standing; Human Development and Family Sciences 313 and 113L.","upper":true},{"key":"HDF 343","name":"Human Development in Minority and Immigrant Families","description":"Examines the theories of human development and cultural psychology as they apply to the developmental issues of minority and immigrant children and families. Three lecture hours a week for one semester. Human Development and Family Sciences 343 and 378K (Topic: Child Development in Minority and Immigrant Families) may not both be counted. Prerequisite: Upper-division standing and Human Development and Family Sciences 313, 113L, and 315L with a grade of at least C- in each.","upper":true},{"key":"HDF 345","name":"Peer Relationships","description":"Children's peer relationships from toddlerhood to adolescence. Three lecture hours a week for one semester. Human Development and Family Sciences 345 and 378K (Topic: Peer Relationships) may not both be counted. Prerequisite: Upper-division standing; and Human Development and Family Sciences 313, 113L, and 315L with a grade of at least C- in each.","upper":true},{"key":"HDF 347","name":"Socioeconomic Problems of Families","description":"An analysis of socioeconomic factors affecting the economic well-being of families and individuals. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and six semester hours of coursework in anthropology, economics, education, human development and family sciences, psychology, social work, or sociology.","upper":true},{"key":"HDF 351","name":"Infant Development and Attachment Relationships","description":"The development of emerging social language and cognitive capacities during infancy and toddlerhood and the development and consequences in infant-caregiver attachment security. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; and Human Development and Family Sciences 313, 113L, and 315L with a grade of at least C- in each.","upper":true},{"key":"HDF 352","name":"Field Experience: Community","description":"Practicum in applied settings concerning human development and family sciences. One lecture hour and ten to twelve hours of fieldwork a week for one semester.  May be repeated for credit. Offered on the letter-grade basis only. Prerequisite: Upper-division standing; a University grade point average of at least 2.00; the following coursework with a grade of at least C- in each course: Human Development and Family Sciences 304, 313, 113L, and 315L, Mathematics 408C or 408N, Psychology 301, and Statistics and Scientific Computation 302; Human Development and Family Sciences 312 and 340; nine additional semester hours of upper-division coursework in human development and family sciences; six semester hours of coursework from the list of approved supporting courses available from the School of Human Ecology; and consent of instructor. Admission by application only, filed with the Department of Human Development and Family Sciences by May 1 for enrollment in the following spring semester, or by December 1 for enrollment in the following fall semester.","upper":true},{"key":"HDF 652F","name":"Field Practicum: Community","description":"Designed for students in their last semester. Practicum in settings concerning human development and family sciences. One lecture hour and at least twenty laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing; a University grade point average of at least 2.00; the following coursework with a grade of at least C- in each course: Human Development and Family Sciences 304, 313, 113L, and 315L, Mathematics 408C or 408N, Psychology 301, and Statistics and Scientific Computation 302; Human Development and Family Sciences 312 and 340; nine additional semester hours of upper-division coursework in human development and family sciences; six semester hours of coursework from the list of approved supporting courses available from the School of Human Ecology; and consent of instructor. Admission by application only, filed with the Department of Human Development and Family Sciences by May 1 for enrollment in the following spring semester, or by December 1 for enrollment in the following fall semester.","upper":true},{"key":"HDF 352L","name":"Field Experience: Early Childhood","description":"Study and implementation of skills necessary for planning, guiding, and interacting with young children and their families, and for the management of facilities that provide services for young children. One lecture hour and ten to twelve hours of fieldwork a week for one semester.  May be repeated for credit. Offered on the letter-grade basis only. Prerequisite: Upper-division standing; a University grade point average of at least 2.00; the following coursework with a grade of at least C- in each course: Human Development and Family Sciences 304, 313, 113L, and 315L, Mathematics 408C or 408N, Psychology 301, and Statistics and Scientific Computation 302; Human Development and Family Sciences 312, 338, 340, and 366; three additional semester hours of upper-division coursework in human development and family sciences; six semester hours of coursework from the list of approved supporting courses available from the School of Human Ecology; and consent of instructor. Admission by application only, filed with the Department of Human Development and Family Sciences by May 1 for enrollment in the following spring semester, or by December 1 for enrollment in the following fall semester.","upper":true},{"key":"HDF 652P","name":"Field Practicum: Early Childhood","description":"Designed for students in their last semester. Study and implementation of skills necessary for planning, guiding, and interacting with young children and their families; and for the management of facilities that provide services for young children. One lecture hour and at least twenty laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing; a University grade point average of at least 2.00; the following coursework with a grade of at least C- in each course: Human Development and Family Sciences 304, 313, 113L, and 315L, Mathematics 408C or 408N, Psychology 301, and Statistics and Scientific Computation 302; Human Development and Family Sciences 312, 338, 340, and 366; three additional semester hours of upper-division coursework in human development and family sciences; six semester hours of coursework from the list of approved supporting courses available from the School of Human Ecology; and consent of instructor. Admission by application only, filed with the Department of Human Development and Family Sciences by May 1 for enrollment in the following spring semester, or by December 1 for enrollment in the following fall semester.","upper":true},{"key":"HDF 354","name":"Advanced Personal Financial Planning","description":"Overview from the individual and family perspectives of financial planning and decision-making with regard to home ownership, tax planning, investment alternatives, retirement planning, and estate transfer. Includes application of knowledge to hypothetical situations and case studies. Three lecture hours a week for one semester. Prerequisite: Human Development and Family Sciences 322 with a grade of at least C-.","upper":true},{"key":"HDF 355","name":"Problems Course: Research Practicum","description":"Intensive study of selected problems of a transdisciplinary nature. One lecture hour and nine research hours a week for one semester.  May be repeated for credit. Offered on the letter-grade basis only. Prerequisite: Upper-division standing; a University grade point average of at least 2.00; the following coursework with a grade of at least C- in each course: Human Development and Family Sciences 304, 313, 113L, and 315L, Mathematics 408C or 408N, Psychology 301, and Statistics and Scientific Computation 302; and consent of instructor. Admission by application only, filed with the Department of Human Development and Family Sciences by May 1 for enrollment in the following spring semester, or by December 1 for enrollment in the following fall semester; or consent of instructor. For nonmajors, the application process and prerequisites may be waived by consent of instructor.","upper":true},{"key":"HDF 355H","name":"Problems Course: Honors","description":"Intensive study of selected research problems. One lecture hour and nine research hours a week for one semester.  May be repeated for credit. Offered on the letter-grade basis only. Prerequisite: Upper-division standing; a University grade-point average of at least 3.00; Human Development and Family Sciences 315L with a grade of at least B-; Mathematics 316, Statistics and Scientific Computation 303, 304, 305, or 306 with a grade of at least B-; and consent of the department.","upper":true},{"key":"HDF 356","name":"The Evolution of Relationships","description":"Reviews the scientific literature on the evolution and function of adult romantic relationships. Three lecture hours a week for one semester. Prerequisite: Human Development and Family Sciences 304 or 304H.","upper":true},{"key":"HDF 358","name":"Parent-Child Relationships","description":"The determinants of parenting attitudes and behavior and the effects on children of variations in sensitivity, discipline, and other aspects of parenting. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; and Human Development and Family Sciences 313, 113L, and 315L with a grade of at least C- in each.","upper":true},{"key":"HDF 360","name":"Methods of Family Life Education","description":"An examination, integrating theory and applied knowledge, of the best practices for working with families. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and Human Development and Family Sciences 304 and 315L with a grade of at least C- in each.","upper":true},{"key":"HDF 362","name":"Children and Public Policy","description":"The positive and negative effects of policy on children and the policy landscape in several major domains of child and family life in the United States and in other countries. Three lecture hours a week for one semester. Prerequisite: Six semester hours of upper-division coursework in human development and family sciences, anthropology, education, psychology, sociology, or social work.","upper":true},{"key":"HDF 466","name":"Guidance in Adult-Child Relationships","description":"Same as Women's and Gender Studies 466. Theory and implementation of positive child and adult interactions, communication, and guidance strategies. Two lecture hours and four laboratory hours a week for one semester. Only one of the following may be counted: Human Development and Family Sciences 466, Women's and Gender Studies 345 (Topic 4: Guidance in Adult-Child Relationships), 466. Prerequisite: Human Development and Family Sciences 313 and 113L; and three semester hours of upper-division coursework in human development and family sciences, education, psychology, or sociology.","upper":true},{"key":"HDF 371","name":"Adolescent Development in Context","description":"The biological, cognitive, and social changes that occur during the second decade of life, including the developmental issues faced by adolescents. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; and Human Development and Family Sciences 313, 113L, and 315L with a grade of at least C- in each.","upper":true},{"key":"HDF 372K","name":"Families in Transition","description":"Analysis of interaction, transitions, and crises over the family life span. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and the following courses with a grade of at least C- in each: Human Development and Family Sciences 304 or 304H, and 315L and 337.","upper":true},{"key":"HDF 375","name":"Economic Issues of the Family","description":"Economic issues experienced by families through the various stages of the life span. Three lecture hours a week for one semester. Prerequisite: Human Development and Family Sciences 304, and 312 or 322.","upper":true},{"key":"HDF 378K","name":"Advanced Child and Family Development","description":"Concepts, theories, and issues in human development and family sciences. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in human development and family sciences (or child development), anthropology, education, psychology, sociology, or social work, and consent of instructor.","upper":true},{"key":"HDF 378L","name":"Theories of Child and Family Development","description":"Study and analysis of major theories in human and family development. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; Human Development and Family Sciences 313, 113L, and 315L with a grade of at least C- in each; and three additional semester hours of upper-division coursework in human development and family sciences with a grade of at least C- in each course.","upper":true},{"key":"HDF 379H","name":"Honors Tutorial Course","description":"Supervised individual research on a special topic in human development and family sciences; oral presentation and preparation of a scholarly paper covering the research. May be based on laboratory, library, or field research. Conference course. May be repeated once for credit. Prerequisite: Upper-division standing, a University grade point average of at least 3.00, admission to the human development and family sciences honors program, and consent of the honors adviser. Name of honors adviser and application procedure are available in the division office.","upper":true}]