[{"key":"NTR 307","name":"Introductory Food Science","description":"Application of the principles of food chemistry to processing and preparation techniques. Three lecture hours a week for one semester. Prerequisite: For nutrition majors: Nutrition 312 or 312H with a grade of at least C-, and credit or registration for 107L; for others: Nutrition 306, 312, or 312H with a grade of at least C-.","upper":false},{"key":"NTR 107L","name":"Introductory Food Science Laboratory","description":"Three laboratory hours a week for one semester. Prerequisite: Credit or registration for Nutrition 307.","upper":false},{"key":"NTR 312","name":"Introduction to Nutritional Sciences","description":"Biochemical, physiological, and cellular functions of energy macronutrients, vitamins and minerals, and the scientific basis for current dietary and nutrient recommendations. Designed for science majors. Three lecture hours a week for one semester. Only one of the following may be counted: Nutrition 306, 312, 312H. Prerequisite: Chemistry 301 with a grade of at least C-; credit or registration for Biology 311C and Chemistry 302; and one of the following with a grade of at least C-: Mathematics 408C, 408D, 408N, Statistics and Data Sciences 302 (or Statistics and Scientific Computation 302), 304 (or Statistics and Scientific Computation 304), 306 (or Statistics and Scientific Computation 306), 325H (or Statistics and Scientific Computation 325H), or 328M (or Statistics and Scientific Computation 328M).","upper":false},{"key":"NTR 312H","name":"Introduction to Nutritional Sciences: Honors","description":"Restricted to honors eligible majors in nutritional sciences, biology, biochemistry, and students in the Dean's Scholars Honors Program. Biochemical, molecular, and cellular functions of nutrients with emphasis on primary scientific literature and current methodology. Three lecture hours a week for one semester. Only one of the following may be counted: Nutrition 306, 311, 312, 312H. Prerequisite: The following coursework with a grade of at least C- in each: Chemistry 301 or 301H; and Mathematics 408C or 408n, or the equivalent; and credit or registration for Biology 311C or 315H, and Chemistry 302 or 302H.","upper":false},{"key":"NTR 112L","name":"Introduction to Nutritional Science Laboratory","description":"Collection and evaluation of dietary intake data, nutrient composition of food, and survey of dietetic practice. Three laboratory hours a week for one semester. Prerequisite: Credit or registration for Nutrition 312.","upper":false},{"key":"NTR 312R","name":"Research in Nutritional Sciences","description":"Restricted to honors eligible majors in nutritional sciences, biology, biochemistry, and students in the Dean's Scholars Honors Program. Introduction to biochemical and molecular biological techniques, enzyme and coenzyme assays, dietary analysis and assessment protocols, and statistical methods in nutritional sciences. Preparation of a scholarly paper and oral presentation of research findings. One lecture hour and six laboratory hours a week for one semester. Nutrition 112L and 312R may not both be counted. Prerequisite: The following coursework with a grade of at least C- in each: Chemistry 301 or 301H; and Mathematics 408C or 408N, or the equivalent; and credit or registration for Biology 311C or 315H, Chemistry 302 or 302H, and Nutrition 312H.","upper":false},{"key":"NTR 315","name":"Nutrition through the Life Cycle","description":"Adapting nutrition recommendations to physiological changes throughout the life span. Three lecture hours a week for one semester. Prerequisite: Nutrition 306, 312, or 312H with a grade of at least C-.","upper":false},{"key":"NTR 316","name":"Culture and Food","description":"Influence of culture on foodways around the world. Three lecture hours a week for one semester. Prerequisite: Nutrition 306, 312, or 312H with a grade of at least C-.","upper":false},{"key":"NTR 218","name":"Assessment of Nutritional Status","description":"Assessment of nutritional status using anthropometric, biochemical, clinical, and dietary intake data, and development and implementation of effective care for individuals. Two lecture hours a week for one semester. Nutrition 218 and 318 may not both be counted. Prerequisite: Nutrition 312 and 112L, or 312H and 312R with a grade of at least C- in each; and credit or registration for Nutrition 118L.","upper":false},{"key":"NTR 118L","name":"Assessment of Nutritional Status Laboratory","description":"Three laboratory hours a week for one semester. Prerequisite: Credit or registration for Nutrition 218.","upper":false},{"key":"NTR 321","name":"International Nutrition: The Developing World","description":"Nutrition-related issues in the developing world, including nutrient deficiency and disease, concerns in vulnerable populations (pregnancy, infancy, childhood, and old age), and food aid. Three lecture hours a week for one semester. Prerequisite: Nutrition 306, 312, or 312H with a grade of at least C-.","upper":true},{"key":"NTR 324","name":"Advanced Food Science","description":"Application of the principles of food chemistry to the development of food products. Three lecture hours a week for one semester. Offered in the spring semester only. Prerequisite: Chemistry 320M, Nutrition 307, 107L, and 326 with a grade of at least C- in each; and credit or registration for Nutrition 124L.","upper":true},{"key":"NTR 124L","name":"Advanced Food Science Laboratory","description":"Individual research project on food product development and evaluation. Three laboratory hours a week for one semester. Offered in the spring semester only. Prerequisite: Credit or registration for Nutrition 324.","upper":true},{"key":"NTR 326","name":"Cellular and Molecular Nutrition","description":"Integration of nutrition, genetics, cell biology, and molecular biology. Focuses on the cellular and molecular basis of nutrition-related diseases and nutrient-gene interactions. Three lecture hours and one discussion hour a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each course: Biology 311C, and Nutrition 312 or 312H; and credit or registration for Chemistry 320M, and Nutrition 112L or 312R.","upper":true},{"key":"NTR 126L","name":"Nutritional Sciences Laboratory","description":"Basic laboratory techniques in nutritional sciences. Three laboratory hours a week for one semester. Prerequisite: Credit or registration for Nutrition 326.","upper":true},{"key":"NTR 330","name":"Nutrition Education and Counseling","description":"Application of counseling and learning theories to the care of individuals and groups in community and clinical settings. Three lecture hours and one additional class hour a week for one semester. Prerequisite: Nutrition 315 and 326 with a grade of at least C- in each.","upper":true},{"key":"NTR 331","name":"International Nutrition: Social and Environmental Policies","description":"Explores the nutritional concerns of different countries, environmental aspects of food supply, and social policies needed to balance supply with demand in a sustainable manner. Three lecture hours a week for one semester. Nutrition 331 and 360 (Topic: International Nutrition: Social and Environmental Policies) may not both be counted. Prerequisite: Upper-division standing, and Nutrition 306, 312, or 312H with a grade of at least C-.","upper":true},{"key":"NTR 332","name":"Community Nutrition","description":"National and international issues in public health and nutrition programs. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each course: Nutrition 312 or 312H; 315; and 326.","upper":true},{"key":"NTR 334","name":"Foodservice Systems Management","description":"Procurement, production, and service delivery in foodservice systems. Three lecture hours a week for one semester. Prerequisite: For nutrition majors: Nutrition 307, 107L, and 326 with a grade of at least C- in each, and credit or registration for Nutrition 234L; for others: Nutrition 307 with a grade of at least C-, and one of the following with a grade of at least C-: Nutrition 306, 312, or 312H.","upper":true},{"key":"NTR 234L","name":"Laboratory in Foodservice Systems","description":"Six laboratory hours a week for one semester. Prerequisite: Credit or registration for Nutrition 334.","upper":true},{"key":"NTR 337","name":"Principles of Epidemiology in Nutritional Sciences","description":"Introduction the role of epidemiology methods as the basis for selection of study design and data collection tools in nutrition research such as dietary tools, biomarkers of diet or disease, and anthropometric measurements like obesity. Emphasis on interpretation of study results in nutrition research. Three lecture hours per week for one semester.  Offered on the letter-grade basis only. Prerequisite: Credit with a grade of at least C- or registration for Nutrition 312H or 326, and one of the following with a grade of at least C-: Statistics and Data Sciences 302 (or Statistics and Scientific Computation 302), 304 (or Statistics and Scientific Computation 304), 306 (or Statistics and Scientific Computation 306), 325H (or Statistics and Scientific Computation 325H), or 328M (or Statistics and Scientific Computation 328M).","upper":true},{"key":"NTR 338H","name":"Issues in Nutrition and Health: Honors","description":"Restricted to honors majors in biology, biochemistry, and nutritional sciences, and students in the Dean's Scholars honors program. Identifying, reading, analyzing, writing, and presenting scientific research on selected subjects in nutrition and human health. Detailed literature review as preparation for an honors research thesis. Three lecture hours a week for one semester. Nutrition 338H and 338W may not both be counted. Prerequisite: Biology 325 or 325H; Nutrition 312H and 312R; one of the following: Statistics and Data Sciences 302 (or Statistics and Scientific Computation 302), 303 (or Statistics and Scientific Computation 303), 304 (or Statistics and Scientific Computation 304), 305 (or Statistics and Scientific Computation 305), or 325H (or Statistics and Scientific Computation 325H); and credit or registration for Biology 365S and Chemistry 369, or Chemistry 339K and 339L.","upper":true},{"key":"NTR 338W","name":"Issues in Nutrition and Health","description":"Identifying, reading, analyzing, writing, and presenting scientific research on selected topics in nutrition and human health. Three lecture hours a week for one semester. Nutrition 338H and 338W may not both be counted. Prerequisite: The following with a grade of at least C-: Biochemistry 369 (or Chemistry 369), or Biochemistry 339F (or Chemistry 339K and 339L); Biology 325 and 365S (or 416L); Nutrition 312H or 326; and one of the following with a grade of at least C-: Statistics and Data Sciences 302 (or Statistics and Scientific Computation 302), 304 (or Statistics and Scientific Computation 304), 306 (or Statistics and Scientific Computation 306), 325H (or Statistics and Scientific Computation 325H), or 328M (or Statistics and Scientific Computation 328M).","upper":true},{"key":"NTR 342","name":"Advanced Nutritional Sciences","description":"Biochemical and molecular biological aspects of carbohydrate, fat, and amino acid metabolism. Three lecture hours and one discussion hour a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each course: Biology 325 and 365S (or 416L), Chemistry 369, or 339K and 339L, and Nutrition 326.","upper":true},{"key":"NTR 144M","name":"Advanced Nutrition II Laboratory","description":"Advanced laboratory techniques in nutrition assessment and research. Three laboratory hours a week for one semester. Offered in the spring semester only. Prerequisite: Concurrent enrollment in Nutrition 344 or consent of instructor.","upper":true},{"key":"NTR 245C","name":"Clinical Practice in Medical Nutrition Therapy I","description":"Application of principles of medical nutrition therapy to the care of clients in the practice setting. Nine hours of supervised practice a week for one semester. Prerequisite: Nutrition 370 with a grade of at least C-, credit or registration for Nutrition 371, and admission to the Coordinated Program in Dietetics.","upper":true},{"key":"NTR 345M","name":"Clinical Practice in Medical Nutrition Therapy II","description":"Application of principles of medical nutrition therapy to the care of patients in health care facilities. Forty hours of supervised practice a week for four weeks. Prerequisite: Nutrition 245C and 371 with a grade of at least C- in each. Students must register for Nutrition 372C in the same semester.","upper":true},{"key":"NTR 353","name":"Field Experience in International Nutrition","description":"Supervised study abroad experience designed to help students understand nutrition science issues, applications, related health care practices in a global environment, and other cultures. Students work in schools, hospitals, or similar settings to gain professional experience with food science and dietetics. Five lecture hours and ten field hours a week for five weeks. Prerequisite: Nutrition 306, 312, or 312H with a grade of at least C-; and approval of an application to study abroad.","upper":true},{"key":"NTR 355H","name":"Honors Research","description":"Restricted to honors eligible majors in nutritional sciences, biology, biochemistry, and students in the Dean's Scholars Honors Program. Research in biological, biochemical, or nutritional science, coordinated with readings of scientific literature, and a written research report for each semester in which credit is sought. Nutrition 355 and 355H may not both be counted. May be repeated for credit, but no more than nine semester hours may be counted toward the major in nutrition. Any additional hours must be taken on the pass/fail basis. Prerequisite: Biology 325 or 325H; Nutrition 312H and 312R; and approval of research supervisor.","upper":true},{"key":"NTR 355M","name":"Advanced Food Systems Management","description":"Financial control, quality assurance, personnel administration, foodservice equipment, layout and design in foodservice operations. Analysis and evaluation of an organized foodservice operation. Three lecture hours and four hours of supervised practice a week for one semester. Prerequisite: Accounting 310F or 311, and Nutrition 334 and 234L, with a grade of at least C- in each.","upper":true},{"key":"NTR 360","name":"Selected Topics in Applied Nutrition","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"NTR 365","name":"Selected Topics in Nutritional Sciences","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"NTR 366L","name":"Research Methods in Nutritional Sciences","description":"Focuses on state-of-the-art research in nutrition, including biochemistry and molecular biological techniques for nutrient-gene interactions, enzyme and coenzyme functions, and nutrient analysis of biologic materials. Includes data analysis and statistical methods. One lecture hour and six laboratory hours a week for one semester. Prerequisite: Nutrition 126L with a grade of at least C-.","upper":true},{"key":"NTR 167","name":"Undergraduate Seminar in Nutritional Sciences","description":"One lecture hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"NTR 370","name":"Medical Nutrition Therapy I","description":"The role of nutrition in prevention and treatment of chronic disease such as diabetes and heart disease. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each course: Nutrition 326, Biology 325 or Nutrition 218 and 118L; and credit with a grade of at least C- or registration for Biology 365S (or credit for 416L) and Chemistry 369.","upper":true},{"key":"NTR 371","name":"Medical Nutrition Therapy II","description":"Nutritional care of critically ill patients, including techniques of nutrition support. Three lecture hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each course: Nutrition 326, Biology 325 or Nutrition 218 and 118L; and credit with a grade of at least C- or registration for Biology 365S (or credit for 416L) and Chemistry 369.","upper":true},{"key":"NTR 372C","name":"Practicum in Clinical Dietetics","description":"Supervised practice in health care facilities. Forty hours of supervised practice a week for four weeks. Prerequisite: Admission to the Coordinated Program in Dietetics. Students must register for Nutrition 345M in the same semester.","upper":true},{"key":"NTR 372F","name":"Practicum in Food Services Systems Management","description":"Supervised practice in food service facilities. Forty hours of supervised practice a week for four weeks. Prerequisite: Nutrition 245C and 355M with a grade of at least C- in each, and admission to the Coordinated Program in Dietetics. Students must register for Nutrition 373S in the same semester.","upper":true},{"key":"NTR 373S","name":"Practicum in Dietetic Administration","description":"Supervised practice in the administration of food and nutrition programs. Forty hours of supervised practice a week for three weeks. Prerequisite: Admission to the Coordinated Program in Dietetics. Students must register for Nutrition 372F in the same semester.","upper":true},{"key":"NTR 374C","name":"Practicum in Community Dietetics","description":"Supervised practice in one or more community-based nutrition programs. Forty hours of supervised practice a week for five weeks. Prerequisite: Nutrition 345M, 372C, 372F, and 373S with a grade of at least C- in each; and admission to the Coordinated Program in Dietetics.","upper":true},{"key":"NTR 374P","name":"Advanced Practicum in Dietetics","description":"Culminating experience in the practice of administrative, clinical, or community dietetics. Forty hours of supervised practice a week for five weeks. Prerequisite: Nutrition 345M, 372C, 372F, and 373S with a grade of at least C- in each; and admission to the Coordinated Program in Dietetics.","upper":true},{"key":"NTR 379H","name":"Honors Tutorial Course","description":"Supervised individual research on a special topic in nutrition; oral presentation and preparation of a scholarly paper covering the research. May be based on laboratory, library, or field research. Conference course. May be repeated once for credit. Prerequisite: Consent of the student's research supervisor and the departmental honors adviser.","upper":true}]