[{"key":"TXA 301","name":"Clothing the Planet","description":"Study of the role textiles and apparel play in human lives. Introduction to the textile and apparel industries, and the broad perspective and core skill sets that characterize the field. Subjects include terminology, fibers and fabrics, textile technology, product development through fashion design and retail merchandising, global sourcing and manufacturing, international promotion and marketing, and textile conservation, exhibition, and collection management. Three lecture hours a week for one semester.  Offered on the letter-grade basis only.","upper":false},{"key":"TXA 205","name":"Textiles","description":"Chemical and physical properties of fibers and yarns, fabric construction, and finishes. Two lecture hours a week for one semester. Prerequisite: Credit or registration for Textiles and Apparel 105L.","upper":false},{"key":"TXA 105L","name":"Textiles Laboratory","description":"Three laboratory hours a week for one semester. Prerequisite: Credit or registration for Textiles and Apparel 205.","upper":false},{"key":"TXA 212K","name":"Apparel Industry","description":"Introduction to the integrated apparel design industry from the creative and merchandising perspective. Two lecture hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Textiles and Apparel 212L; and the following coursework with a grade of at least C- in each course: Textiles and Apparel 316L or 316Q; and 319, or 219C and 119L.","upper":false},{"key":"TXA 212L","name":"Apparel Product Development and Design Laboratory","description":"Six laboratory hours a week for one semester. Prerequisite: Credit or registration for Textiles and Apparel 212K.","upper":false},{"key":"TXA 313","name":"Aesthetics: Theory and Practice","description":"Introduction to the theoretical and practical aspects of the principles of design and visual literacy in the field of textiles and apparel. Introduction to the principles and theories that define what is aesthetically pleasing and the vocabulary necessary to identity, describe, and critique them. Three lecture hours a week for one semester.  Offered on the letter-grade basis only.","upper":false},{"key":"TXA 214K","name":"Product Development","description":"Introduction to all stages of product development involved in fashion and functional design. Emphasis on target market identification, cost analysis, material selection, and the organization of product development within the industry structure. Two lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Concurrent registration for Textiles and Apparel 214L.","upper":false},{"key":"TXA 214L","name":"Product Development Laboratory","description":"Application of product development skills and strategies involved in fashion and functional design. Emphasis on target market identification, cost analysis, material selection, and the position of product development within the industry structure. Six laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Concurrent registration for Textiles and Apparel 214K.","upper":false},{"key":"TXA 315K","name":"Field Experience I","description":"Application of merchandising strategic planning in a professional environment with faculty and site director supervision. At least 154 hours of supervised fieldwork for one semester. Prerequisite: Admission to the Retail Merchandising Internship Program.","upper":false},{"key":"TXA 316L","name":"Apparel I","description":"Industrial techniques of pattern design and garment construction. One lecture hour and six laboratory hours a week for one semester. Prerequisite: Credit with a grade of at least C- or registration for Textiles and Apparel 319, or 219C and 119L.","upper":false},{"key":"TXA 316Q","name":"Sewn Products Analysis","description":"Evaluation of soft goods, including materials, quality of work, and costs. Three lecture hours a week for one semester. Prerequisite: Textiles and Apparel 205 and 105L with a grade of at least C- in each.","upper":false},{"key":"TXA 219C","name":"Applied Art in Visual Presentation","description":"Introduction to the principles and elements of design as related to merchandising presentation, display planning, execution, and coordination. Two lecture hours a week for one semester. Students with credit for Textiles and Apparel 319 may not earn credit for Textiles and Apparel 219C or 119L.","upper":false},{"key":"TXA 119L","name":"Applied Art in Visual Presentation Laboratory","description":"Application of the principles and elements of design as related to merchandise presentation, display planning, execution, and coordination. Three laboratory hours a week for one semester. Students with credit for Textiles and Apparel 319 may not earn credit for Textiles and Apparel 119L. Prerequisite: Credit with a grade of at least C- or registration for Textiles and Apparel 219C.","upper":false},{"key":"TXA 325L","name":"History of Dress and Cultural Change I","description":"Social, economic, aesthetic, and political aspects of costume evolution from ancient times through the Renaissance. Three lecture hours a week for one semester. Textiles and Apparel 325K and 325L may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"TXA 325M","name":"History of Dress and Cultural Change II","description":"Social, economic, aesthetic, and political aspects of costume evolution from the Baroque period through modern times. Three lecture hours a week for one semester. Textiles and Apparel 325K and 325M may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"TXA 126","name":"Apparel II","description":"Advanced apparel construction techniques using industry standards and portfolio development. One lecture hour a week for one semester. Prerequisite: Textiles and Apparel 316L with a grade of at least C- and credit or registration for Textiles and Apparel 226L.","upper":true},{"key":"TXA 226L","name":"Apparel II Laboratory","description":"Advanced apparel construction techniques using industry standards and portfolio development. Six laboratory hours a week for one semester. Prerequisite: Credit or registration for Textiles and Apparel 126.","upper":true},{"key":"TXA 327","name":"Clothing and Human Behavior","description":"The social, psychological, and nonverbal significance of clothing and the influence of clothing on behavior. Three lecture hours a week for one semester. Prerequisite: Three semester hours of coursework in psychology, sociology, or the School of Human Ecology.","upper":true},{"key":"TXA 328","name":"Research Methods in Textiles and Apparel","description":"Basic research methodology and academic writing. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, completion of an introductory statistics course, and Textiles and Apparel 205 and 105L with a grade of at least C- in each.","upper":true},{"key":"TXA 331","name":"Textiles and Apparel in a Global Market","description":"Overview of the textiles and apparel industry including apparel industry standards, labor costs, economics, distribution, and structure in the modern global marketplace. Subjects include the analysis of consumption patterns and retailing systems to inform product development; exploring cross-cultural comparisons between global consumer markets; understanding importing and exporting systems and other procedures involved in modern supply chain activities; and grasping the collaborative nature of innovation and design, manufacturing and distribution, retailing, and customer satisfaction leading to sales in the global market. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing.","upper":true},{"key":"TXA 350","name":"Advanced Apparel Design Portfolio","description":"Extensive sociological, cultural, and historic visual research for apparel design. Through a range of projects that incorporate computer-aided design, product illustration, technical packets, proposed production plans, and target market identification, students will produce a professional level, hard copy and online, portfolio that will help prepare them for a career in the apparel industry. The equivalent of three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing; Textiles and Apparel 164K (Topic 1) and 264L (Topic 1); and admission to the Apparel Design Internship Program.","upper":true},{"key":"TXA 151","name":"Pre-Internship Seminar","description":"Preparation course for students seeking internships. Subjects include application, internship interview process, effective professional communication, ethical decision making, leadership development, site expectations, and the impact of business environments on personal and career effectiveness in the field of textiles and apparel. One lecture hour a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing, Textiles and Apparel 301, 205, 105L, 214K, 214L, 316Q, 219C, 119L, and 376.","upper":true},{"key":"TXA 352D","name":"Field Experience in Apparel Design","description":"Application of apparel design techniques and principles in a professional environment. At least 154 hours of fieldwork for one semester. Prerequisite: Admission to the Apparel Design Internship Program, and Textiles and Apparel 164K (Topic 1: Flat Pattern) and 264L (Topic 1: Flat Pattern) with a grade of at least C- in each.","upper":true},{"key":"TXA 352M","name":"Field Experience in Retail Merchandising","description":"Application of merchandising techniques and principles in a professional environment. At least 154 hours of supervised fieldwork for one semester. Prerequisite: Admission to the Retail Merchandising Internship Program.","upper":true},{"key":"TXA 354C","name":"Material Properties and Deterioration","description":"Overview of the major mechanisms of textile deterioration from a variety of sources including light, dirt, various insects and microorganisms, as well as mechanical wear and tear. Examination of the peculiarities of these deterioration phenomena through the study of the basic chemical and physical properties of the fibers constituting the textiles. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing, Chemistry 320M, Textiles and Apparel 260L, and 260M.","upper":true},{"key":"TXA 354D","name":"Instrumental Methods for Conservation Assessment","description":"Overview of primary instrumental methods for evaluating historical textiles in terms of physical characteristics, chemical content, strength loss, structural deterioration, color change, and overall structural integrity and status of impact of environmental factors. Focus on instrumental features, measuring procedures, and interpretation of instrumental data. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Chemistry 320M, Textiles and Apparel 260L, and 260M.","upper":true},{"key":"TXA 354E","name":"Conservation Planning and Preventive Treatments","description":"Implementation and management of textile conservation. Subjects include general requirements for preserving historical textiles, procedures for planning textile conservation projects, and major physical and chemical methods of preventive and postdamage treatments for historical textiles. One lecture hour and four laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Chemistry 320M, Textiles and Apparel 354C, 354D, 260L, and 260M.","upper":true},{"key":"TXA 354F","name":"Advanced Exhibit Planning and Installation","description":"Planning and implementation of a full museum exhibit including budget, selection and preparation of artifacts, prop construction, signage, educational and promotional materials, donor/supporter communication, and opening event. This course serves as a pre-internship/capstone course for conservation science majors. Six laboratory hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Textiles and Apparel 325L, 325M, and 355D.","upper":true},{"key":"TXA 355C","name":"Computer-Aided Design for Apparel","description":"Computer technology used to create textile prints, weaves, illustrations, flat patterns, promotional pieces, and pattern markers. One lecture hour and six laboratory hours a week for one semester. Prerequisite: Textiles and Apparel 205 and 105L with a grade of at least C- in each; and credit with a grade of at least C- or registration for Textiles and Apparel 164K (Topic 1: Flat Pattern) and 264L (Topic 1: Flat Pattern).","upper":true},{"key":"TXA 355D","name":"Textiles Artifact Management and Conservation","description":"Principles and techniques in the identification, documentation, conservation, and exhibition of textile-based artifacts. Six laboratory hours a week for one semester. Prerequisite: Textiles and Apparel 325M.","upper":true},{"key":"TXA 355K","name":"Textile and Apparel Economics","description":"Economic and regulatory aspects of the textile and apparel industries. Three lecture hours a week for one semester. Prerequisite: Textiles and Apparel 205 and 105L with a grade of at least C- in each, and Economics 304K and 304L with a grade of at least C- in each.","upper":true},{"key":"TXA 355N","name":"History of Textiles","description":"Role of textiles in the social, economic, aesthetic, and technological development of society; including production and design of textiles throughout history. Three lecture hours a week for one semester. Prerequisite: Textiles and Apparel 205 and 105L and three semester hours of coursework in art history, with a grade of at least C- in each course.","upper":true},{"key":"TXA 355P","name":"Problems in Retail Merchandising","description":"Intensive study of selected problems related to field experience; development of analytical and problem-solving skills for retailing. At least 154 hours of supervised fieldwork for one semester. Prerequisite: Admission to the Retail Merchandising Internship Program.","upper":true},{"key":"TXA 359H","name":"Honors Reading Course","description":"Supervised individual reading on special subjects. Conference course. Prerequisite: Upper-division standing, a University grade point average of at least 3.00, and consent of the undergraduate adviser.","upper":true},{"key":"TXA 260L","name":"Advanced Textiles","description":"Composition, structure, and properties of textile products; contributions of textile research. Two lecture hours a week for one semester. Prerequisite: Textiles and Apparel 205 and 105L; Chemistry 301, 302, and 204; six semester hours of upper-division coursework in textiles and apparel with a grade of at least C- in each course; and credit with a grade of at least C- or registration for Textiles and Apparel 260M.","upper":true},{"key":"TXA 260M","name":"Advanced Textiles Laboratory","description":"Analysis and evaluation of textile performance. Six laboratory hours a week for one semester. Prerequisite: Credit or registration for Textiles and Apparel 260L.","upper":true},{"key":"TXA 361","name":"Consumer Behavior in the Marketplace","description":"Internal and external factors that influence consumer behavior in the marketplace. Application of concepts and theories from the social sciences to the areas of textiles, clothing, and appearance; experience in conducting market and consumer research. Three lecture hours a week for one semester. Human Ecology 361 and Textiles and Apparel 361 may not both be counted. Prerequisite: Upper-division standing and three semester hours of coursework in economics.","upper":true},{"key":"TXA 164K","name":"Advanced Problems in Clothing","description":"Creative application of flat pattern or draping processes. One lecture hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Textiles and Apparel 212K, 212L, 316L, 126, and 226L, with a grade of at least C- in each; and credit with a grade of at least C- or registration for the same topic of Textiles and Apparel 264L.","upper":true},{"key":"TXA 264L","name":"Advanced Problems in Apparel Laboratory","description":"Six laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Credit with a grade of at least C- or registration for the same topic of Textiles and Apparel 164K.","upper":true},{"key":"TXA 376","name":"Principles of Retail Merchandising","description":"Retail strategic planning and implementation for soft goods and apparel. Three lecture hours a week for one semester. Prerequisite: Marketing 320F and six semester hours of upper-division coursework in textiles and apparel, business, studio art, or journalism.","upper":true},{"key":"TXA 377","name":"Merchandising Systems","description":"Application course focusing on the calculation and analysis of the selling price, profitability, assortment planning, purchasing, and inventory control. Includes spreadsheet application and exercises. Web-based instruction; no class meetings.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing; Textiles and Apparel 301, 205, 105L, 214K, 214L, 316Q, 219C, 119L, 151, and 376; and admission to the Retail Merchandising Internship Program.","upper":true},{"key":"TXA 378H","name":"Honors Seminar in Textiles and Apparel","description":"The equivalent of three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, a University grade point average of at least 3.00, and consent of the honors adviser.","upper":true},{"key":"TXA 379H","name":"Honors Tutorial Course","description":"Supervised individual research on a special topic in textiles and apparel; oral presentation and preparation of a scholarly paper covering the research. May be based on laboratory, library, or field research. Conference course. May be repeated once for credit. Prerequisite: Upper-division standing, admission to the Textiles and Apparel Honors Program, Textiles and Apparel 359H with a grade of at least B-, and consent of the honors adviser.","upper":true}]