[{"key":"CRW 325","name":"Topics in Creative Writing","description":"Detailed study and practice of the techniques of biography, creative nonfiction, or other special topics of creative writing; includes reading and analysis of contemporary models. Three lecture hours a week for one semester. Creative Writing 325 and English 325 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: One of the following: Comparative Literature 315, English 603B, 316L (or 316K), 316M (or 316K), 316N (or 316K), 316P (or 316K), or Tutorial Course 603B.","upper":true},{"key":"CRW 325F","name":"Fiction Writing","description":"Detailed study and practice of the techniques of fiction writing; includes reading and analysis of contemporary models. Three lecture hours a week for one semester. Only one of the following may be counted: Creative Writing 325F, English 325 (Topic 1: Creative Writing: Fiction), 325F. Prerequisite: One of the following: Comparative Literature 315, English 603B, 316L (or 316K), 316M (or 316K), 316N (or 316K), 316P (or 316K), or Tutorial Course 603B.","upper":true},{"key":"CRW 325M","name":"Creative Writing","description":"Detailed study and practice of the techniques of fiction, poetry, and other genres of creative writing; includes reading and analysis of contemporary models. Two lecture hours and one and one half workshop hours a week for one semester. Only one of the following may be counted: Creative Writing 325M, English 315F, 315P. Prerequisite: One of the following: Comparative Literature 315, English 603B, 316L (or 316K), 316M (or 316K), 316N (or 316K), 316P (or 316K), or Tutorial Course 603B.","upper":true},{"key":"CRW 325P","name":"Poetry Writing","description":"Detailed study and practice of the techniques of poetry writing; includes reading and analysis of contemporary models. Three lecture hours a week for one semester. Only one of the following may be counted: Creative Writing 325P, English 325 (Topic 2: Creative Writing: Poetry), 325P. Prerequisite: One of the following: Comparative Literature 315, English 603B, 316L (or 316K), 316M (or 316K), 316N (or 316K), 316P (or 316K), or Tutorial Course 603B.","upper":true},{"key":"CRW 330","name":"Literature for Writers","description":"Readings in fiction, poetry, drama, literary criticism, biography, and autobiography from the point of view of a creative writer. Three lecture hours a week for one semester. Prerequisite: One of the following: Creative Writing 325 (or English 325), 325F (or English 325F), 325M, 325P (or English 325P).","upper":true},{"key":"CRW 340F","name":"Short Story Workshop","description":"Practice in writing the short story, with study of contemporary models. The equivalent of three lecture hours a week for one semester. Creative Writing 340F and English 341 may not both be counted. Prerequisite: Creative Writing 325F (or English 325F), or 325M.","upper":true},{"key":"CRW 340P","name":"Poetry Workshop","description":"Practice in writing poetry, with study of contemporary models. The equivalent of three lecture hours a week for one semester. Creative Writing 340P and English 341L may not both be counted. Prerequisite: Creative Writing 325M or 325P (or English 325P).","upper":true},{"key":"CRW 355F","name":"Advanced Fiction Workshop","description":"A third semester seminar-style workshop in fiction for experienced creative writers. The equivalent of three lecture hours a week for one semester. Only one of the following may be counted: Creative Writing 355F, 660, English 355K. Prerequisite: Creative Writing 340F (or English 341).","upper":true},{"key":"CRW 355P","name":"Advanced Poetry Workshop","description":"A third semester seminar-style workshop in poetry for experienced creative writers. The equivalent of three lecture hours a week for one semester. Creative Writing 355P and English 355K may not both be counted. Prerequisite: Creative Writing 340P (or English 341L).","upper":true},{"key":"CRW 660","name":"Intensive Creative Writing","description":"An accelerated seminar-style workshop for highly motivated students. Designed to be taken over two consecutive summer sessions; offered only during the summer semester. Three lecture-workshop hours a week for two semesters. Completion of this course is equivalent to completion of both Creative Writing 340F and 355F. Only one of the following may be counted: Creative Writing 340F and 355F; or 660; or English 355K. Prerequisite: For 660A, credit or registration for Creative Writing 325F or English 325F; for 660B, Creative Writing 660A.","upper":true},{"key":"CRW 370H","name":"Honors Creative Writing Project","description":"For advanced students already proficient in writing who wish to work under supervision on specific and substantial projects. The equivalent of three lecture hours a week for one semester. Creative Writing 370H and English 367K may not both be counted. Prerequisite: Consent of the honors adviser.","upper":true}]