[{"key":"E 603","name":"Composition and Reading in World Literature","description":"Reading of masterpieces of world literature and intensive training in writing and in critical analysis of literature. Three lecture hours a week for two semesters. Only one of the following may be counted: English 603A, Rhetoric and Writing 306, 306Q, Tutorial Course 603A; only one of the following may be counted: Comparative Literature 315, English 603B, Tutorial Course 603B. Prerequisite: For 603A, admission to the Plan II Honors Program; for 603B, English 603A.","upper":false},{"key":"E 314J","name":"Literature across the Curriculum","description":"Readings selected to highlight the connections between literary study and other fields of inquiry. Three lecture hours a week for one semester. May not be substituted for English 316L (or 316K), 316M (or 316K), 316N (or 316K), or 316P (or 316K). May be repeated for credit when the topics vary. Prerequisite: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"E 314L","name":"Introduction to Literary Studies","description":"Emphasis on skills and methods used in upper-division English courses; intensive practice in writing; and an introduction to field-specific research. Three lecture hours a week for one semester. May not be substituted for English 316L (or 316K), 316M (or 316K), 316N (or 316K), or 316P (or 316K). May be repeated for credit when the topics vary. Prerequisite: One of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"E 314V (TCCN: ENGL 2351)","name":"Introduction to Literature and Culture","description":"Readings focus on minority and ethnic American literatures in their cultural contexts with an emphasis on skills and methods. Intensive practice in writing and an introduction to field-specific research. Three lecture hours a week for one semester. May not be substituted for English 316L (or 316K), 316M (or 316K), 316N (or 316K), 316P (or 316K). May be repeated for credit when the topics vary. Prerequisite: One of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"E 316L","name":"British Literature","description":"Introduction to masterpieces of the British literary tradition, emphasizing historical, generic, and thematic connections. Three lecture hours a week for one semester. Some sections require an additional discussion hour a week. Prerequisite: One of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"E 316M","name":"American Literature","description":"Introduction to masterpieces of the American literary tradition, emphasizing historical, generic, and thematic connections. Three lecture hours a week for one semester. Some sections require an additional discussion hour a week. Prerequisite: One of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"E 316N","name":"World Literature","description":"Introduction to masterpieces of world literature, emphasizing historical, generic, and thematic connections. Three lecture hours a week for one semester. Some sections require an additional discussion hour a week. Prerequisite: One of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"E 316P","name":"Masterworks of Literature","description":"Introduction to masterpieces of literature, emphasizing historical, generic, and thematic connections. Three lecture hours a week for one semester. Some sections require an additional hour a week. Prerequisite: One of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"E 317C","name":"Classics and Classes","description":"Explores how literary classics are made, and the relationship between the classics and various classes of identity, including socioeconomic, ethnic/racial, sexual, and generational. Three lecture hours a week for one semester. English 314J (Topic: Classics and Classes) and 317C may not both be counted. Prerequisite: One of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"E 318M","name":"Introduction to the English Language","description":"Basic linguistic concepts; phonology, syntax, and vocabulary of English; historical, regional, and social variation; applications of linguistics in educational and social action. Three lecture hours a week for one semester. Prerequisite: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"E 318Q","name":"Supervised Research","description":"Student-initiated research conducted with instructor supervision. Three conference hours a week for one semester. May be repeated once for credit. Prerequisite: Approval of written application by supervising instructor and the undergraduate faculty adviser.","upper":false},{"key":"E 320L","name":"Major Writers of the Restoration and Eighteenth Century","description":"A study of the principal writers: Dryden, Pope, Swift, Johnson, Boswell, Burns, and others. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 321","name":"Shakespeare: Selected Plays","description":"A representative selection of Shakespeare's best comedies, tragedies, and histories. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 321K","name":"Introduction to Criticism","description":"Introduction to major terms, issues, and approaches in literary criticism, and their application to the reasoned discussion of poetry, fiction, and drama. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 321L","name":"American English","description":"Same as Linguistics 321L. An overview of the historical development of English in the Americas. Attention to regional, social, and ethnic differences, and their implications for public education. Three lecture hours a week for one semester. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 321P","name":"Shakespeare through Performance","description":"An intensive study of the plays of William Shakespeare, with emphasis on performance as a means of interpretation and an aid to comprehension. Three lecture hours a week for one semester, with additional laboratory hours as required. English 321P and 379M (Topic 4: Shakespeare through Performance) may not both be counted. Prerequisites: Nine semester hours of coursework in English or rhetoric and writing, and consent of instructor.","upper":true},{"key":"E 322","name":"Literature in Translation","description":"World literatures in English translation. Three lecture hours a week for one semester. English 322 and 324 may not both be counted unless the topics vary. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"E 323L","name":"English as a World Language","description":"Same as Linguistics 323L. An account of the spread of English around the world; national, social, and regional varieties. Three lecture hours a week for one semester. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 324","name":"Topics in Language and Literature","description":"Three lecture hours a week for one semester. English 322 and 324 may not both be counted unless the topics vary. Only one of the following may be counted unless the topics vary: English 320M, 324, 376L, 379M, 379N. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Comparative Literature 315, English 603B, 316L (or 316K), 316M (or 316K), 316N (or 316K), or 316P (or 316K), or Tutorial Course 603B.","upper":true},{"key":"E 326K","name":"The Literature of the Middle Ages in Translation","description":"Romances, chronicles, legends, tales, and plays by English, Celtic, and Continental writers. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 326L","name":"Survey of Middle English Language and Literature","description":"Language and literature from 1100 to 1500. Three lecture hours a week for one semester. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 327","name":"The British Novel in the Eighteenth Century","description":"Representative novels and novelists from 1700 to 1832, including typical works of Defoe, Richardson, Fielding, Sterne, Austen, and Scott. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 328","name":"The British Novel in the Nineteenth Century","description":"Representative works by such writers as Dickens, Thackeray, the Brontes, George Eliot, Meredith, and Hardy. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 329R","name":"The Romantic Period","description":"The prose and poetry of writers such as Blake, Wordsworth, Coleridge, Byron, Keats, Shelley, and others. Three lecture hours a week for one semester. English 329K and 329R may not both be counted. English 329L and 329R may not both be counted. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 336E","name":"British Literature: Beginnings through the Renaissance","description":"A survey of major writers, poetry, and prose. Three lecture hours a week for one semester. English 336E and 379N (Topic: British Literature: Beginnings to the Renaissance) may not both be counted. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 337","name":"American Literature: From the Beginnings to 1865","description":"A survey of major writers, poetry, and prose. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 337E","name":"British Literature: The Restoration through the Romantic Era","description":"A survey of major writers, poetry, and prose. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 338","name":"American Literature: From 1865 to the Present","description":"A survey of major writers, poetry, and prose. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 338E","name":"British Literature: The Victorian Era through World War II","description":"A survey of major writers, poetry, and prose. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 340","name":"The American Novel before 1920","description":"Representative novels by such writers as Brown, Melville, Fern, Hawthorne, Twain, Crane, James, Wharton, and Dreiser. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 342","name":"Life and Literature of the Southwest","description":"Verse, fiction, travels, and memoirs, to acquaint students with the literature reflecting the social inheritance of Texas and the neighboring territory. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 343L","name":"Modernism and Literature","description":"Strands of thought and literature that form the network of modernist writing. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 343P","name":"Postmodern Literature","description":"Survey of postmodern writing. As a period, the postmodern extends roughly from the era after World War II, and follows the modern, a term often applied to literature produced since the start of World War I. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 344L","name":"Contemporary Literature and Other Media","description":"A study of the relationship between literary forms and other media (film, television, music, the visual arts). Three lecture hours a week for one semester; additional hours may be required for some topics. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Comparative Literature 315, English 603B, 316L (or 316K), 316M (or 316K), 316N (or 316K), or 316P (or 316K), or Tutorial Course 603B.","upper":true},{"key":"E 348","name":"The Short Story","description":"Extensive readings and analyses of stories by major modern writers such as Faulkner, Hemingway, Joyce, Chekhov, and Kafka, as well as contemporary writers. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Comparative Literature 315, English 603B, 316L (or 316K), 316M (or 316K), 316N (or 316K), 316P (or 316K), or Tutorial Course 603B.","upper":true},{"key":"E 349S","name":"Topics on Major Authors","description":"Intensive study of the works of a single major author or two major authors. Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: English 320M, 349S, 370W, 376L, 376M, 379M, 379N. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in English.","upper":true},{"key":"E 350E","name":"Topics in Language and Literature: Beginnings to 1630","description":"Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: English 320M, 350E, 376L, 379M, 379N. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 350M","name":"Topics in Language and Literature: 1630 to 1830","description":"Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: English 320M, 350M, 376L, 379M, 379N. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 350R","name":"Topics in Language and Literature: 1830 to 1940","description":"Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: English 320M, 350R, 376L, 379M, 379N. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 356","name":"The European Novel","description":"Same as European Studies 347 (Topic 7: The European Novel). Selected masterpieces of continental fiction in English translation; representative novelists of the nineteenth and twentieth centuries. English 356 and European Studies 347 (Topic 7) may not both be counted. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 358J","name":"The Bible as Literature","description":"Same as Religious Studies 355. In-depth literary study of the Bible, with emphasis on the formal features of narrative, hymn, prophecy, apocalypse, gospel, and epistle. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Comparative Literature 315, English 603B, 316L (or 316K), 316M (or 316K), 316N (or 316K), or 316P (or 316K), or Tutorial Course 603B.","upper":true},{"key":"E 358K","name":"The Bible in British and American Literature","description":"Same as Religious Studies 355K. The reading of biblical masterpieces as literature; consideration of different versions of the Bible and their influence on British and American literature. Three lecture hours a week for one semester. English 358K and Religious Studies 355K may not both be counted. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 358Q","name":"Supervised Research","description":"Student-initiated research conducted with instructor supervision. Three conference hours a week for one semester. May be repeated once for credit. Prerequisite: Completion of at least sixty semester hours of coursework, including at least six semester hours of upper-division coursework in English or rhetoric and writing; a University grade point average of at least 3.00; and approval of written application by supervising instructor and the undergraduate faculty adviser.","upper":true},{"key":"E 359","name":"English Drama from 1660 to 1900","description":"Representative drama texts from the Restoration to the beginnings of modern theatre, including Behn, Sheridan, Wilde, and Shaw. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 360K","name":"English Grammar","description":"The study of traditional and transformational grammar. Attention to social differences in language relevant to the teaching of English. Three lecture hours a week for one semester. English 360K and Linguistics 360K may not both be counted. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 360L","name":"English as a World Literature","description":"English literature from around the world, including Canada, Australasia, Africa, and India. Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: English 320M, 360L, 360S, 376L, 379M, 379N. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 360R","name":"Literary Studies for High School Teachers of English","description":"Intended for students seeking a secondary school teaching certificate. The principles and practices of teaching literature in secondary schools. Three lecture hours a week for one semester. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 360S","name":"Literature and Global Society","description":"Contexts for the study of literature and for the study of pressing issues through literature in an age of globalization. Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: English 320M, 360S, 376L, 379M, 379N. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 361K","name":"British Drama to 1642","description":"A survey of early British drama, usually including works by Marlowe, Kyd, Shakespeare, Jonson, Webster, and Middleton. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 362L","name":"The Contemporary British Novel","description":"Representative novels, including those of Joyce, Lawrence, and Woolf. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 363","name":"The Poetry of Milton","description":"All the poetry of Milton, with particular attention to Comus, Samson Agonistes, and Paradise Lost. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 363K","name":"Classic to Romantic","description":"The theory and practice of Classicism in literature and other arts; the rise of the Romanticists in the eighteenth century. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 364D","name":"Topics in Diverse Perspectives on Language and Culture","description":"Studies in English with particular attention to linguistic and cultural diversity. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 364M","name":"History of the English Language","description":"Same as Linguistics 364M. Development of sounds, forms, and vocabulary of the English language from its origins to the present. Three lecture hours a week for one semester. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 364P","name":"Old English","description":"An introduction to Old English with sufficient grammar for a reading knowledge of Old English texts. A course in language, not in linguistics. Three lecture hours a week for one semester. English 364P and 395N (Topic 1: Old English) may not both be counted. May be counted as the equivalent to English 364M in fulfilling the requirements for a Bachelor of Arts degree with a major in linguistics. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 364S","name":"Language and Gender","description":"Same as Women's and Gender Studies 345 (Topic 17: Language and Gender). Linguistic, social, and political dimensions of gender-related speech differences. Three lecture hours a week for one semester. Only one of the following may be counted: English 346S, Linguistics 373 (Topic: Language and the Sexes), Women's and Gender Studies 345 (Topic 17). Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 364T","name":"The English Language and Its Social Context","description":"English language history, theory, and research for students of literature and rhetoric. May include such topics as language diversity and variation, linguistic attitudes, language variety and education, and language and public policy. Three lecture hours a week for one semester. Only one of the following may be counted: English 364T, 376L (Topic: The English Language and Its Social Context), 376L (Topic: The English Language in Its Social Context). Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 366K","name":"Shakespeare: Selected Tragedies","description":"A representative selection of Shakespeare's tragedies. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 367C","name":"Conference Course in Literature and Language","description":"For students who wish to work under supervision on specific projects in literature or language. Three conference hours a week for one semester. May be repeated once for credit. Prerequisite: Completion of at least sixty semester hours of coursework, including at least six semester hours of upper-division coursework in English or rhetoric and writing; a University grade point average of at least 3.00; and approval of written application by supervising instructor and the undergraduate faculty adviser.","upper":true},{"key":"E 367E","name":"English Internship","description":"Research and staff experience working in an appropriate agency or private business. At least twelve hours of fieldwork a week for one semester. May not be counted toward the English major or minor. Offered on the pass/fail basis only. Prerequisite: Completion of at least sixty semester hours of coursework, including at least six semester hours of upper-division coursework in English or rhetoric and writing; a University grade point average of at least 3.00; and approval of written application by the undergraduate faculty adviser.","upper":true},{"key":"E 369","name":"Twentieth-Century Drama","description":"Ibsen and other major dramatists; tradition and innovation in the substance and form of selected modern plays. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 370","name":"Victorian Prose: Essays and Ideas","description":"The prose writer as artist and sage in the cultural, political, religious, and scientific controversies that influence the modern tradition. Representative writers: Carlyle, Mill, Newman, Arnold, Darwin. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 371K","name":"Modern and Contemporary Poetry","description":"Poets that may be studied include Eliot, Auden, Stevens, Thomas, Bishop, Rich, and Merwin. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 372L","name":"The American Renaissance","description":"Selected writers of the pre-Civil War Romantic movement, including Emerson, Douglass, Fuller, Hawthorne, Melville, Thoreau, Whitman, and others. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 372M","name":"American Realism","description":"Selected writers of the post-Civil War realistic movement: Howells, Twain, James, Jewett, Freeman, Crane, and others. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 374G","name":"Beowulf","description":"A word-by-word, line-by-line translation, with special attention to language and context. Three lecture hours a week for one semester. English 374G and 379N (Topic: Beowulf) may not both be counted. Prerequisite: English 364P.","upper":true},{"key":"E 374K","name":"Elizabethan Poetry and Prose","description":"Renaissance thought and culture as revealed in the lyric and narrative poetry and in the prose masterpieces. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 375K","name":"English and American Satire","description":"Theory of satire, with readings in the works of such representative figures as Chaucer, Dryden, Pope, Byron, Twain, and Thurber. Three lecture hours a week for one semester. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 375L","name":"Victorian Literature","description":"Poetry and prose, 1832 to 1901; parallel reading in the novel and drama, and attention to the social and intellectual background of the period. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 376","name":"Chaucer","description":"Introduction to Chaucer's narrative and poetic art, as shown in a selection from the dream poems, Troilus and Criseyde, and the Canterbury Tales. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 376M","name":"Studies in Ethnic American Literature","description":"Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: English 320M, 349S, 370W, 376L, 376M, 379M, 379N. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 376R","name":"African American Literature through the Harlem Renaissance","description":"Same as African and African Diaspora Studies 372E (Topic 4: African American Literature through the Harlem Renaissance). A survey of African American writing, including autobiography, poetry, fiction, and drama. Authors may include Douglass, Jacobs, Frances E. W. Harper, Chestnutt, Du Bois, Hurston, and Hughes. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 372E (Topic 4), 374F (Topic 1), English 376R. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 376S","name":"African American Literature since the Harlem Renaissance","description":"Same as African and African Diaspora Studies 372E (Topic 5: African American Literature since the Harlem Renaissance). The development of African American poetry, drama, fiction, and nonfiction since the Harlem Renaissance. Authors may include Wright, Ellison, Baldwin, Malcolm X, Baraka, Morrison, Shange, and Charles Johnson. Three lecture hours a week for one semester. African and African Diaspora Studies 372E (Topic 5) and English 376S may not both be counted. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 377K","name":"The American Novel after 1920","description":"Representative works by such writers as Faulkner, Hemingway, Fitzgerald, Larsen, Hurston, Morrison, Bellow, Erdrich, and Tan. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 377M","name":"The American Novel after 1960","description":"Examines American novels and short stories from the 1960s to the present. Considers the aesthetic and narrative innovations of the period in light of social, historical, technological, and political developments. Representative authors include Pynchon, Roth, Morrison, DeLillo, Silko, Robinson, Egan, and Diaz. Three lecture hours a week for one semester. English 324 (Topic: American Novels after 1960) and English 377M may not both be counted. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 678S","name":"Shakespeare at Winedale","description":"Study and readings of selected works and criticism, culminating in public performance of the plays. For English 678SB, students are required to be in residence at Winedale near Round Top, Texas. For 678SA, the equivalent of five lecture hours a week for one semester; for 678SB, fifteen to eighteen hours of work a day, including weekends. Offered in the summer session only. English 678S and 379M (Topic 2: Shakespeare at Winedale) may not both be counted. Prerequisite: For 678SA, consent of instructor; for 678SB, English 678SA and consent of instructor.","upper":true},{"key":"E 379","name":"American Literature and Thought: 1600-1840","description":"Early American literature as an embodiment of American thought and experience. Such topics as European ideas in the New World; the political ideas of Hamilton, Jefferson, and Jackson; nationalism; industrialism. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 679H","name":"Honors Tutorial Course","description":"Research into and development of a thesis topic and proposal followed by the writing and defense of a thesis. The equivalent of three lecture hours a week for two semesters. Prerequisite: For 679HA, enrollment in or completion of at least one honors section of an English course, admission to the English Honors Program, and consent of the honors adviser; for 679HB, English 679HA.","upper":true},{"key":"E 379K","name":"American Literature and Thought: 1840-1920","description":"Such topics as transcendentalism, manifest destiny, Utopian thought, and the impact of the theory of organic evolution. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 379L","name":"Contemporary Drama","description":"Major playwrights since 1950, such as Williams, Shepard, Beckett, Stoppard, Churchill, Fugard, and Pinter. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 379P","name":"Drama in Performance","description":"Intensive study of drama through active performance as a means of interpretation and an aid to comprehension. Three lecture hours a week for one semester. English 379M (Topic 6: Modern Drama in Performance) and 379P may not both be counted. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"E 379R","name":"Undergraduate Seminar","description":"Intensive study of selected topics in English. Three lecture hours a week for one semester. Some sections require additional time for film screenings. English 379R and 379S may not both be counted. Only one of the following may be counted unless the topics vary: English 320M, 376L, 379M, 379N, 379R. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in English.","upper":true}]