[{"key":"PGE 305","name":"Energy and the Environment","description":"The forms of current and potential energy sources, and how these might impact the earth's environment. Three lecture hours and one and one-half laboratory hours a week for one semester. May not be counted toward a degree in geological sciences, geosystems engineering and hydrology, or petroleum engineering.","upper":false},{"key":"PGE 310","name":"Formulation and Solution of Geosystems Engineering Problems","description":"Introduction to mathematical equations typically encountered in petroleum and geosystems engineering; methods to solve equations graphically, analytically, and with numerical methods; applications of computers to problem solving. Three lecture hours a week for one semester. Prerequisite: Physics 303K and 103M and credit or registration for Mathematics 427K.","upper":false},{"key":"PGE 312","name":"Physical and Chemical Behavior of Fluids I","description":"Principles of organic chemistry; phase behavior; properties of hydrocarbon gases and liquids and oil field waters; overview of laboratory phase behavior measurements; material balance calculations. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Chemistry 302 with a grade of at least C-.","upper":false},{"key":"PGE 421K","name":"Physical and Chemical Behavior of Fluids II","description":"Applications of thermodynamics and physical chemistry to petroleum and geosystems engineering. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Petroleum and Geosystems Engineering 326, and admission to an appropriate major sequence in engineering or consent of instructor.","upper":true},{"key":"PGE 322K","name":"Transport Phenomena in Geosystems","description":"Applications of mass, heat, and momentum balances to fluid flow problems; shell balances; non-Newtonian fluids; transport processes through permeable media. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Engineering Mechanics 306 and Mathematics 427K with a grade of at least C- in each.","upper":true},{"key":"PGE 323K","name":"Reservoir Engineering I: Primary Recovery","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Classification of subsurface reservoirs by type and recovery mechanism; reserve estimates based on material balance; steady-state and transient fluid flow in permeable reservoir rocks as applied to subsurface engineering problems. Three lecture hours a week for one semester. Petroleum and Geosystems Engineering 323K and 331 may not both be counted. Offered on the letter-grade basis only. Prerequisite: The following with a grade of at least C-: Petroleum and Geosystems Engineering 310, 326, and registration or credit with a grade of at least C- for 427.","upper":true},{"key":"PGE 323L","name":"Reservoir Engineering II: Secondary and Tertiary Recovery","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Introduction to reservoir displacement processes; water and gas injection; enhanced recovery. Three lecture hours a week for one semester. Petroleum and Geosystems Engineering 323 and 323L may not both be counted. Offered on the letter-grade basis only. Prerequisite: Mathematics 427K, Petroleum and Geosystems Engineering 310, 322K, 323K, and 424.","upper":true},{"key":"PGE 323M","name":"Reservoir Engineering III: Numerical Simulation","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Mathematical equations governing fluid flow in reservoirs; numerical methods to solve the equations; numerical reservoir simulation; treatment of wells; history matching; a simulation project performed using a commercial simulator. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Petroleum and Geosystems Engineering 323L.","upper":true},{"key":"PGE 424","name":"Petrophysics","description":"Properties of rocks; measurement and interpretation of petrophysical properties; application of petrophysics to subsurface engineering problems; interaction of resident fluids with rocks. Extensive written reporting. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: For petroleum engineering majors and geosystems engineering and hydrogeology majors, the following coursework with a grade of least C- in each: Petroleum and Geosystems Engineering 333T and Physics 303L; credit or registration for Petroleum and Geosystems Engineering 322K;  and admission to the major sequence; for others, consent of instructor.","upper":true},{"key":"PGE 325L","name":"Cooperative Engineering","description":"This course covers the work period of petroleum engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for three semesters. The student must complete Petroleum and Geosystems Engineering 325LX, 325LY, and 325LZ before a grade and degree credit are awarded. Prerequisite: For 325LX, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 325LY, Petroleum and Geosystems Engineering 325LX and appointment for a full-time cooperative work tour; for 325LZ, Petroleum and Geosystems Engineering 325LY and appointment for a full-time cooperative work tour.","upper":true},{"key":"PGE 225M","name":"Cooperative Engineering","description":"This course covers the work period of petroleum engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for two semesters. The student must complete Petroleum and Geosystems Engineering 225MA and 225MB before a grade and degree credit are awarded. Prerequisite: For 225MA, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 225MB, Petroleum and Geosystems Engineering 225MA and appointment for a full-time cooperative work tour.","upper":true},{"key":"PGE 125N","name":"Cooperative Engineering","description":"Covers the work period of petroleum engineering students in the Cooperative Engineering Program. One lecture hour a week for one semester.  May be repeated for credit. Prerequisite: Petroleum and Geosystems Engineering 325L or 225M, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour.","upper":true},{"key":"PGE 326","name":"Thermodynamics and Phase Behavior","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Basics of phase behavior, classical thermodynamics in terms of material and energy balances, and applications to changes of state of petroleum fluids. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Chemistry 302 with a grade of at least C-, and credit with a grade of at least C- or registration for Mathematics 427K.","upper":true},{"key":"PGE 427","name":"Properties of Petroleum Fluids","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Principles of organic chemistry, phase behavior of multicomponent mixtures, properties of hydrocarbon gases and liquids and oil field waters, overview of laboratory phase behavior measurements, and material balance calculations. Three lecture hours and three laboratory hours a week for one semester. Petroleum and Geosystems Engineering 312 and 427 may not both be counted. Offered on the letter-grade basis only. Prerequisite: Chemistry 302 with a grade of at least C-, and credit with a grade of at least C- or registration for Petroleum and Geosystems Engineering 326.","upper":true},{"key":"PGE 430","name":"Drilling and Well Completions","description":"Elements of rock mechanics, drilling fluids, factors affecting rate of penetration, and well completions, including casing and tubing design. Three lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Engineering Mechanics 319 with a grade of at least C-, credit or registration for Petroleum and Geosystems Engineering 322K, and admission to the major sequence.","upper":true},{"key":"PGE 333T","name":"Engineering Communication","description":"Advanced technical communication skills, with emphasis on writing strategies for technical documents, oral presentations, and visual aids. Three lecture hours a week for one semester. Prerequisite: Rhetoric and Writing 306 with a grade of at least C-.","upper":true},{"key":"PGE 334","name":"Reservoir Geomechanics","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Basic stress and strain analysis; pore pressure and in situ stress estimation and measurement; deformation mechanisms in rock; rock fracture description and analysis; wellbore stresses and failure; wellbore stability analysis; fault stability analysis; depletion-induced reservoir deformation; and hydraulic fracturing. Emphasis on applications to petroleum engineering. Two lecture hours and three laboratory hours a week for one semester. Petroleum and Geosystems Engineering 432 and 334 may not both be counted. Offered on the letter-grade basis only. Prerequisite: Engineering Mechanics 319 and Petroleum and Geosystems Engineering 301 with a grade of at least C- in each.","upper":true},{"key":"PGE 337","name":"Introduction to Geostatistics","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Basic probability and statistics, study of correlated variables, statistical interpolation and simulation, and global optimization. Emphasis is on the ways the results of these procedures are related to geology and fluid flow. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Mathematics 408D or equivalent, and Petroleum and Geosystems Engineering 310 with a grade of at least C- in each.","upper":true},{"key":"PGE 361","name":"Advanced Reservoir Engineering","description":"Secondary recovery methods; computer simulation of reservoir performance; applications to field problems. Three lecture hours a week for one semester. Prerequisite: Petroleum and Geosystems Engineering 326 and 323K (or 331).","upper":true},{"key":"PGE 362","name":"Production Technology and Design","description":"Restricted to students admitted to major sequence in petroleum engineering. Analysis, specification, and characteristics of production systems; inflow performance; wellbore and tubing hydraulics; and artificial lift. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Credit or registration for Petroleum and Geosystems Engineering 430.","upper":true},{"key":"PGE 363","name":"Petroleum Leasing Regulations and Practices","description":"Restricted to students admitted to major sequence in petroleum engineering. Domestic and worldwide regulations associated with petroleum leasing, including offshore areas, and environmental provisions concerning petroleum exploration and production. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Credit or registration for Petroleum and Geosystems Engineering 365 or the equivalent.","upper":true},{"key":"PGE 364","name":"Natural Gas Engineering","description":"Production, transportation, and storage of gas; metering and gauging; performance of wells; estimation of gas reserves; prevention of waste and utilization of natural gas. Three lecture hours a week for one semester. Prerequisite: For petroleum engineering majors, Petroleum and Geosystems Engineering 326, 323K (or 331), and 362 and admission to the major sequence; for others, upper-division standing and consent of instructor.","upper":true},{"key":"PGE 365","name":"Resource Economics and Valuation","description":"Restricted to students admitted to major sequence in petroleum engineering. Derivation of profitability criteria for earth resource investments, project analysis in terms of the interrelation of technical and economic factors, investment analysis in the presence of uncertainty, and project planning. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Petroleum and Geosystems Engineering 310 with a grade of at least C-, and 323K.","upper":true},{"key":"PGE 368","name":"Fundamentals of Well Logging","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Principles, applications, and interpretation of well logs as used in exploration and evaluation of subsurface formations. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Credit for Geological Sciences 316M or 416P, Physics 303L, and 103N with at least a C-; and Petroleum and Geosystems Engineering 424.","upper":true},{"key":"PGE 371","name":"Energy Finance","description":"Restricted to students admitted to major sequence in petroleum engineering. Fundamentals of finance as applied to the petroleum industry, including petroleum project financing techniques, investigating sources of capital, and methods used to evaluate an oil company's financial performance. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Credit or registration for Petroleum and Geosystems Engineering 365.","upper":true},{"key":"PGE 372","name":"Advanced Drilling and Well Completions","description":"Applications of geomechanics in wellbore and near-wellbore problems encountered in drilling and completing high-pressure, high-temperature wells on land and water locations. Three lecture hours a week for one semester. Petroleum and Geosystems Engineering 372 and 379 (Topic: Advanced Drilling and Well Completions) may not both be counted. Prerequisite: Petroleum and Geosystems Engineering 430 and 334 (or 432).","upper":true},{"key":"PGE 373L","name":"Geosystems Engineering Design and Analysis","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Team-oriented design projects involving the application of geologic and engineering methods to the solution of subsurface problems, using field case histories. Projects are selected for each student based on his or her petroleum engineering technical area option. Three lecture hours a week for one semester, with one additional hour a week to be arranged. Petroleum and Geosystems Engineering 373L and 374 may not both be counted. Offered on the letter-grade basis only. Prerequisite: Petroleum and Geosystems Engineering 323K (or 331), 323L, 362, and 368.","upper":true},{"key":"PGE 377","name":"Deepwater Operations","description":"Restricted to students admitted to major sequence in geosystems engineering and hydrogeology or petroleum engineering. Overview of various technical, logistical, and managerial elements that are functionally integrated in deepwater operations, with emphasis on applications in the Gulf of Mexico. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Petroleum and Geosystems Engineering 323K, 430, 334, and 362.","upper":true},{"key":"PGE 378","name":"Applied Reservoir Characterization","description":"Restricted to students admitted to major sequence in petroleum engineering. Reservoir modeling using software tools for statistical analysis of reservoir data; variogram analysis and modeling; spatial interpolation (kriging); tools for data integration in kriging; stochastic simulation of rock-types (lithology), pay thickness/porosity, and permeability; inputting geological models into flow simulation; uncertainty assessment. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Geological Sciences 416M or 316P with at least a C-, and Petroleum and Geosystems Engineering 323K (or 331), and 337.","upper":true},{"key":"PGE 379","name":"Studies in Petroleum and Geosystems Engineering","description":"Special courses or seminars on recent developments in engineering. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Admission to an appropriate major sequence in engineering or consent of instructor.","upper":true},{"key":"PGE 679H","name":"Undergraduate Honors Thesis","description":"Research performed during two consecutive semesters under the supervision of an engineering faculty member; topics are selected jointly by the student and the faculty member with approval by the director of the Engineering Honors Program. The student makes an oral presentation and writes a thesis. Individual instruction for two semesters. Students pursuing both the Bachelor of Arts, Plan II, and a bachelor's degree in engineering may use this course to fulfill the thesis requirement for the Bachelor of Arts, Plan II. Prerequisite: For 679HA, enrollment in the Engineering Honors Program; for 679HB, Petroleum and Geosystems Engineering 679HA and enrollment in the Engineering Honors Program.","upper":true}]