[{"key":"E S 222","name":"Topics in Professional Development","description":"Restricted to engineering students. Small-group seminar involving reading, discussion, and oral reports. Two lecture hours a week for one semester. Engineering Studies 222 and General Engineering 222 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Offered on the pass/fail basis only.","upper":true},{"key":"E S 370H","name":"Engineering Entrepreneurship","description":"Principles of engineering entrepreneurship, including legal aspects and the ethics of practice. Three lecture hours a week for one semester. Engineering Studies 370H and General Engineering 370H may not both be counted. Prerequisite: Admission to an appropriate major sequence in engineering and to the Engineering Honors Program.","upper":true},{"key":"E S 377E","name":"Interdisciplinary Entrepreneurship: Elective","description":"Same as Electrical Engineering 377E. Restricted to engineering students. Projects must differ significantly from those developed for Electrical Engineering 364D and 364E. Focus on skill development and mentoring in start-up formation, technology development, market validation, marketing, sales, operations, human resources, program management, and finance. Includes discussion of intellectual property, social issues in design, as well as ethical and safety considerations. Emphasis on written and oral presentation of start-up activities. The equivalent of three lecture hours a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"E S 279K","name":"Undergraduate Research Experience","description":"Restricted to undergraduate students in the Graduates Linking with Undergraduates in Engineering (GLUE) program. Directed study or research in a selected area of engineering. One lecture hour and three laboratory hours a week for one semester. Engineering Studies 279K and General Engineering 279K may not both be counted. May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: A major in engineering and a University grade point average of at least 3.00.","upper":true},{"key":"E S 279L","name":"Women in Engineering Leadership Seminar","description":"Restricted to engineering students. Lectures, discussions, and exercises related to various leadership issues. Two lecture hours a week for one semester. Engineering Studies 279L and General Engineering 279L may not both be counted. Offered on the pass/fail basis only.","upper":true},{"key":"E S 079M","name":"Undergraduate Research Experience","description":"Restricted to undergraduate students in the Equal Opportunity in Engineering Program.  One lecture hour a week for one semester. Prerequisite: A major in engineering and a University grade point average of at least 3.00.","upper":true}]