[{"key":"EDP 312","name":"Lower-Division Seminar","description":"Issues and research in various areas of educational psychology and the behavioral sciences. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":false},{"key":"EDP 332","name":"Psychological Foundations of Education","description":"Scientific contributions to the understanding of human behavior and educational processes: cultural influences, processes of learning and socialization, classroom management, development, intellectual functioning, and educational achievement. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"EDP 362T","name":"Tests and Measurements","description":"Fundamental psychometric concepts; educational and psychological measurement instruments; constructing, administering, scoring, and interpreting tests for educational and individual evaluation. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"EDP 363","name":"Personality and Behavior","description":"Selected approaches to the study of the dynamics of behavior, its antecedents and its appraisal. Three lecture hours a week for one semester, with additional laboratory hours to be arranged.  May be repeated for credit when the topics vary. Prerequisite: Psychology 301 or another introductory behavioral science course.","upper":true},{"key":"EDP 363M","name":"Personality and Mental Health","description":"Exposition of theories of personality, research literature on mental health and character development, applications of principles and theories to the educative enterprise; applications of personality theory to the guidance of children and youth. Three lecture hours a week for one semester, with additional laboratory hours to be arranged.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in education or other behavioral sciences.","upper":true},{"key":"EDP 367","name":"Studies in Counseling and Psychotherapy","description":"Nature of the counseling process, dynamics of behavior change, client-counselor roles and relationships; an experiencing of the group process as a basis for studying dynamics of individual and group behavior. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Completion of ninety semester hours of coursework, twelve semester hours of upper-division coursework in behavioral sciences, and consent of instructor.","upper":true},{"key":"EDP 371","name":"Introduction to Statistics","description":"Measures of central tendency and variability; correlation and regression; probability and statistical inference; analysis of variance; nonparametric statistics. Three lecture hours a week for one semester, with additional laboratory hours to be arranged.","upper":true},{"key":"EDP 379L","name":"Problems in Educational Psychology","description":"Supervised individual research on selected problems in educational psychology. Three lecture hours a week for one semester.  May be repeated for credit. Prerequisite: Educational Psychology 310 or another introductory behavioral science course.","upper":true}]