[{"key":"EDC 101E","name":"Orientation to Teaching in the Elementary School","description":"Open to all University students. Discussion sessions and assignments in public schools; designed to help students make teaching career decisions. One discussion hour and three hours of fieldwork a week for one semester.  May be repeated for credit.","upper":false},{"key":"EDC 101S","name":"Orientation to Teaching in the Secondary School","description":"Open to all University students. Discussion sessions and assignments in public schools; designed to help students make teaching career decisions. One discussion hour and three hours of fieldwork a week for one semester.  May be repeated for credit.","upper":false},{"key":"EDC 331E","name":"School Organization and Classroom Management in Elementary Schools","description":"Administrative structure of elementary schools; concepts, principles, and strategies for establishing an orderly classroom environment, preventing inappropriate behavior, and promoting student involvement in academic work. Three lecture hours a week for one semester, and sixteen to twenty hours of fieldwork a week in an elementary school. Prerequisite: Admission to the professional development sequence of courses, completion of seventy-two semester hours of coursework, and a University grade point average of at least 2.50.","upper":true},{"key":"EDC 331S","name":"School Organization and Classroom Management in Secondary Schools","description":"Administrative structure of secondary schools; concepts, principles, and strategies for establishing an orderly classroom environment, preventing inappropriate behavior, and promoting student involvement in academic work. Three lecture hours a week for one semester, with at least sixty hours of fieldwork in a secondary school. Prerequisite: Admission to the professional development sequence of courses, completion of seventy-two semester hours of coursework, and a University grade point average of at least 2.50.","upper":true},{"key":"EDC 332S","name":"Designs for Instruction","description":"One of the beginning courses in the professional development sequence for approved programs in secondary education. Three lecture hours a week for one semester, with a single seven-hour media competency evaluation to be arranged. Prerequisite: Admission to the professional development sequence of courses, completion of seventy-two semester hours of coursework, a University grade point average of at least 2.50, and concurrent enrollment in Curriculum and Instruction 331S.","upper":true},{"key":"EDC 333W","name":"Introduction to Teaching","description":"Open to all upper-division students. Overview of the objectives, organization, and operation of schools; the teaching process; teaching as a professional career. Two lecture hours and two hours of fieldwork a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"EDC 339C","name":"Community Literacy","description":"Three lecture hours a week for one semester. Curriculum and Instruction 339C and 371 (Topic 1: Community Literacy) may not both be counted. Prerequisite: Admission to the professional development sequence of courses.","upper":true},{"key":"EDC 339D","name":"Reading Assessment and Development","description":"Three lecture hours a week for one semester. Curriculum and Instruction 339D and 371 (Topic 2: Reading Assessment and Development) may not both be counted. Prerequisite: Admission to the professional development sequence of courses.","upper":true},{"key":"EDC 339E","name":"Secondary School Literacy across the Disciplines","description":"Designed for students in a University secondary teacher preparation program. Three lecture hours a week for one semester. Curriculum and Instruction 339E and 371 (Topic 10: Secondary School Reading in the Content Subjects) may not both be counted.","upper":true},{"key":"EDC 339F","name":"Adolescent Literacy","description":"Designed for students in a University secondary teacher preparation program. Social, political, cultural, emotional, and personal perspectives on adolescent literacy. Subjects may include adolescent literacy practices in and out of school; literacy in relation to identity, peer communities, meaning, communication, and social engagement; curricula that emphasize the social and civic purposes of literacy; and motivation, fulfillment, and democratic participation as educational outcomes. Three lecture hours a week for one semester. Curriculum and Instruction 339F and 371 (Topic 25: Adolescent Literacy) may not both be counted.","upper":true},{"key":"EDC 339G","name":"Literacy Seminar","description":"Three lecture hours a week for one semester. Curriculum and Instruction 339G and 371 (Topic: Literacy Seminar) may not both be counted. Prerequisite: Admission to the professional development sequence of courses.","upper":true},{"key":"EDC 340C","name":"Spanish Language Methods for the Bilingual Classroom Teacher I","description":"Restricted to bilingual generalist certification students. Designed primarily to help prospective bilingual education teachers expand their oral Spanish proficiency for instructional purposes in the bilingual education classroom. Three lecture hours a week for one semester, with field hours to be arranged. Curriculum and Instruction 340C and 371 (Topic 4: Spanish Language and Methods for the Bilingual Classroom Teacher I) may not both be counted. Prerequisite: Credit or registration for Spanish 611D or 312L.","upper":true},{"key":"EDC 340D","name":"Spanish Language Methods for the Bilingual Classroom Teacher II","description":"Restricted to bilingual generalist certification students. Intensive practice in the various aspects and conventions governing literacy within the elementary bilingual education curriculum. Three lecture hours a week for one semester, with field hours to be arranged. Curriculum and Instruction 340D and 371 (Topic 6: Spanish Language and Methods for the Bilingual Classroom Teacher II) may not both be counted. Prerequisite: Curriculum and Instruction 340C, Spanish 611D or 312L, and admission to the professional development sequence of courses.","upper":true},{"key":"EDC 340E","name":"Latino Children's Literature for Bilingual Teachers","description":"Restricted to students seeking certification in bilingual generalist. Covers the use of oral and written literature for children in bilingual programs while examining the history and development of Spanish-language children's literature from social, cultural, and political perspectives. Subjects may include foundational books, authors, and illustrators of Latina/o children's literature; criteria for evaluating culturally authentic children's literature; multimedia and online resources related to bilingual children's literature; and the literary response process. Three lecture hours a week for one semester, with field hours to be arranged. Prerequisite: Knowledge of Spanish and completion of at least thirty-six semester hours of coursework.","upper":true},{"key":"EDC 340F","name":"Foundations of Bilingual Education","description":"Restricted to bilingual generalist certification students. An overview of theory, practice, programs, and policy related to bilingual education as implemented in the United States. Designed to give students an opportunity to learn about and discuss issues related to bilingual education, and the education of linguistically and culturally diverse populations. Three lecture hours a week for one semester, with field hours to be arranged. Curriculum and Instruction 340F and 371 (Topic: Foundations of Bilingual Education) may not both be counted.","upper":true},{"key":"EDC 341C","name":"Early Childhood Education","description":"Introductory exploration of historical antecedents and social and educational issues in early childhood education; analysis of curricula and behavioral practices in early childhood education; and development of sensitivity to particular needs of early childhood populations. Three lecture hours a week for one semester. Curriculum and Instruction 341C and 371 (Topic 7: Early Childhood Education) may not both be counted.","upper":true},{"key":"EDC 341D","name":"Early Childhood Program Development","description":"Preparation for developing appropriate curricula for early childhood education classrooms, including the contexts of curriculum decision making (community, state, culture, and politics); developmentally-appropriate practice and classroom environments; bases for selecting materials; and frameworks for reflecting on decisions. Three lecture hours a week for one semester. Curriculum and Instruction 341D and 371 (Topic 8: Early Childhood Program Development) may not both be counted.","upper":true},{"key":"EDC 343","name":"Informal Science Education","description":"Three lecture hours and one three-hour field laboratory a week for one semester, with one four-hour Saturday field trip to be arranged. Curriculum and Instruction 343 and 371 (Topic 3: Informal Science Education) may not both be counted. Prerequisite: Upper-division standing, six semester hours of coursework in science, or consent of instructor.","upper":true},{"key":"EDC 344","name":"Digital Literacy for Teaching and Learning","description":"Use of digital tools to increase technical, pedagogical, and administrative proficiencies in a series of hands-on laboratory projects involving word-processing, handling of databases and spreadsheets, multimedia presentations, digital image and video editing, web page creation, and tools to create digital storytelling, e-portfolios, and electronic gradebooks. Experiential foundation creates a repertoire of possibilities for content-specific, technology-supported teaching and learning associated with learner-centered, collaborative classrooms. Emphasis on the development of critical perspectives (including pedagogical, social, technical, cultural, ethical, economic, legal, and political) to help youth fully participate in digital learning. Three lecture hours a week for one semester. Curriculum and Instruction 344 and 371 (Topic 15: Computing Tools for Educators) may not both be counted.","upper":true},{"key":"EDC 345","name":"Curriculum Issues in Physical Education","description":"Study of personal teaching and physical education programs. Accompanies student teaching. Three lecture hours a week for one semester. Curriculum and Instruction 345 and 371 (Topic 26: Curriculum Issues in Physical Education) may not both be counted. Prerequisite: A major in applied movement science, admission to the professional development sequence of courses, and concurrent enrollment in Curriculum and Instruction 950W.","upper":true},{"key":"EDC 350","name":"Topics in Educational Studies","description":"Analysis of selected topics and problems in education. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"EDC 365C","name":"Knowing and Learning in Math and Science","description":"Same as UTeach-Natural Sciences 350. Restricted to students in the UTeach-Natural Sciences program. Psychological foundations of learning; problem solving in mathematics and science education utilizing technology; principles of expertise and novice understanding of subject matter; implications of high-stakes testing; and foundations of formative and summative assessment. Three lecture hours a week for one semester; additional hours may be required. Only one of the following may be counted: Curriculum and Instruction 365C, 371 (Topic 21: Knowing and Learning in Math and Science), UTeach-Natural Sciences 350. Prerequisite: Credit with a grade of at least C- or registration for UTeach-Natural Sciences 101.","upper":true},{"key":"EDC 365D","name":"Classroom Interactions","description":"Same as UTeach-Natural Sciences 355. Restricted to students in the UTeach-Natural Sciences program. Principles of delivering effective instruction in various formats (lecture, lab activity, collaborative settings); examination of gender, class, race, and culture in mathematics and science education; overview of policy related to mathematics and science education. Three lecture hours a week for one semester; additional hours may be required. Only one of the following may be counted: Curriculum and Instruction 365D, 371 (Topic 20), UTeach-Natural Sciences 355. Prerequisite: The following courses with a grade of at least C-: Curriculum and Instruction 365C or UTeach-Natural Sciences 350, and UTeach-Natural Sciences 110; and a University grade point average of at least 2.75.","upper":true},{"key":"EDC 365E","name":"Project-Based Instruction","description":"Same as UTeach-Natural Sciences 360. Restricted to students in the UTeach-Natural Sciences program who have earned a passing score on the preliminary portfolio. Foundations of project-based, case-based, and problem-based learning environments; principles of project-based curriculum development in mathematics and science education; classroom management and organization of project-based learning classrooms. Three lecture hours a week for one semester with additional fieldwork hours to be arranged. Only one of the following may be counted: Curriculum and Instruction 365E, 371 (Topic 22: Project-Based Instruction), UTeach-Natural Sciences 360. Prerequisite: Curriculum and Instruction 365D or UTeach-Natural Sciences 355 with a grade of at least C-, and a University grade point average of at least 2.75.","upper":true},{"key":"EDC 370E","name":"Elementary School Subjects","description":"Curriculum content and organization, teaching procedures, materials, and research in elementary school subjects. Three lecture hours a week for one semester, including field hours in elementary schools.  May be repeated for credit when the topics vary. Prerequisite: A University grade point average of at least 2.50.","upper":true},{"key":"EDC 370S","name":"Secondary School Subjects","description":"Curriculum content and organization, teaching procedures, materials, and research in one secondary school subject. Three lecture hours a week for one semester. The topic in the appropriate field is required for secondary school teacher certification. May be repeated for credit when the topics vary. Prerequisite: Admission to the professional development sequence of courses, completion of ninety semester hours of coursework, and six semester hours of upper-division coursework in the appropriate subject; additional prerequisites vary with the topic.","upper":true},{"key":"EDC 370W","name":"All-Level School Subjects","description":"Curriculum content and organization; teaching procedures, materials, and research in one school subject at all grade levels. Three lecture hours a week for one semester. The topic in the appropriate field is required for all-level school teacher certification. May be repeated for credit when the topics vary. Prerequisite: Admission to the professional development sequence of courses.","upper":true},{"key":"EDC 371G","name":"Teaching Young Children","description":"Designed to provide students with frameworks for observing and interacting with young children in classroom settings, and to acquaint students with the teacher's varied roles in early childhood classrooms. Topics include cultural and linguistic diversity; supervising and interacting with children in a range of instructional groupings, including center-based and play-based learning activities and whole-group experiences; planning and implementing appropriate practices and strategies; and record-keeping and assessment. Three lecture hours a week for one semester, and twelve to sixteen hours of fieldwork a week in a public school. Curriculum and Instruction 371 (Topic 19: Guiding Young Children in Groups) and 371G may not both be counted. Prerequisite: Upper-division standing, twelve semester hours of upper-division coursework in education, or consent of the education adviser; and admission to the professional development sequence of courses and a University grade point average of at least 2.50.","upper":true},{"key":"EDC 371R","name":"Reading Difficulties","description":"Reading theory, assessment, materials, and instruction with emphasis on struggling readers; field experiences in reading tutoring. Three lecture hours a week for one semester with additional field hours to be arranged. Curriculum and Instruction 371 (Topic 24: Reading Difficulties) and 371R may not both be counted. Prerequisite: Upper-division standing, twelve semester hours of upper-division coursework in education, or consent of the education adviser; and admission to the professional development sequence of courses and a University grade point average of at least 2.50.","upper":true},{"key":"EDC 373","name":"African Americans in Sports","description":"Same as African and African Diaspora Studies 374D (Topic 12). Theoretical and practical complexities in issues surrounding African Americans in sports, including the relationship between athletics and higher education. Focuses on racial stereotyping, identity theory, and how practical knowledge of these theories can aid in understanding the current state of athletics. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 374D (Topic: African Americans in Sports), 374D (Topic 12), Curriculum and Instruction 373.","upper":true},{"key":"EDC 377","name":"Conference Course in Curriculum and Instruction","description":"Independent studies in instructional methodology and curriculum. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true}]