[{"key":"FIN 320F","name":"Foundations of Finance","description":"Restricted to non-McCombs School of Business majors. Principles of effective financial management, including planning, organization, and control; financial intermediaries; securities markets; evaluating alternative assets, debt, and capital structures. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Business Administration degree. Prerequisite: Upper-division standing; Accounting 310F, or 311 or 311H and 312 or 312H, or 6 hours of accounting coursework.","upper":true},{"key":"FIN 353","name":"Internship in Finance","description":"Restricted to students in a business major. Focuses on students' career goals through academic discussion and evaluations, while placing students in professional internships with public and private enterprises. Internship and discussion hours to be arranged. Only one of the following may be counted toward the Bachelor of Business Administration: Accounting 353J, Business Administration 353, 353H, Finance 353, Management 353, Management Information Systems 353, Marketing 353, Operations Management 353. May not be counted toward the student's major requirement. Offered on the pass/fail basis only. Prerequisite: Completion of forty-five semester hours of college coursework and consent of the departmental internship coordinator.","upper":true},{"key":"FIN 357","name":"Business Finance","description":"Restricted to students in a McCombs School of Business major. Principles of finance, with application to all aspects of the business firm; particular attention to cost of capital, investment decisions, management of assets, and procurement of funds. Three lecture hours a week for one semester. Finance 357 and 357H may not both be counted. Prerequisite: Statistics 309 or 309H, credit or registration for Accounting 312 or 312H, and Business Administration 324 or 324H.","upper":true},{"key":"FIN 357H","name":"Business Finance: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. An investigation of the principles of finance, with application to all aspects of the business firm; particular attention to cost of capital, investment decisions, management of assets, and procurement of funds. Three lecture hours a week for one semester. Finance 357 and 357H may not both be counted. Prerequisite: Economics 304K and 304L, and credit or registration for Accounting 312 or 312H, Business Administration 324 or 324H, and Statistics 371H or 375H.","upper":true},{"key":"FIN 366P","name":"Finance Practicum","description":"Restricted to students accepted to the Financial Analyst Program. Students apply skills in their major area and focus on additional project management skills through group projects conducted in a professional setting. Students may work with a private or a public enterprise. The equivalent of three lecture hours a week for one semester. Prerequisite: Forty-five semester hours of college coursework and consent of instructor.","upper":true},{"key":"FIN 367","name":"Investment Management","description":"Restricted to students in a business major. Investment theory, alternatives, and decision making under differing uncertainties and constraints; formulation of objectives and strategies; development of conceptual managerial perspectives and philosophies for investment environments. Three lecture hours a week for one semester. Finance 367 and 367Q may not both be counted. Prerequisite: Finance 357 or 357H; and credit or registration for Statistics 371G, 371H, 375, or 375H.","upper":true},{"key":"FIN 367Q","name":"Investment Management: Quantitative","description":"Restricted to students in a business major. Quantitative approach to investments; decision making under differing uncertainties and constraints; portfolio theory and applications; formulation of investment strategies; introduction to option pricing; Monte Carlo simulation; and development of conceptual managerial perspectives and philosophies for investment environments. Three lecture hours a week for one semester. Finance 367 and 367Q may not both be counted. Prerequisite: Finance 357 or 357H, and credit or registration for Statistics 375 or 375H.","upper":true},{"key":"FIN 370","name":"Integrative Finance","description":"Restricted to students in a McCombs School of Business major. Integrates financial decision making in functional areas of finance; utilizes various concepts to promulgate strategies, policies, and procedures in managing funds to achieve objectives. Three lecture hours a week for one semester. Prerequisite: Ninety semester hours of college coursework; Finance 367 or 367Q; credit or registration for one of the following: Accounting 353J, 366P, Business Administration 353, 353H, Finance 353, 366P, Management 353, Management Information Systems 353, 366P, Marketing 353, 366P, Operations Management 353, or 366P; and three additional semester hours of coursework in finance or real estate.","upper":true},{"key":"FIN 371M","name":"Money and Capital Markets","description":"Restricted to students in a business major. Development of modern financial markets, with emphasis on the factors that determine interest rates; institutional characteristics and pricing mechanisms of various interest-sensitive securities. Three lecture hours a week for one semester. Prerequisite: Finance 357 or 357H.","upper":true},{"key":"FIN 372","name":"Advanced Topics in Finance","description":"Restricted to students in a McCombs School of Business major. Advanced topics in finance with emphasis on theoretical and quantitative analysis. Three lecture hours a week for one semester, or as required by the topic.  May be repeated for credit when the topics vary. Prerequisite: Credit or registration for Finance 367 or 367Q.","upper":true},{"key":"FIN 373","name":"Research Topics in Finance","description":"Restricted to students in a business major.  The equivalent of three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Finance 357 or 357H, and consent of instructor.","upper":true},{"key":"FIN 374C","name":"Financial Planning and Policy for Large Corporations","description":"Restricted to students in a business major. An in-depth study of theory and practice of corporate financial management in establishing major financial and investment policies; techniques for analysis, evaluation, and control. Three lecture hours a week for one semester. Prerequisite: Finance 357 or 357H.","upper":true},{"key":"FIN 374S","name":"Entrepreneurial Finance","description":"Restricted to students in a business major. Development, implementation, and control of financial plans, strategies, and policies by owner-managers of small and medium-sized firms; analysis of alternatives and decision making. Three lecture hours a week for one semester. Prerequisite: Finance 357 or 357H.","upper":true},{"key":"FIN 375F","name":"Banking and Financial Intermediation","description":"Restricted to students in a business major. Theory of financial intermediation, regulatory environment, interest rates, and asset/liability management with a focus on commercial banking; depository and contractual intermediation. Three lecture hours a week for one semester. Prerequisite: Finance 357 or 357H.","upper":true},{"key":"FIN 376","name":"International Finance","description":"Restricted to students in a business major. The international financial environment, with emphasis on the factors affecting exchange rates and how exchange rate changes affect the firm. Three lecture hours a week for one semester. Prerequisite: Finance 357 or 357H.","upper":true},{"key":"FIN 377","name":"Advanced Investment Analysis","description":"Second course in investments, with emphasis on quantitative applications and the underlying theory in the analysis and management of securities and portfolios. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"FIN 377L","name":"Portfolio Analysis and Management","description":"Restricted to students in a McCombs School of Business major. An exploration of quantitative applications and the underlying theory in the analysis and management of securities and portfolios; designed for students with career goals in investment. Three lecture hours a week for one semester. Prerequisite: Finance 367 or 367Q.","upper":true}]