[{"key":"M E 302","name":"Introduction to Engineering Design and Graphics","description":"Introduction to mechanical engineering education and practice through lectures and laboratory experiences. Graphics and modeling fundamentals for engineering design: freehand sketching, computer modeling of solid geometry, and generation of engineering drawings. Introduction to reverse engineering, computer-aided design, rapid prototyping, and manufacturing. Application of the design process and problem solving through individual and team projects. Two lecture hours and four laboratory hours a week for one semester. Only one of the following may be counted: Mechanical Engineering 302, 210, 210H. Prerequisite: Credit or registration for Mathematics 408C or 408K (or credit for 308K).","upper":false},{"key":"M E 103","name":"Studies in Engineering Design Graphics","description":"Computer laboratory work in engineering design graphics for students with transfer credit for Mechanical Engineering 210 who need additional work. Three computer laboratory hours a week for one semester. May not be counted by students with credit for Mechanical Engineering 302, 210, or 210H. Prerequisite: Consent of the undergraduate adviser.","upper":false},{"key":"M E 205","name":"Introduction to Computers and Programming","description":"Introduction to computer hardware and software systems; programming using a high-level language; mathematical software programming; and introduction to machine language. Includes significant hands-on programming opportunities. One lecture hour and three laboratory hours a week for one semester. May not be taken concurrently with Mechanical Engineering 302. Prerequisite: Credit or registration for Mathematics 408C or 408K (or credit for 308K).","upper":false},{"key":"M E 210","name":"Engineering Design Graphics","description":"Graphics and modeling fundamentals for engineering design: freehand sketching, computer modeling of solid geometry, and generation of engineering drawings. Introduction to reverse engineering, computer-aided design, rapid prototyping, and manufacturing. Application of the design process to problem solving. Individual and team design projects. Two lecture hours and three laboratory hours a week for one semester. Only one of the following may be counted: Mechanical Engineering 302, 210, 210H. May not be counted toward the Bachelor of Science in Mechanical Engineering degree. Prerequisite: Credit or registration for Mathematics 408C or 408K (or credit for 308K).","upper":false},{"key":"M E 210H","name":"Engineering Design Graphics: Honors","description":"Graphics and modeling fundamentals for engineering design: freehand sketching, computer modeling of solid geometry, and generation of engineering drawings. Introduction to reverse engineering, computer-aided design, rapid prototyping, and manufacturing. Application of the design process to problem solving. Individual and team design projects. One lecture hour and four laboratory hours a week for one semester. Only one of the following may be counted: Mechanical Engineering 302, 210, 210H. May not be counted toward the Bachelor of Science in Mechanical Engineering degree. Prerequisite: Credit or registration for Mathematics 408C or 408K (or credit for 308K), and admission to an engineering honors program.","upper":false},{"key":"M E 311","name":"Materials Engineering","description":"An exploration of fundamental aspects of the structure, properties, and behavior of engineering materials. Three lecture hours a week for one semester. Prerequisite: The following courses with a grade of at least C- in each: Chemistry 301, Mechanical Engineering 302, Physics 303K, 103M; and credit or registration for Mechanical Engineering 111L, Physics 303L, and 103N.","upper":false},{"key":"M E 111L","name":"Materials Engineering Laboratory","description":"Hands-on experiments in materials science and engineering topics and microstructure-property relationships discussed in Mechanical Engineering 311. One lecture hour and three laboratory hours a week for one semester. Prerequisite: Mechanical Engineering 302 with a grade of at least C-, and credit or registration for Mechanical Engineering 311.","upper":false},{"key":"M E 218","name":"Engineering Computational Methods","description":"Applied numerical analysis, programming of computational algorithms using mathematical software, and applications of computational methods to the solution of mechanical engineering problems. One and one-half lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Mathematics 427K and Mechanical Engineering 205 with a grade of at least C- in each.","upper":false},{"key":"M E 318M","name":"Programming and Engineering Computational Methods","description":"An investigation of applied numerical analysis, programming of computational algorithms using mathematical software, and applications of computational methods to the solution of mechanical engineering problems. Two lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Mathematics 427K  with a grade of at least C-.","upper":false},{"key":"M E 320","name":"Applied Thermodynamics","description":"First and second laws of thermodynamics; thermodynamic processes, cycles, and heat transfer. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Mechanical Engineering degree. Prerequisite: Chemistry 301, Mathematics 408D, and Physics 303K.","upper":true},{"key":"M E 324","name":"Dynamics","description":"Analysis of motions, forces, momenta, and energies in mechanical systems. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Engineering Mechanics 306 and Mathematics 408D with a grade of at least C- in each.","upper":true},{"key":"M E 325L","name":"Cooperative Engineering","description":"This course covers the work period of mechanical engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for three semesters. Only one of the following may be counted: Mechanical Engineering 325L, 362K, 371K, 377K. The student must complete Mechanical Engineering 325LX, 325LY, and 325LZ before a grade and degree credit are awarded. May be repeated for credit. Prerequisite: For 325LX, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 325LY, Mechanical Engineering 325LX and appointment for a full-time cooperative work tour; for 325LZ, Mechanical Engineering 325LY and appointment for a full-time cooperative work tour.","upper":true},{"key":"M E 225M","name":"Cooperative Engineering","description":"This course covers the work period of mechanical engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for two semesters. The student must complete Mechanical Engineering 225MA and 225MB before a grade and degree credit are awarded. Prerequisite: For 225MA, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 225MB, Mechanical Engineering 225MA and appointment for a full-time cooperative work tour.","upper":true},{"key":"M E 125N","name":"Cooperative Engineering","description":"This course covers the work period of mechanical engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Mechanical Engineering 325LZ or 225MB, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour.","upper":true},{"key":"M E 326","name":"Thermodynamics","description":"Properties, heat and work, first and second laws, thermodynamic processes, introduction to ideal power cycles. Three lecture hours a week for one semester. For some sections, two discussion hours a week are also required. Mechanical Engineering 326 and 326H may not both be counted. Prerequisite: Chemistry 301, Mathematics 408D, and Physics 303K with a grade of at least C- in each.","upper":true},{"key":"M E 326H","name":"Thermodynamics: Honors","description":"Properties, heat and work, first and second laws, thermodynamic processes, introduction to ideal power cycles. Three lecture hours a week for one semester. For some sections, two discussion hours a week are also required. Mechanical Engineering 326 and 326H may not both be counted. Prerequisite: Chemistry 301, Mathematics 408D, and Physics 303K with a grade of at least C- in each, and admission to an engineering honors program.","upper":true},{"key":"M E 330","name":"Fluid Mechanics","description":"Fluid properties, statics, conservation laws, inviscid and viscous incompressible flow, flow in confined streams and around objects. Three lecture hours a week for one semester. Prerequisite: Mathematics 427K, Engineering Mechanics 306, and Mechanical Engineering 326 or 326H with a grade of at least C- in each; and credit or registration for Mechanical Engineering 130L.","upper":true},{"key":"M E 130L","name":"Experimental Fluid Mechanics","description":"Experimental design concepts, uncertainty analysis, and systems analysis as applied to thermodynamics, fluid mechanics, and heat transfer systems. One lecture hour and two laboratory hours a week for one semester. Prerequisite: Credit or registration for Mechanical Engineering 330, 333T.","upper":true},{"key":"M E 333H","name":"Engineering Communication: Honors","description":"Professional communication skills for engineers, with emphasis on research, writing, editing, and oral presentation on topics of social and technical significance in engineering. Students collaborate to publish an online journal. Two lecture hours and two laboratory hours a week for one semester. Mechanical Engineering 333H and 333T may not both be counted. Prerequisite: Rhetoric and Writing 306 with a grade of at least C-, and admission to an appropriate major sequence in engineering and to an engineering honors program.","upper":true},{"key":"M E 333T","name":"Engineering Communication","description":"Professional communication skills for engineers, with emphasis on research, writing, and oral presentation on topics of social and technical significance in engineering. Two lecture hours and two laboratory hours a week for one semester. Mechanical Engineering 333H and 333T may not both be counted. Prerequisite: Rhetoric and Writing 306 with a grade of at least C-, and credit or registration for Mechanical Engineering 130L.","upper":true},{"key":"M E 334","name":"Materials Engineering","description":"Fundamental aspects of the structure, properties, and behavior of engineering materials. Three lecture hours a week for one semester. Prerequisite: The following courses with a grade of at least C- in each: Chemistry 301, Mechanical Engineering 302, Physics 303K, Physics 103M; and credit or registration for Mechanical Engineering 134L, Physics 303L, 103N, and Engineering Mechanics 319; and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 134L","name":"Materials Engineering Laboratory","description":"Hands-on experiments in materials science and engineering topics and microstructure-property relationships discussed in Mechanical Engineering 334. One lecture hour and three laboratory hours a week for one semester. Prerequisite: Mechanical Engineering 302 with a grade of at least C-, concurrent enrollment in Mechanical Engineering 334, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 335","name":"Engineering Statistics","description":"Fundamentals of probability, distribution theory, data analysis and statistics, interval estimation, hypothesis testing, and statistical quality control. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Mathematics 408D and Mechanical Engineering 205 or 318M with a grade of at least C- in each.","upper":true},{"key":"M E 336","name":"Materials Processing","description":"Effects of processing on materials properties; materials selection. Three lecture hours a week for one semester. Prerequisite: Mechanical Engineering 334 (or 311) and 134L (or 111L) or the equivalent and Engineering Mechanics 319 with a grade of at least C- in each, concurrent enrollment in Mechanical Engineering 136L, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 136L","name":"Materials Processing Laboratory","description":"Hands-on study of selected materials processing procedures and processing-microstructure-property relationships discussed in Mechanical Engineering 336. One lecture hour and three laboratory hours a week for one semester. Prerequisite: Mechanical Engineering 111L and Engineering Mechanics 319 with a grade of at least C- in each, concurrent enrollment in Mechanical Engineering 336, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 337C","name":"Introduction to Nuclear Power Systems","description":"Radioactivity, nuclear interactions: fission and fusion, fission reactors, nuclear power systems, nuclear power safety. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 218 and Physics 303L and 103N with a grade of at least C- in each, and admission to an appropriate major sequence in engineering; for nonengineering majors, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 337F","name":"Nuclear Environmental Protection","description":"Ionizing radiation and its interactions with matter and living tissues; radioactive decay kinetics; external and internal dose measurement; transportation through the environment; managing radioactive waste streams; and safeguards. Three lecture hours a week for one semester. May not be counted by students with credit for Mechanical Engineering 337D and 337E. Mechanical Engineering 337F and 389C may not both be counted. Prerequisite: For engineering majors, Physics 303L and 103N with a grade of at least C- in each and admission to an appropriate major sequence in engineering; for others, upper-division standing.","upper":true},{"key":"M E 337G","name":"Nuclear Safety and Security","description":"An investigation of policy and technical aspects related to nuclear safety and security. Participants will evaluate the proliferation of risk from facilities within the nuclear fuel cycle. They will calculate the criticality conditions for a nuclear assembly and derive parent/daughter decay equations. Nuclear forensics evaluations will be conducted on real-world environmental measurements. Three lecture hours a week for one semester. Only one of the following may be counted: Mechanical Engineering 337G, 388H, Operations Research and Industrial Engineering 390R (Topic 15: Nuclear Safety and Security). Prerequisite: For engineering majors, Physics 103N and 303L with a grade of at least C- in each and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 338","name":"Machine Elements","description":"Analysis for the design and manufacture of basic mechanical elements, and their role in the design of machines; application of finite element modeling. Three lecture hours a week for one semester. Prerequisite: Engineering Mechanics 319 and Mechanical Engineering 334 (or 311) or the equivalent with a grade of at least C- in each, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 339","name":"Heat Transfer","description":"Steady and transient heat conduction; forced and natural convection; radiation; introduction to heat exchangers and applications. Three lecture hours a week for one semester. Prerequisite: Mechanical Engineering 218 or 318M, 330, and 130L with a grade of at least C- in each, concurrent enrollment in Mechanical Engineering 139L, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 139L","name":"Experimental Heat Transfer","description":"Experimental design concepts, uncertainty analysis, and systems analysis as applied to thermodynamics, fluid mechanics, and heat transfer systems. One lecture hour and two laboratory hours a week for one semester. Prerequisite: Concurrent enrollment in Mechanical Engineering 339 and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 340","name":"Mechatronics","description":"Theory and application of electrical circuits, electronics, and electromechanical devices; concepts in electrical power transmission; instrumentation; feedback; integration of electronics and instrumentation with mechanical engineering systems (mechatronics). Three lecture hours a week for one semester. Prerequisite: Mathematics 408D, Mechanical Engineering 205 or 318M, and Physics 303L and 103N with a grade of at least C- in each, concurrent enrollment in Mechanical Engineering 140L, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 140L","name":"Mechatronics Laboratory","description":"Hands-on laboratory using hand-held and bench-top electronic test and prototyping equipment for circuits and mechatronics applications; computer-aided instrumentation and data acquisition; laboratory study in design, prototyping, and testing with electrical and electronics components and electromechanical devices. One lecture hour and two laboratory hours a week for one semester. Prerequisite: Mechanical Engineering 205 or 318M, concurrent enrollment in Mechanical Engineering 340, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 343","name":"Thermal-Fluid Systems","description":"Analysis and design of integrated systems involving simultaneous application of thermodynamics, heat transfer, and fluid mechanics. Applications to power generation, vehicle engineering, materials processing, environmental control, and manufacturing. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Mechanical Engineering 330, 130L, 339, and 139L with a grade of at least C- in each; and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 344","name":"Dynamic Systems and Controls","description":"Lumped physical system models; electrical, fluid, mechanical, and thermal system analysis; linear system transient, steady-state behavior; introduction to feedback control. Three lecture hours a week for one semester. Prerequisite: Mathematics 427K and Mechanical Engineering 205 or 318M, and 324 with a grade of at least C- in each; Mechanical Engineering 340 and 140L or their equivalents with a grade of at least C- in each; concurrent enrollment in Mechanical Engineering 144L or 244L; and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 347","name":"Processing of Materials","description":"Analysis of forces in processing operations; effects of friction and their control; metalworking efficiencies. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For engineering majors, Mechanical Engineering 334 or the equivalent, and admission to an appropriate major sequence in engineering; for nonengineering majors, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 348C","name":"Introduction to Mechatronics I","description":"Integrated use of mechanical, electrical, and computer systems for information processing and control of machines and devices. System modeling, electromechanics, sensors and actuators, basic electronics design, signal processing and conditioning, noise and its abatement, grounding and shielding, filters, and system interfacing techniques. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 340 or the equivalent and admission to an appropriate major sequence in engineering; for nonengineering majors, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 348D","name":"Introduction to Mechatronics II","description":"Interfacing microcomputers with sensors and actuators; hybrid (analog/digital) design; digital logic and analog circuitry; data acquisition and control; microcomputer architecture, assembly language programming; signal conditioning, filters, analog-to-digital and digital-to-analog conversion. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 340 or the equivalent and admission to an appropriate major sequence in engineering; for nonengineering majors, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 349","name":"Corrosion Engineering","description":"Corrosion principles; electrochemical, environmental, and metallurgical effects; types of corrosion; corrosion testing and prevention; modern theories: principles and applications. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 334 (or 311) or the equivalent with a grade of at least C-, Mechanical Engineering 326 (or 326H) or the equivalent with a grade of at least C-, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 350","name":"Machine Tool Operations for Engineers","description":"Hands-on manual and computer-numerical-controlled machine tool operation. Part design and tool selection for production. One lecture hour and six laboratory hours a week for one semester. Mechanical Engineering 350 and 379M (Topic 7: Machine Tool Operations for Engineers) may not both be counted. Offered on the letter-grade basis only. Prerequisite: Admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 352K","name":"Engineering Computer Graphics","description":"Introduction to interactive computer graphics as a tool in computer-aided design. Use of graphics software packages. Two lecture hours and three laboratory hours a week for one semester. Prerequisite: For engineering majors, admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 353","name":"Engineering Finance","description":"Evaluating the financial impact of engineering decisions. Comparing alternatives with cash flow analysis considering rate of return, inflation, and taxes, with emphasis on analyzing risk. Managing complex projects with activity scheduling and resource allocation considering cash flows. Methods include probabilistic analysis and simulation. Three lecture hours and two discussion hours a week for one semester. Prerequisite: Mathematics 408C, Mechanical Engineering 205 or 318M, and 335 with a grade of at least C- in each.","upper":true},{"key":"M E 354","name":"Introduction to Biomechanical Engineering","description":"The application of mechanical engineering principles to problems in the life sciences; transport phenomena of physiological solids and fluids; biosignal analysis and instrumentation; biomaterials design and compatibility; principles of medical imaging, diagnostics, and therapeutics; rehabilitation engineering. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mathematics 427K with a grade of at least C- and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 354M","name":"Biomechanics of Human Movement","description":"Modeling and simulation of human movement; neuromuscular control; computer applications; introduction to experimental techniques. Three lecture hours a week for one semester. Prerequisite: For engineering majors, admission to an appropriate major sequence in engineering; for nonengineering majors, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 355K","name":"Engineering Vibrations","description":"Time-domain and frequency-domain analysis of vibrating systems; matrix methods, instrumentation, and vibration control; numerical methods. Three lecture hours a week for one semester. Prerequisite: Mechanical Engineering 324 with a grade of at least C-, Mathematics 427K with a grade of at least C-, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 360","name":"Vehicle System Dynamics and Controls","description":"Fundamentals of ground vehicle dynamics, tire-road mechanics, vehicle control systems, vehicle stability, and simulation of vehicle systems. Three lecture hours a week for one semester. Only one of the following may be counted: Mechanical Engineering 360, 379M (Topic: Vehicle System Dynamics and Controls), 390, 397 (Topic: Vehicle System Dynamics and Controls). Prerequisite: For engineering majors, upper-division standing, admission to an appropriate major sequence in engineering, and Mechanical Engineering 344 with a grade of at least C-; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 360L","name":"Turbomachinery and Compressible Flow","description":"Positive displacement and dynamic rotating machinery; pumps, compressors, and turbines; performance characteristics and scaling laws. One-dimensional compressible flow with area change, friction, or heat addition. Normal and oblique shock waves; Prandtl-Meyer expansion. Three lecture hours a week for one semester. Prerequisite: Mechanical Engineering 330, 130L and 139L, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 360N","name":"Intermediate Heat Transfer","description":"Multidimensional and transient diffusion; laminar and turbulent convection; radiation exchange; special topics. Three lecture hours a week for one semester. Prerequisite: Mechanical Engineering 339 and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 361E","name":"Nuclear Reactor Operations and Engineering","description":"Fission and chain reactions; neutron diffusion and moderation; reactor equations; Fermi Age theory; and multigroup and multiregional analysis. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 218 and Physics 303L and 103N with a grade of at least C- in each, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 361F","name":"Radiation and Radiation Protection Laboratory","description":"Introduction to the application of radiation and radiation protection instrumentation. Lecture and laboratory topics include personnel monitoring, radiation detection systems, gamma-ray spectroscopy, determination of environmental radiation, counting statistics, gamma and neutron shielding, and air sampling. Two lecture hours and three laboratory hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 218 with a grade of at least C-, Physics 303L and 103N with a grade of at least C- in each, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 362K","name":"Readings in Engineering","description":"A study of the interrelated problems of society, technology, and energy. Three lecture hours a week for one semester. Only one of the following may be counted: Mechanical Engineering 325L, 362K, 371K, 377K. Prerequisite: Admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 363L","name":"Energy Systems Laboratory","description":"Experimental analysis of thermal energy systems, including heat transfer equipment, engines, the University chilling station and the University power plant. Use of a variety of industrial instrumentation for assessment of system and component performance and of experimental uncertainty. Written and oral technical communication of experimental results. Two lecture hours and three laboratory hours a week for one semester. Prerequisite: Mechanical Engineering 339, 139L, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 364L","name":"Automatic Control System Design","description":"Feedback principles; control components; industrial compensators; Routh, Nyquist, Bode, and root locus methods; controller design; continuous and discrete time control. Three lecture hours and one-half laboratory hour a week for one semester. Prerequisite: Mechanical Engineering 344 and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 365K","name":"Finite Element Method","description":"Introduction and application of the finite element method in engineering analysis and design problems; demonstration of techniques using commercial codes. Three lecture hours a week for one semester. Prerequisite: Engineering Mechanics 319 and Mathematics 427K with a grade of at least C- in each, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 365L","name":"Industrial Design for Production","description":"Current techniques for making transitions from theoretical concepts to cost effective designs suitable for manufacturing. Three lecture hours a week for one semester. Prerequisite: Mechanical Engineering 338 and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 366J","name":"Mechanical Engineering Design Methodology","description":"Restricted to students admitted to an appropriate engineering major sequence. An examination of structured methodologies for designing mechanical systems; reverse engineering/redesign projects and conceptual design projects. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: The following coursework with a grade of at least C- in each: Mechanical Engineering 302, 330, 130L, 335, 338, 339, 139L, 340, and 140L; one of the following with a grade of at least C-: Mechanical Engineering 333H, 333T, Aerospace Engineering 333T, Biomedical Engineering 333T, Chemical Engineering 333T, Civil Engineering 333T, Electrical Engineering 333T, or Petroleum and Geosystems Engineering.","upper":true},{"key":"M E 266K","name":"Mechanical Engineering Design Project","description":"Creative design, analysis, selection, development, and fabrication of engineering components and systems. Development of team project with faculty adviser and sponsoring engineer. Two lecture hours a week for one semester, with additional hours to be arranged. Prerequisite: Mechanical Engineering 344, 144L or 244L, 353, and 366J with a grade of at least C- in each.","upper":true},{"key":"M E 366L","name":"Operations Research Models","description":"Formulation and solution-interpretation for operations research models requiring, for example, optimization, simulation, or analysis of Markov chains or queues. Applications include manufacturing design and control, routing and scheduling, plant location, inventory analysis, and management of queueing systems. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mathematics 408D and Mechanical Engineering 205 with a grade of at least C- in each, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 266P","name":"Design Project Laboratory","description":"Development of individual team project in association with faculty adviser and sponsoring project engineer. Four laboratory hours a week for one semester. Prerequisite: Mechanical Engineering 344, 144L or 244L, 353, and 366J with a grade of at least C- in each.","upper":true},{"key":"M E 366Q","name":"Deterministic Methods for Operations Research","description":"Theory and algorithms for deterministic operations research methods. Algorithms for solving linear, integer, and nonlinear optimization models. Three lecture hours a week for one semester. Prerequisite: For engineering majors, admission to an appropriate major sequence in engineering; for nonengineering majors, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 366R","name":"Stochastic Methods for Operations Research","description":"Theory and algorithms for stochastic operations research methods. Algorithms related to stochastic processes: Markov chain analysis; queueing theory; stochastic inventory theory and decision analysis. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 335 or the equivalent, and admission to an appropriate major sequence in engineering; for nonengineering majors, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 367S","name":"Simulation Modeling","description":"Basic concepts of discrete-event simulation. Statistical input and output analysis. Application of simulation software. Modeling of systems under uncertainty. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 205 with a grade of at least C-, Mechanical Engineering 335 or the equivalent, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 368J","name":"Computer-Aided Design","description":"Application of computers to design problems and simulation of mechanical systems; creation of interactive special applications programs. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Credit or registration for Mechanical Engineering 338 and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 369L","name":"Introduction to Computational Fluid Dynamics","description":"Applied numerical analysis, including solution of linear algebraic equations and ordinary and partial differential equations; modeling of physical processes, including fluid flow and heat and mass transfer; use of general purpose computer codes, including commercial computational fluid dynamics software packages. Three lecture hours a week for one semester. Aerospace Engineering 347 and Mechanical Engineering 369L may not both be counted. Prerequisite: Credit or registration for Mechanical Engineering 330 and 339 and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 369P","name":"Application Programming for Engineers","description":"Designed for students who have some experience in programming and are interested in the sharing and development of open source software applications. Provides an introduction to the Python Programming language, an open source, flexible, and intuitive debug programming language, with an emphasis on system modeling, simulation, data analysis, and software/data management. Students will create mini projects in Python that demonstrate software design and organization, debugging, open source practices, and data visualization. Three lecture hours a week for one semester. Prerequisite: For engineering majors, upper-division standing, admission to an appropriate major sequence in engineering, and Mechanical Engineering 318M or the equivalent with a grade of at least C-; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 371K","name":"Legal Aspects of Engineering Practice","description":"Legal considerations in the practice of engineering; specifications and contracts for equipment and engineering services. Three lecture hours a week for one semester. Only one of the following may be counted: Mechanical Engineering 325L, 362K, 371K, 377K. Prerequisite: Upper-division standing and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 372J","name":"Robotics and Automation","description":"Component technologies for precision machines based on dynamic modeling and motion programming: cams, linkages, planar manipulators. Three lecture hours a week for one semester. Prerequisite: Credit or registration for Mechanical Engineering 324 and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 372M","name":"Mechanism Design","description":"Design of planar mechanisms for applications that require rigid body guidance, function generation, and path generation. Graphical and analytical techniques. Computer-aided design projects. Three lecture hours a week for one semester. Prerequisite: Credit or registration for Mechanical Engineering 324 and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 372N","name":"Design of Smart Mechanisms","description":"Design of reprogrammable multiple-degree-of-freedom architectures. The course addresses various mechanical configurations and stresses the integrated design approach to sensing/actuation/control architecture and control software. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"M E 373K","name":"Basic Industrial Engineering","description":"Design and analysis of production systems, including plant layout and location, material flow, and flexible manufacturing. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 205 or the equivalent with a grade of at least C-, Mechanical Engineering 335 or the equivalent, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 374C","name":"Combustion Engine Processes","description":"Principles of internal combustion engines, fuels, carburetion, combustion, exhaust emissions, knock, fuel injection, and factors affecting performance. Three lecture hours a week for one semester. Prerequisite: Mechanical Engineering 339 or consent of instructor, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 374D","name":"Automotive Engineering Laboratory","description":"Engines and emissions. Students use commercial engine-modeling software to explore effects of valve timing and intake tuning and conduct experiments with vehicle emissions, ignition timing, engine mechanisms, engine controls, and emissions control. One lecture hour and four laboratory hours a week for one semester. Prerequisite: Credit or registration for Mechanical Engineering 374C and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 374F","name":"Fire Science","description":"Analysis of the dynamics and consequences of fire in structures. Topics include combustion thermochemistry, premixed and diffusion flames, fluid mechanics of fire, human tenability in burning structures, and computer modeling of fires. Three lecture hours a week for one semester. Prerequisite: For engineering majors, upper-division standing and credit or registration for Mechanical Engineering 339 and 139L with a grade of at least C- in each; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 374L","name":"Design of Thermal Systems","description":"Methodology and approach to design of thermal energy systems; component and system modeling; optimization, including economic considerations. Three lecture hours a week for one semester. Prerequisite: Mechanical Engineering 339 or the equivalent, and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 374R","name":"Design of Air Conditioning Systems","description":"Load calculations, design of thermal distribution systems, component selection and control. Three lecture hours a week for one semester. Prerequisite: Credit or registration for Mechanical Engineering 339.","upper":true},{"key":"M E 374S","name":"Solar Energy Systems Design","description":"Insolation characteristics and measurement, component design, solar energy system modeling, introduction to photovoltaic systems, cost analysis, and case studies. Three lecture hours a week for one semester. Prerequisite: Mechanical Engineering 339 or the equivalent and admission to an appropriate major sequence in engineering.","upper":true},{"key":"M E 375K","name":"Production Engineering Management","description":"Introduction to production and inventory models; basic factory dynamics; analysis of variability; push-and-pull production control; sequencing and dispatching. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 205 or the equivalent with a grade of at least C-, Mechanical Engineering 335 or the equivalent, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 378C","name":"Electroceramics","description":"Bonding; crystal structures; defects; phase diagrams; glass ceramics; electrical, dielectric, magnetic, and optical ceramics. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 334 (or 311) or the equivalent with a grade of at least C- and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 378K","name":"Mechanical Behavior of Materials","description":"Elastic deformation; viscoelasticity; yielding, plastic flow, plastic instability, strengthening mechanisms; fracture, fatigue, creep; significance of mechanical properties tests. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 334 or the equivalent and 134L with a grade of at least C- in each, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 378P","name":"Properties and Applications of Polymers","description":"Introduction to polymers as structural materials: polymerization, polymer structure, physical and mechanical properties, processing and fabrication. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 334 (or 311) or the equivalent with a grade of at least C-, Mechanical Engineering 326 or 326H or the equivalent with a grade of at least C-, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 378S","name":"Structural Ceramics","description":"Powder processing, powder characterization, forming techniques, densification, and development of microstructure; emphasis on understanding materials, selection, and microstructure-mechanical property relationships. Three lecture hours a week for one semester. Prerequisite: For engineering majors, Mechanical Engineering 334 (or 311) or the equivalent with a grade of at least C-, and admission to an appropriate major sequence in engineering; for others, upper-division standing and written consent of instructor.","upper":true},{"key":"M E 679H","name":"Undergraduate Honors Thesis","description":"Research performed during two consecutive semesters under the supervision of an engineering faculty member; topics are selected jointly by the student and the faculty member with approval by the director of the Engineering Honors Program. The student makes an oral presentation and writes a thesis. Individual instruction for two semesters. Students pursuing both the Bachelor of Arts, Plan II, and a bachelor's degree in engineering may use this course to fulfill the thesis requirement for the Bachelor of Arts, Plan II. Prerequisite: For 679HA, enrollment in the Engineering Honors Program; for 679HB, Mechanical Engineering 679HA and enrollment in the Engineering Honors Program.","upper":true},{"key":"M E 379N","name":"Engineering Acoustics","description":"Same as Electrical Engineering 363N. Principles of acoustics, with applications drawn from audio engineering, biomedical ultrasound, industrial acoustics, noise control, room acoustics, and underwater sound. Three lecture hours a week for one semester. Prerequisite: Mathematics 427K with a grade of at least C-.","upper":true}]