[{"key":"B A 001F","name":"First-Year Interest Group Seminar","description":"Restricted to students in the First-Year Interest Group Program. Basic issues in various McCombs School of Business disciplines. One lecture hour a week for one semester.","upper":false},{"key":"B A 101H","name":"Professional Development and Career Planning: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Professional development issues including self-assessment, identification of personal life goals, identification of business majors and exploration of potential career fields for each major, and analysis and discussion of the academic planning process and how it relates to professional development and career planning. One lecture hour a week for one semester. Only one of the following may be counted: Business Administration 101H, 101S, 101T. Offered on the letter-grade basis only.","upper":false},{"key":"B A 101S","name":"Professional Development and Career Planning","description":"Restricted to freshmen students in the McCombs School of Business. Discussion of issues surrounding career planning, implementation, and evaluation in order to establish career goals. Strategies for executing a successful job search, including interviewing techniques, resumes, networking, and job search ethics. Focus on career management as a lifelong process. One lecture hour a week for one semester. Only one of the following may be counted: Business Administration 101H, 101S, 101T. Offered on the letter-grade basis only.","upper":false},{"key":"B A 101T","name":"Professional Development and Career Planning","description":"Restricted to transfer students in the McCombs School of Business. Discussion of issues surrounding career planning, implementation, and evaluation. One lecture hour a week for one semester. Only one of the following may be counted: Business Administration 101, 101H, 101S, 101T, 102. Offered on the letter-grade basis only.","upper":false},{"key":"B A 320F","name":"Foundations of Entrepreneurship","description":"Restricted to non-business majors. Introduction to the mechanics and strategies for starting a business. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"B A 321L","name":"Contemporary Leadership Issues","description":"Focuses on leadership topics such as ethics, diversity, and sustainability. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"B A 324","name":"Business Communication: Oral and Written","description":"Restricted to students in the McCombs School of Business. Theory and practice of effective communication, using models from business situations. Students practice what they learn with a variety of in-class activities, written assignments, and oral presentations. Teamwork and use of interpersonal skills are included. Three lecture hours a week for one semester. Business Administration 324 and 324H may not both be counted. Prerequisite: English 603A, Rhetoric and Writing 306, 306Q, 309K, or Tutorial Course 603A, and credit or registration for Business Administration 101H, 101S, or 101T.","upper":true},{"key":"B A 324H","name":"Business Communication: Oral and Written: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Theory and practice of effective communication, using models from business situations. Students practice what they learn with a variety of in-class activities, written assignments, and oral presentations. Teamwork and use of interpersonal skills are included. Three lecture hours a week for one semester. Business Administration 324 and 324H may not both be counted. Prerequisite: English 603A, Rhetoric and Writing 306, 306Q, 309K, or Tutorial Course 603A; and Business Administration 101H or 101S, or credit or registration for Business Administration 101T.","upper":true},{"key":"B A 151H","name":"Honors Lyceum in Business Administration","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Presentations by professionals from various fields of business. One lecture hour a week for one semester.  May be repeated for credit. Prerequisite: Business Administration 101H or 101S, or credit or registration for Business Administration 101T.","upper":true},{"key":"B A 352F","name":"Internship in Business Administration","description":"Restricted to non-business majors. Focuses on students' career goals through academic discussion and evaluations, while students are working in professional internships with public and private enterprises. Internship to be arranged by the student and approved by the director of the Business Foundations Program. The equivalent of eight lecture hours a week for one semester.  Offered on the pass/fail basis only. Prerequisite: Completion of at least forty-five semester hours of coursework, Accounting 310F with a grade of at least C, and consent of the director of the Business Foundations Program.","upper":true},{"key":"B A 353","name":"Internship in Business Administration","description":"Restricted to students in the McCombs School of Business. Focuses on career goals through academic discussion and evaluations, while placing students in professional internships with public and private enterprises. The equivalent of three lecture hours a week for one semester; hours to be arranged. Only one of the following may be counted toward the Bachelor of Business Administration: Accounting 353J, Business Administration 353, 353H, Finance 353, Management 353, Management Information Systems 353, Marketing 353, Operations Management 353. May not be counted toward the student's major requirement. May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Completion of forty-five semester hours of college coursework and consent of the departmental internship coordinator.","upper":true},{"key":"B A 353H","name":"Internship in Business Administration-Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Focuses on career goals through academic discussion and evaluations, while placing students in professional internships with public and private enterprises. Three lecture hours a week for one semester. Only one of the following may be counted toward the Bachelor of Business Administration: Accounting 353J, Business Administration 353, 353H, Finance 353, Management 353, Management Information Systems 353, Marketing 353, Operations Management 353. May not be counted toward the student's major requirement. Offered on the pass/fail basis only. Prerequisite: Completion of forty-five semester hours of college coursework and consent of the departmental internship coordinator.","upper":true},{"key":"B A 366F","name":"Business Administration Practicum","description":"Restricted to non-business majors. Students apply skills related to the Business Foundations certificate program curriculum and focus on additional project management skills through group projects conducted in a professional setting. Students may work with a private or a public enterprise. The equivalent of three lecture hours a week for one semester. Prerequisite: Upper-division standing and completion of at least forty-five semester hours of coursework.","upper":true}]