[{"key":"ARE 102","name":"Introduction to Architectural Engineering","description":"Introduction to architectural engineering as a career by use of case studies. One lecture hour a week for one semester. Offered in the fall semester only. Prerequisite: A major in architectural engineering, civil engineering, or architecture, or consent of instructor.","upper":false},{"key":"ARE 217","name":"Computer-Aided Design and Graphics","description":"Introduction to procedures in computer-aided design and computer graphics used in producing plans and three-dimensional electronic models associated with building design and construction. Three hours of lecture and laboratory a week for one semester.","upper":false},{"key":"ARE 320K","name":"Introduction to Design I","description":"Introduction to design principles, concepts, and problem-solving approaches. Issues addressed by a series of two- and three-dimensional studies. Nine laboratory hours a week for one semester. Offered in the fall semester only. Prerequisite: Credit or registration for Architectural Engineering 217.","upper":true},{"key":"ARE 320L","name":"Introduction to Design II","description":"Continuation of Architectural Engineering 320K. Focus on building design. Nine laboratory hours a week for one semester. Offered in the spring semester only. Prerequisite: Architectural Engineering 320K and credit or registration for Architectural Engineering 335.","upper":true},{"key":"ARE 323K","name":"Project Management and Economics","description":"Solving economic problems related to construction and engineering; construction project management techniques; characteristics of construction organizations, equipment, and methods. Three lecture hours a week for one semester. Prerequisite: Mathematics 408D or 408M.","upper":true},{"key":"ARE 325L","name":"Cooperative Engineering","description":"This course covers the work period of architectural engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for three semesters. The student must complete Architectural Engineering 325LX, 325LY, and 325LZ before a grade and degree credit are awarded. May be repeated for credit. Prerequisite: For 325LX, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 325LY, Architectural Engineering 325LX and appointment for a full-time cooperative work tour; for 325LZ, Architectural Engineering 325LY and appointment for a full-time cooperative work tour.","upper":true},{"key":"ARE 225M","name":"Cooperative Engineering","description":"This course covers the work period of architectural engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for two semesters. The student must complete Architectural Engineering 225MA and 225MB before a grade and degree credit are awarded. Prerequisite: For 225MA, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 225MB, Architectural Engineering 225MA and appointment for a full-time cooperative work tour.","upper":true},{"key":"ARE 125N","name":"Cooperative Engineering","description":"This course covers the work period of architectural engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Architectural Engineering 325LZ or 225MB, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour.","upper":true},{"key":"ARE 335","name":"Materials and Methods of Building Construction","description":"Elements and properties of construction materials and components; fabrication and construction technologies, methods, and processes; engineering systems characteristic of commercial buildings such as foundation, structural, and building envelope systems. Three or four lecture and discussion hours a week for one semester. Prerequisite: Architectural Engineering 320K, Civil Engineering 314K, and admission to the major sequence in architectural engineering.","upper":true},{"key":"ARE 345K","name":"Masonry Engineering","description":"Behavior and design of masonry with respect to architectural, economic, and structural criteria. Four and one-half hours a week for one semester, including lecture and laboratory. Prerequisite: Civil Engineering 329 and credit or registration for Civil Engineering 331.","upper":true},{"key":"ARE 346N","name":"Building Environmental Systems","description":"Analysis and design of building air conditioning systems; heating and cooling load calculations, air side systems analysis, air distribution, building electrical requirements, electrical and lighting systems. Three lecture hours a week for one semester. Prerequisite: Physics 303L and 103N, and credit or registration for Mechanical Engineering 320 or 326.","upper":true},{"key":"ARE 346P","name":"HVAC Design","description":"Design and analysis of heating, ventilation, and cooling systems for buildings. Focus on application of fundamental energy and mass transfer principles to HVAC components. Three lecture hours a week for one semester. Prerequisite: Architectural Engineering 346N or consent of instructor.","upper":true},{"key":"ARE 358","name":"Cost Estimating in Building Construction","description":"Building construction estimating from plans and specifications, unit prices, lump sum estimates, job sites, overhead, general overhead, and bidding procedures. Estimating methods throughout the design process. Two lecture hours and three supervised laboratory hours a week for one semester. Prerequisite: Architectural Engineering 335 and admission to the major sequence in architectural engineering. Experience reading construction blueprints is recommended.","upper":true},{"key":"ARE 362L","name":"Structural Design in Wood","description":"Engineering properties of wood; design of glued-laminated and lumber structural members, connections, and simple systems; introduction to shear walls and diaphragms. Five hours of lecture and supervised work a week for one semester. Prerequisite: Civil Engineering 329.","upper":true},{"key":"ARE 465","name":"Integrated Design Project","description":"Design of low-rise buildings, including structural and environmental systems; preparation of contract documents. Six hours a week for one semester, including lecture and laboratory. Prerequisite: Architectural Engineering 217, 320L, 335, and 346N; Civil Engineering 331 or 335, and 357; with approval of the department, Civil Engineering 331, 335, or 357 may be taken concurrently with Architectural Engineering 465.","upper":true},{"key":"ARE 370","name":"Design of Energy Efficient and Healthy Buildings","description":"Design and analysis of sustainable buildings, envelopes and facades, and energy and resource use in energy efficient and healthy buildings. Applies building science principles used to avoid moisture problems, minimize sick-building syndrome symptoms, and reduce energy use. Three lecture hours a week for one semester. Prerequisite: Architectural Engineering 346N.","upper":true},{"key":"ARE 371","name":"Energy Simulation in Building Design","description":"Fundamentals of building energy simulations, analytical models for heat transfer in buildings, general numerical methods for solving equations from the analytical models, use of energy simulation tools in building design analysis, and parametric analyses used to study various operational parameters that affect energy use in buildings. Three lecture hours a week for one semester. Prerequisite: Architectural Engineering 346N or consent of instructor.","upper":true},{"key":"ARE 372","name":"Modeling of Air and Pollutant Flows in Buildings","description":"Fundamentals of indoor airflow modeling; use of computational fluid dynamics (CFD) for air quality and thermal comfort analyses; application of CFD for analysis of air velocity, temperature, humidity, and contaminant distributions with different ventilation systems. Three lecture hours a week for one semester. Prerequisite: Architectural Engineering 346N, Civil Engineering 319F, or consent of instructor.","upper":true},{"key":"ARE 376","name":"Building Information Modeling for Capital Projects","description":"Focuses on the skills and information needed to effectively use an existing Building Information Model for a building construction project. In this project-based course, students gain knowledge on the implementation of BIM concepts throughout the life cycle of a building from planning and design to construction and operations. Three lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Architectural Engineering 323K.","upper":true},{"key":"ARE 679H","name":"Undergraduate Honors Thesis","description":"Research performed during two consecutive semesters under the supervision of an engineering faculty member; topics are selected jointly by the student and the faculty member with approval by the director of the Engineering Honors Program. The student makes an oral presentation and writes a thesis. Individual instruction for two semesters. Students pursuing both the Bachelor of Arts, Plan II, and a bachelor's degree in engineering may use this course to fulfill the thesis requirement for the Bachelor of Arts, Plan II. Prerequisite: For 679HA, enrollment in the Engineering Honors Program; for 679HB, Architectural Engineering 679HA and enrollment in the Engineering Honors Program.","upper":true}]