[{"key":"C E 301","name":"Civil Engineering Systems","description":"Introduction to civil engineering as a career; engineering problem solving; use of computers for text, graphics, and data analysis; introduction to civil engineering measurements; breadth of disciplines within civil engineering; engineering ethics, sustainability. Two lecture hours and three laboratory hours a week for one semester.","upper":false},{"key":"C E 311K","name":"Introduction to Computer Methods","description":"Organization and programming of civil engineering problems for computer solutions. Five hours a week for one semester, including lecture and laboratory. Prerequisite: Credit or registration for Mathematics 408D or 308L.","upper":false},{"key":"C E 311S","name":"Probability and Statistics for Civil Engineers","description":"Basic theory of probability and statistics with practical applications to civil engineering problems, including statistical inference and sampling. Additional subjects may include reliability and risk analyses, estimation and regression analyses, and experimental design. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Mathematics 408D or 408M.","upper":false},{"key":"C E 319F","name":"Elementary Mechanics of Fluids","description":"Fluid properties, hydrostatics, elements of fluid dynamics, energy and momentum, boundary layers, similitude, pipe flow, metering instruments, drag forces. Three lecture hours and two laboratory hours a week for one semester. Civil Engineering 319F and Mechanical Engineering 330 may not both be counted. Prerequisite: Engineering Mechanics 306.","upper":false},{"key":"C E 321","name":"Transportation Systems","description":"Planning, economics, location, construction, operation, maintenance, and design of transportation systems; concepts of various modes of transportation. Three lecture hours a week for one semester. Prerequisite: Civil Engineering 311S.","upper":true},{"key":"C E 324P","name":"Properties and Behavior of Engineering Materials","description":"Structure, properties, and behavior of engineering materials, including concrete and metals. Laboratory exercises illustrate mechanical behavior of typical materials and demonstrate selected principles of mechanics. Six hours of lecture, laboratory, and supervised work a week for one semester. Civil Engineering 314K and 324P may not both be counted. Prerequisite: Chemistry 301 and Engineering Mechanics 319.","upper":true},{"key":"C E 325L","name":"Cooperative Engineering","description":"This course covers the work period of civil engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for three semesters. The student must complete Civil Engineering 325LX, 325LY, and 325LZ before a grade and degree credit are awarded. May be repeated for credit. Prerequisite: For 325LX, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 325LY, Civil Engineering 325LX and appointment for a full-time cooperative work tour; for 325LZ, Civil Engineering 325LY and appointment for a full-time cooperative work tour.","upper":true},{"key":"C E 225M","name":"Cooperative Engineering","description":"This course covers the work period of civil engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for two semesters. The student must complete Civil Engineering 225MA and 225MB before a grade and degree credit are awarded. Prerequisite: For 225MA, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour; for 225MB, Civil Engineering 225MA and appointment for a full-time cooperative work tour.","upper":true},{"key":"C E 125N","name":"Cooperative Engineering","description":"This course covers the work period of civil engineering students in the Cooperative Engineering Program. Forty laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Civil Engineering 325LZ or 225MB, application to become a member of the Cooperative Engineering Program, approval of the dean, and appointment for a full-time cooperative work tour.","upper":true},{"key":"C E 329","name":"Structural Analysis","description":"Classical methods of analysis for determinate and indeterminate structures under stationary and moving loads. Four hours of lecture and supervised work a week for one semester. Prerequisite: Engineering Mechanics 319 and Civil Engineering 311K.","upper":true},{"key":"C E 331","name":"Reinforced Concrete Design","description":"Design of reinforced concrete beams and columns. Five hours of lecture and supervised work a week for one semester. Prerequisite: Civil Engineering 314K and 329.","upper":true},{"key":"C E 333T","name":"Engineering Communication","description":"Technical communication skills for engineers, especially researching and writing technical documents for many kinds of readers, managing and documenting sources of information, using and explaining graphics, delivering oral presentations, working collaboratively, and eliciting information from experts and stakeholders. Two lecture hours and one and one half laboratory hours a week for one semester. Civil Engineering 333H and 333T may not both be counted. Prerequisite: Rhetoric and Writing 306 and admission to an appropriate major sequence in architectural or civil engineering.","upper":true},{"key":"C E 335","name":"Elements of Steel Design","description":"Analysis and design of tension members, beams, columns, and bolted and welded connections. Five hours of lecture and supervised work a week for one semester. Prerequisite: Civil Engineering 314K and 329.","upper":true},{"key":"C E 341","name":"Introduction to Environmental Engineering","description":"Quantitative evaluation of the environmental, economic, and technical problems involved in control of pollutants of the air, water, and land. Three lecture hours a week for one semester. Prerequisite: Chemistry 301 and 302, or consent of instructor.","upper":true},{"key":"C E 342","name":"Water and Wastewater Treatment Engineering","description":"Application of chemical, biological, and physical principles to the analysis and design of treatment processes for drinking water, industrial process water, municipal wastewater, and water reuse applications. Three lecture hours a week for one semester. Prerequisite: Credit or registration for Civil Engineering 319F and credit for Civil Engineering 341, or consent of instructor.","upper":true},{"key":"C E 346","name":"Solid Waste Engineering and Management","description":"Characteristics of municipal and industrial solid wastes, generation rates, collection systems, recycling, processing, and disposal. Three lecture hours a week for one semester, with occasional field trips. Prerequisite: Civil Engineering 341 or consent of instructor.","upper":true},{"key":"C E 351","name":"Concrete Materials","description":"Portland cement, aggregates, supplementary cementing materials, properties of fresh and hardened concrete, concrete durability, mixture proportioning, concrete construction, special concretes. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Civil Engineering 314K.","upper":true},{"key":"C E 356","name":"Elements of Hydraulic Engineering","description":"Flow in closed conduits, hydraulic machinery; open-channel flow; flow measurement; design of storm sewers. Five hours a week for one semester, including lecture and laboratory. Prerequisite: Civil Engineering 319F.","upper":true},{"key":"C E 357","name":"Geotechnical Engineering","description":"Engineering properties of soils; hydraulic conductivity and shear strength of soils; soil compaction and consolidation; stresses with the soil mass; settlement of foundations of structures; laboratory measurements. Six hours a week for one semester, including lecture and laboratory. Prerequisite: Civil Engineering 319F and Engineering Mechanics 319.","upper":true},{"key":"C E 358","name":"Introductory Ocean Engineering","description":"Wave theory and its applications to coastal engineering and offshore structure technology. Includes fundamentals of inviscid and viscous flow of incompressible fluids, and applications of computational fluid dynamics (CFD) in design. Three lecture hours a week for one semester. Prerequisite: Civil Engineering 319F or consent of instructor.","upper":true},{"key":"C E 360K","name":"Foundation Engineering","description":"Effect of geotechnical conditions on the behavior, proportioning, and choice of foundation type; design of shallow and deep foundations; study of foundation case histories. Five hours a week for one semester, including lecture and discussion. Offered in the fall semester only. Prerequisite: Civil Engineering 357.","upper":true},{"key":"C E 362M","name":"Advanced Reinforced Concrete Design","description":"Design of reinforced concrete buildings, including floor systems and structural walls. Five hours of lecture and supervised work a week for one semester. Prerequisite: Civil Engineering 331.","upper":true},{"key":"C E 362N","name":"Advanced Steel Design","description":"Design of steel buildings, beam columns, composite beams, plate girders, and connections. Five hours of lecture and supervised work a week for one semester. Prerequisite: Civil Engineering 335.","upper":true},{"key":"C E 363","name":"Advanced Structural Analysis","description":"Structural analysis for forces and deflections using stiffness and flexibility approaches; application of energy methods in structural analysis; stiffness methods for computer-based structural analysis. Three lecture hours a week for one semester. Prerequisite: Civil Engineering 329.","upper":true},{"key":"C E 364","name":"Design of Wastewater and Water Treatment Facilities","description":"Analysis, synthesis, and integrated design of municipal wastewater treatment plants and water treatment systems. Three lecture hours a week for one semester; additional hours to be arranged for design laboratory and field trips. Prerequisite: Credit or registration for Civil Engineering 342 and credit for Civil Engineering 356, or consent of instructor.","upper":true},{"key":"C E 365K","name":"Hydraulic Engineering Design","description":"Application of engineering hydraulics to stormwater management; storm sewer design; engineering hydrology; open-channel hydraulics; hydraulic structures; culverts and bridges; stormwater detention facilities. Three lecture hours a week for one semester. Prerequisite: Civil Engineering 356.","upper":true},{"key":"C E 366K","name":"Design of Bituminous Mixtures","description":"Fundamental properties of asphalt and aggregates; design and construction of asphalt mixtures; special mixtures; superpave design method. Three lecture hours a week for one semester. Prerequisite: Upper-division standing or consent of instructor.","upper":true},{"key":"C E 367G","name":"Design and Evaluation of Ground-Based Transportation Systems","description":"Methods for design and evaluation of transportation systems, emphasizing roadway and non-motorized travel, in light of traveler safety, system operations, construction and maintenance costs, environmental impacts, and other considerations. Three lecture hours and two laboratory hours a week for one semester. Civil Engineering 367G and 377K (Topic: Design of Ground-Based Transportation) may not both be counted. Prerequisite: Civil Engineering 321 or consent of instructor.","upper":true},{"key":"C E 367P","name":"Pavement Design and Performance","description":"Basic principles of design of pavements for highways, airfields, and railroads; pavement construction, maintenance, and rehabilitation. Three lecture hours a week for one semester. Prerequisite: Civil Engineering 321, 357, and 366K.","upper":true},{"key":"C E 367T","name":"Traffic Engineering","description":"Driver and vehicle characteristics, traffic studies, traffic laws and ordinances, intersection capacity, signs, markings, signals, bus transit, parking, design of street systems, and operational controls. Three lecture hours a week for one semester. Prerequisite: Civil Engineering 321 or consent of instructor.","upper":true},{"key":"C E 369L","name":"Air Pollution Engineering","description":"Characterization of sources, emissions, transport, transformation, effects, and control of air pollutants. Three lecture hours a week for one semester. Prerequisite: Civil Engineering 341 or consent of instructor.","upper":true},{"key":"C E 369R","name":"Indoor Air Quality","description":"Sources, properties, transport and fate, human exposure, and adverse responses to indoor air pollutants. Control strategies and engineered technologies to mitigate impacts of gaseous and particle phase air pollutants in indoor environments. Three lecture hours a week for one semester. Civil Engineering 369R and 377K (Topic: Indoor Air Quality) may not both be counted. Prerequisite: Civil Engineering 319F and admission to an appropriate major sequence in architectural or civil engineering, or consent of instructor.","upper":true},{"key":"C E 370K","name":"Environmental Sampling and Analysis","description":"Principles of environmental chemistry; measurement of contaminants in air, water, and land environments; applications to municipal, industrial, and ambient samples. Six hours a week for one semester, including lecture and laboratory. Prerequisite: Upper-division standing in engineering and Civil Engineering 341, or consent of instructor.","upper":true},{"key":"C E 171P","name":"Engineering Professionalism","description":"Examines professional engineering licensure, ethics, leadership, public service, and public policy, with an emphasis on multidisciplinary perspectives, legal and business considerations, and the importance of lifelong learning. Includes participation in a public service project. Two lecture hours a week for one semester, with additional fieldwork hours to be arranged. Prerequisite: Admission to the major sequence in civil engineering and credit or registration for one of the following: Civil Engineering 360K, 362M, 362N, 364, 365K, 367, 376.","upper":true},{"key":"C E 374K","name":"Hydrology","description":"Phases of the hydrologic cycle, unit hydrograph, flow routing, hydrologic statistics, design storms and flows, design of storm sewers, detention ponds and water supply reservoirs. Three lecture hours a week for one semester. Prerequisite: Civil Engineering 311S and 356.","upper":true},{"key":"C E 374L","name":"Groundwater Hydraulics","description":"Darcy's law, steady flow in aquifers, aquifer and well testing, regional flow, numerical simulation of groundwater flow, unsaturated flow, and groundwater recharge. Three lecture hours a week for one semester. Prerequisite: Civil Engineering 356 or consent of instructor.","upper":true},{"key":"C E 375","name":"Earth Slopes and Retaining Structures","description":"Earth fills, excavations, and dams; soil compaction and ground improvement, seepage and dewatering; stability of natural slopes and embankments; earth-pressure theories; design of earth retaining structures. Three lecture hours a week for one semester. Offered in the spring semester only. Prerequisite: Civil Engineering 357.","upper":true},{"key":"C E 679H","name":"Undergraduate Honors Thesis","description":"Research performed during two consecutive semesters under the supervision of an engineering faculty member; topics are selected jointly by the student and the faculty member with approval by the director of the Engineering Honors Program. The student makes an oral presentation and writes a thesis. Individual instruction for two semesters. Students pursuing both the Bachelor of Arts, Plan II, and a bachelor's degree in engineering may use this course to fulfill the thesis requirement for the Bachelor of Arts, Plan II. Prerequisite: For 679HA, enrollment in the Engineering Honors Program; for 679HB, Civil Engineering 679HA and enrollment in the Engineering Honors Program.","upper":true}]