[{"key":"ADV 303","name":"Advertising and Popular Culture","description":"An introduction to the role advertising plays in American society, and the values and relationships offered in the messages that are delivered. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Advertising degree or the Bachelor of Science in Public Relations degree.","upper":false},{"key":"ADV 304","name":"Advertising on the Internet","description":"The defining concepts, differences, and current practices of advertising on the Internet. Three lecture hours a week for one semester, with additional laboratory hours to be arranged. May not be counted toward the Bachelor of Science in Advertising degree or the Bachelor of Science in Public Relations degree.","upper":false},{"key":"ADV 305","name":"Fundamentals of Advertising","description":"Fundamentals and practices of advertising in relation to economies, societies, and mass communication. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Advertising or Bachelor of Science in Public Relations degrees.","upper":false},{"key":"ADV 305S","name":"Introduction to Integrated Communication for Sports","description":"Same as Public Relations 305S. Examination of the mass media industry in relation to the field of sports. Focus on the \"off-the-field\" industries of advertising, marketing, and public relations that impact sports; rights fees contracts; pre-game shows; gameday production; in-stadium activities; and press coverage. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising 305S, 378 (Topic 7: Integrated Communication for Sports), Kinesiology 352K (Topic: Integrated Communication for Sports), Public Relations 305S.","upper":false},{"key":"ADV 309R","name":"Introduction to Advertising and Public Relations Research","description":"Same as Public Relations 309. Restricted to advertising and public relations majors. Introduction to concepts and methods of statistics, with emphasis on analyzing personal and group behaviors. Includes exploratory data analysis, correlation and regression, descriptive statistics, sampling distributions, confidence intervals, and hypothesis testing. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising 309R, 378 (Topic: Introduction to Advertising and Public Relations Research), Public Relations 309, 378 (Topic: Topic: Introduction to Advertising and Public Relations Research).","upper":false},{"key":"ADV 314","name":"Social and Ethical Issues","description":"Designed to prepare students to identify, analyze, and respond to social and ethical issues in advertising and public relations. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Advertising or the Bachelor of Science in Public Relations degrees.","upper":false},{"key":"ADV 315","name":"History and Development of Advertising","description":"The evolution and development of advertising in the United States in a social, historical, economic, and cultural context. Three lecture hours a week for one semester.","upper":false},{"key":"ADV 316","name":"Creativity and American Culture","description":"Same as Public Relations 316. A cross-disciplinary view of the creative process and creative products. The conceptual core of film, fine arts, advertising, architecture, and literature. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Advertising or the Bachelor of Science in Public Relations. Fulfills the communication and culture requirement in the College of Communication.","upper":false},{"key":"ADV 318J","name":"Introduction to Advertising and Integrated Brand Communication","description":"The functions of advertising; role in marketing/communications mix; economic and social influence; advertising institutions and media; campaigns and appropriations; retail and business-to-business aspects. Three lecture hours and one discussion hour a week for one semester. Students may not enroll in Advertising 318J more than twice.","upper":false},{"key":"ADV 319","name":"Psychology of Advertising","description":"A review of basic findings of the behavioral sciences dealing with perception, personality, group behavior, psychological appeals, and their application to advertising as persuasive communication. Three lecture hours a week for one semester.","upper":false},{"key":"ADV 325","name":"Introduction to Advertising Creativity","description":"Restricted to advertising and public relations majors. Development of concepts and problem-solving techniques for print and broadcast advertising design and copywriting. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Advertising 318J with a grade of at least B.","upper":true},{"key":"ADV 334","name":"International Advertising","description":"Major issues in international advertising and advertising directed at cultural minorities within countries. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ADV 336","name":"Multicultural Issues in Advertising and Public Relations","description":"Special topics exploring the impact of the major social, economic, and cultural aspects of advertising and public relations on ethnic and cultural groups in the United States. The equivalent of three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"ADV 341S","name":"Research in Sports Communication and Media","description":"Same as Public Relations 341S. An introduction to advertising and public relations research and methodology for sports. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and a University grade point average of at least 2.25.","upper":true},{"key":"ADV 342","name":"Advertising Copywriting","description":"Copywriting for print and broadcast media. Methods for developing creative advertising concepts, strategies, and executions for print, radio, and television. Emphasis on writing rather than on art direction. Three lecture hours a week for one semester. Prerequisite: Advertising 325 with a grade of at least C, and instructor's approval of the student's previous work in advertising courses.","upper":true},{"key":"ADV 343K","name":"Portfolio I","description":"Basic advertising art direction and copywriting skills, including indications for graphics, headlines, and body copy. Three lecture hours and three studio hours a week for one semester. Prerequisite: Advertising 325 with a grade of at least B, and admission to the Texas Creative program.","upper":true},{"key":"ADV 344K","name":"Advertising Research","description":"Introduction to social science research methods as used in advertising and marketing; emphasis on survey research and secondary data. Three lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing; Advertising 318J with a grade of at least B; and Advertising 309R, Public Relations 309, Statistics 309, or Statistics and Scientific Computation 306 with a grade of at least C. Advertising majors must also have credit or registration for Advertising 325.","upper":true},{"key":"ADV 345J","name":"Advertising Media Planning Foundations","description":"Media characteristics and media-market measurements; development of media plans. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Upper-division standing; Advertising 318J with a grade of at least B; and Advertising 309R, Public Relations 309, Statistics 309, or Statistics and Scientific Computation 306 with a grade of at least C. Advertising majors must also have credit or registration for Advertising 325.","upper":true},{"key":"ADV 447","name":"Computer Imaging Topics","description":"Introduction to computer graphics with applications to advertising and other disciplines. Students interact with computer systems to produce artwork and design portfolios. Three lecture hours and three laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Advertising 318J with a grade of at least B and consent of instructor received prior to registering.","upper":true},{"key":"ADV 348","name":"Design of Integrated Communications","description":"Theory and practice of the graphic arts and production, including conception and design; typography; engraving; preparation of copy, art, and photographs; paper; color psychology; and printing. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ADV 348S","name":"The Business of Sports Media","description":"Same as Journalism 348G and Public Relations 348S. Examination of the business of sports-related media, including over-the-air television, cable, satellite television, print, radio, social media, and internet-based media, and the impact of such media on sports presentation and development, professional franchises, colleges, and conferences. Emphasis on how the business of sports media generates revenue and content, and the business models for each type of media, the challenges to such models, and the likely future changes to them. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising 348S, 378 (Topic: The Business of Sports Media), Communication 325 (Topic: The Business of Sports Media), Journalism 348G, 349T (Topic: The Business of Sports Media), Public Relations 348S, 378 (Topic: The Business of Sports Media). Prerequisite: Upper-division standing and a University grade point average of at least 2.25; additional prerequisite for journalism majors: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"ADV 350","name":"Advertising Internship","description":"Practical work experiences in advertising sales, creative management, and research with advertisers, agencies, media, or auxiliary services. An average of twelve hours of work a week, for a total of 180 hours a semester or summer session.  Offered on the pass/fail basis only. Prerequisite: Advertising 344K and 345J with a grade of at least C in each.","upper":true},{"key":"ADV 350S","name":"Internship in Sports Media","description":"Same as Public Relations 350S. Restricted to Texas Program in Sports and Media students. Practical work experience in sports media. Internship to be arranged by student and approved by instructor. The equivalent of three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Advertising or the Bachelor of Science in Public Relations degrees. Offered on the pass/fail basis only. Prerequisite: Upper-division standing; a University grade point average of at least 2.25; Advertising 305S or Public Relations 305S; and three additional hours from the Sports Media Certificate approved coursework list.","upper":true},{"key":"ADV 151","name":"Advertising Practicum","description":"Internship and discussion hours to be arranged.  Offered on the pass/fail basis only. Prerequisite: Advertising 350 or 468K, consent of departmental internship coordinator, and completion of department requirements for enrollment in an internship course.","upper":true},{"key":"ADV 353","name":"Advertising and Public Relations Law and Ethics","description":"Same as Public Relations 353.  The equivalent of three lecture hours a week for one semester. Only one of the following may be counted: Advertising 353, 371J, 376, Public Relations 353, 371J, 376. Fulfills the communication and culture requirement in the College of Communication. Prerequisite: For advertising majors, Advertising 318J with a grade of at least B; for public relations majors, Public Relations 319; for others, none.","upper":true},{"key":"ADV 366","name":"Special Topics in Advertising","description":"Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Advertising degree. May be repeated for credit when the topics vary.","upper":true},{"key":"ADV 368C","name":"Advertising Senior Seminar","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Credit or registration for Advertising 344K and 345J, and written consent of instructor received prior to registering.","upper":true},{"key":"ADV 468K","name":"Portfolio II","description":"Intermediate advertising art direction and copywriting; special emphasis on execution skills and concepts. Three lecture hours and three studio hours a week for one semester. Prerequisite: Advertising 343K and consent of the Texas Creative program faculty.","upper":true},{"key":"ADV 468L","name":"Portfolio III","description":"Advanced advertising art direction and advertising creative concepts. Three lecture hours and three studio hours a week for one semester. With consent of instructor, may be repeated once for credit. Prerequisite: Advertising 468K and consent of the Texas Creative program faculty.","upper":true},{"key":"ADV 370J","name":"Integrated Communications Management","description":"Cases and problems dealing with the management of advertising and promotional programs; media and creative strategies; consumer, retail, industrial, and public service applications. Three lecture hours a week for one semester. Advertising 370J and Public Relations 367 may not both be counted. Prerequisite: Advertising 344K and 345J with a grade of at least C in each; and Marketing 320F or 337 with a grade of at least C.","upper":true},{"key":"ADV 373","name":"Integrated Communications Campaigns","description":"Concept of media mix; matching product, consumer, media profiles; conception, research, planning, and execution of advertising campaigns; special emphasis on advanced copywriting, layout, and production for print and broadcast media. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising 373, 373H, Public Relations 377H, 377K. Prerequisite: Advertising 370J.","upper":true},{"key":"ADV 373H","name":"Integrated Communications Campaigns: Honors","description":"Restricted to students in the Advertising or Public Relations Honors program. The concept of media mix; matching product, consumer, and media profiles; and the conception, research, planning, and execution of advertising campaigns. Special emphasis on advanced copywriting, layout, and production for print and broadcast media. Students usually participate in major national contests involving brand development in advertising strategies. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising 373, 373H, Public Relations 377H, 377K. Offered on the letter-grade basis only. Prerequisite: Upper-division standing, Advertising 370J or Public Relations 367, a University grade point average of at least 3.50, admission to the departmental honors program, and consent of the undergraduate adviser.","upper":true},{"key":"ADV 475","name":"Portfolio IV","description":"Designed to enhance the intellectual and philosophical framework of students in the Texas Creative program. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Advertising 468L and consent of the Texas Creative program faculty.","upper":true},{"key":"ADV 377","name":"Advertising Media Topics","description":"Three lecture hours a week for one semester or as required by the topic.  May be repeated for credit when the topics vary. Prerequisite: Admission to the Texas Media program and consent of instructor. Additional prerequisites vary with the topic and are given in the Course Schedule.","upper":true},{"key":"ADV 377M","name":"Media Studies","description":"Topics in media and its effects on advertising and public relations strategies. The equivalent of three lecture hours a week for one semester; additional hours may be required for some topics. Advertising 377M and Public Relations 377M may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Advertising 345J with a grade of at least C, and consent of instructor.","upper":true},{"key":"ADV 378","name":"Advanced Studies in Advertising","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, and a University grade point average of at least 2.25; additional prerequisites vary with the topic.","upper":true},{"key":"ADV 378S","name":"Special Topics in Sports Media","description":"Topics in sports media related to issues in traditional and new media as they effect sports and entertainment advertising and public relations. The equivalent of three lecture hours a week for one semester, or as required by the topic. Advertising 378S and Public Relations 378S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and a University grade point average of at least 2.25; additional prerequisites vary with the topic.","upper":true},{"key":"ADV 379","name":"Integrated Communication for Sports and Entertainment","description":"Three lecture hours a week for one semester.","upper":true},{"key":"ADV 379H","name":"Honors Tutorial Course","description":"Conference course of intensive study, planned by the Advertising Honors Committee; research and the writing of a substantial paper on a special advertising topic. Supervised individual special studies. Prerequisite: Admission to the departmental honors program and consent of the undergraduate adviser.","upper":true}]