[{"key":"CMS 301","name":"Topics in Communication Studies","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"CMS 306M (TCCN: SPCH 1321)","name":"Professional Communication Skills","description":"Designed to help students develop skills in one-on-one interactions, small group communication, and presentation skills. Basic communication theories as they relate to skill development are explored. Three lecture hours a week for one semester.","upper":false},{"key":"CMS 210","name":"Forensics Workshop","description":"Open to all University students. Training for participation in extracurricular speech activities, including intercollegiate debate. Two lecture hours and eight laboratory hours a week for one semester. Communication Studies 210 may be taken three times for credit.","upper":false},{"key":"CMS 310K (TCCN: SPCH 2333)","name":"Team-Based Communication","description":"Analysis of small-group communication: cohesiveness, social climate, role structure, leadership, conformity, dynamics of interaction; participation in small-group communication situations. Three lecture hours a week for one semester.","upper":false},{"key":"CMS 313M","name":"Organizational Communication","description":"Communication processes within government, private, and volunteer organizations. Three lecture hours a week for one semester.","upper":false},{"key":"CMS 315M (TCCN: SPCH 1318)","name":"Interpersonal Communication Theory","description":"Introduction to the study of communication in relationships; topics include self-disclosure, conflict, long-distance relationships, stereotyping, and persuasion. Three lecture hours a week for one semester.","upper":false},{"key":"CMS 316L (TCCN: SPCH 2316)","name":"Interviewing Principles and Practices","description":"Introduction to interviewing theory, emphasizing the acquisition and application of interviewing skills. Three lecture hours a week for one semester.","upper":false},{"key":"CMS 317C","name":"Speechmaking and Society","description":"The impact of public discourse on the ideas and issues of culture and history in the United States. Three lecture hours a week for one semester.","upper":false},{"key":"CMS 320","name":"Advanced Presentation Skills","description":"Designed to help students develop skills in delivering informative and persuasive presentations and speeches. Study of major theories related to oral presentations. Focus on audience analysis and adaptation, building strong arguments, speech organization, and use of new technologies. Three lecture hours a week for one semester. Only one of the following may be counted: Communication Studies 312C, 317M, 320, 367 (Topic: Advanced Presentation Skills). Prerequisite: Upper-division standing and Communication Studies 306M with a grade of at least C.","upper":true},{"key":"CMS 321D","name":"Communicating for Development and Philanthropy","description":"An exploration of the special communicative dimensions of the development and philanthropy fields, including how to apply theories of building relationships and persuasion to the context of development and philanthropy for nonprofit organizations. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 322E","name":"Communication Ethics","description":"Examination of the ethical issues involved in communication. Subjects addressed include our role in interactions we are party to; media coverage of issues of a sensitive or potentially harmful nature; and how our interactions with others reflect and shape who we are. Three lecture hours a week for one semester. Communication Studies 322E and 367 (Topic 4: Communication Ethics) may not both counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 323R","name":"Rhetoric: East and West","description":"Examination of the ways people from different cultures communicate and argue, and how cultures use logic, stories, myth, images, and the spoken word to make their points. Three lecture hours a week for one semester. Communication Studies 323R and 367 (Topic: Rhetoric East and West) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 330","name":"Interpersonal Health Communication","description":"The fundamental interpersonal communication processes that are involved in managing physical and mental health. Includes stigma and illness identity, social support, patient-provider communication, end-of-life care, and health education. Three lecture hours a week for one semester. Communication Studies 330 and 367 (Topic: Interpersonal Health Communication) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 331K","name":"Speech Writing and Criticism","description":"Composition and analysis of oral messages; emphasis on creating and arranging ideas, style, delivery, critical method. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; and Communication Studies 306M or the equivalent, or consent of instructor.","upper":true},{"key":"CMS 332","name":"Argumentation and Advocacy","description":"Nature of argumentative controversy; variables of form, method, and ethics; analysis of argumentative rhetorical works. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 332K","name":"Theories of Persuasion","description":"A study of motivational factors involved in persuasive speaking to secure belief and action. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 333","name":"Case Studies in Argumentation","description":"Study of argumentation theories. Includes analysis of case studies taken from areas of law, public policy, popular culture, and history. Three lecture hours a week for one semester. Communication Studies 333 and 367 (Topic: Case Studies in Argumentation) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 334K","name":"Nonverbal Communication","description":"Survey of the effects of space, physical appearance, movement, eye behavior, and vocal behavior on interpersonal communication. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 335","name":"Strategic Sales and Event Planning","description":"Theory and practice related to the preparation of large-scale sales events and conferences. Designed to develop communication skills and planning techniques. May include client research, investigation of potential venues, telephone-based information interviews, individual or group sales presentations, and event overviews. Three lecture hours a week for one semester. Communication Studies 335 and 367 (Topic: Strategic Sales and Event Planning) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 336D","name":"Career Dynamics and Corporate Communication","description":"An exploration of work and career from an interdisciplinary perspective, employing a variety of definitions, cases, theories, strategies, and popular culture materials to address issues of employability, entrepreneurship, advancement, and objective/external and subjective/psychological success and their relationships with organizational life. Topics may include effects of technologies on work and careers, professionalism and professional identity, networks, teamwork, work-life balance, managing one's boss, and criteria for success. Three lecture hours a week for one semester. Communication Studies 336D and 367 (Topic: Career Dynamics and Corporate Communication) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 337","name":"Building Sales Relationships","description":"Explores the theoretical and practical role of communication in the development of long-term client relationships. Explores the consultative sales process, including prospecting, assessing needs, handling objections, presenting, closing, and following up with clients. Focuses on how technology can help or hinder communication. Three lecture hours a week for one semester. Communication Studies 337 and 367 (Topic: Communication to Build Sales Relationships) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 338","name":"Leadership Stories","description":"Uses fictional and nonfictional stories, as well as examples taken from virtual reality, to explore the meaning of leadership. Designed to help students develop a conceptual, practical, and personal understanding of the meaning of leadership. Three lecture hours a week for one semester. Communication Studies 338 and 367 (Topic: Stories of Leadership) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 339L","name":"Social Interaction in Virtual Environments","description":"Examines fundamental principles connected to the uses and effects of new technologies. Covers social networking sites, online dating, virtual group collaboration, and video games. Three lecture hours a week for one semester. Communication Studies 339L and Communication Studies 367 (Topic: Social Interaction in Virtual Environments) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 340K","name":"Communication and Social Change","description":"Analysis of how persuasion is used in mass movements: civil rights, consumerism, feminism, pacifism, religious sects. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 341","name":"Computer-Mediated Communication","description":"Uses principles related to communication and social psychology to explore online interactions. May include the study of impression formation and management, group communication, trust and deception, Internet dating, online video gaming, social support, Internet addiction, and impacts of new communication technology. Three lecture hours a week for one semester. Communication Studies 341 and 367 (Topic: Computer-Mediated Communication) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 342C","name":"Communication and Civic Participation","description":"An exploration of the status of American democracy, particularly as it pertains to those born between 1960 and 1990. Subjects include the meaning of citizenship and democratic participation, and the strengths and limitations of marketing efforts targeted at getting youth involved in the democratic system. Three lecture hours a week for one semester. Communication Studies 342C and 367 (Topic: Communication and Civic Participation) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 342K","name":"Political Communication","description":"A study of the role of symbols in political communication and the techniques and strategies employed by politicians; special attention is given to recent election campaigns. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 344K","name":"Lying and Deception","description":"Examines lying and deception as civil, strategic, and manipulative behavior. Secrets, privacy, disclosures, and confidentiality are examined in a variety of familiar contexts. Three lecture hours a week for one semester. Communication Studies 344K and 367 (Topic: Lying and Deception) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 345","name":"Media Effects and Politics","description":"The theoretical models and research methods used to study media effects. Emphasis on the political implications of media-effects research and on how media-effects theories can help clarify political issues. May include television violence, the political impact of the news, and the use of media for educational purposes. Three lecture hours a week for one semester. Communication Studies 345 and 367 (Topic: Media Effects and Politics) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 345K","name":"Perspectives on Rhetoric","description":"Four different meanings of rhetoric; how these meanings contribute to the current understanding of communication studies. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 345P","name":"Communication and Public Opinion","description":"An investigation of the definition and measurement of public opinion. Explores the  relationship between communication and public opinion, how changes to public opinion are affected, and the influence of perception of public opinion on personal opinion. Communication Studies 345P and 367 (Topic: Communication and Public Opinion) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 346","name":"Using Communication Technology at Work","description":"Examines how communication technologies affect workplace communication. Considers case studies involving the use of social networking, handheld devices, and e-mail by for-profit and nonprofit organizations. Three lecture hours a week for one semester. Communication Studies 346 and 367 (Topic: Using Communication Technology at Work) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 347K","name":"Rhetoric of Popular Culture","description":"The ways that film, television, music, fashion, the Internet, and other discourses of popular culture influence public attitudes, perceptions, and social relations. Three lecture hours a week for one semester. Communication Studies 347K and 367 (Topic: Rhetoric of Popular Culture) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 348","name":"Communication Research Methods","description":"A practical introduction to research methods, focusing on designing a study, conducting research, analyzing data, and presenting results. Studies survey design, interviews, focus groups, and experiments. Three lecture hours a week for one semester. Communication Studies 348 and 367 (Topic: Communication Research Methods) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 348K","name":"Visual Media and Interaction","description":"The role of visual resources and symbols in social interaction and public life; the representation of interaction and human relationships in visual media (photography, advertising, fine arts, and film). Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 349M","name":"Advanced Analysis of Popular Culture","description":"Advanced critique and analysis of rhetorical dimensions in texts of popular culture. Readings in theory and methods for understanding persuasive influence in television, film, music videos, and the Internet. Web-based instruction; no class meetings. Prerequisite: Upper-division standing, and Advertising 303, Communication Studies 347K, or Radio-Television-Film 305.","upper":true},{"key":"CMS 350M","name":"Field Study in Organizational Communication","description":"Students acquire information through interviews and observation, devise appropriate coding schemes, and compose synoptic reports of their findings and recommendations. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 351","name":"Communication for Cooperation and Competition","description":"Theoretical perspectives and experiential learning on the ways people reconcile the need to be individualistic (competitive) with the need to be community members (cooperative). Individual aggression and submission; the rewards of competition and cooperation; and organizational structures that lead to cooperation and competition. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 353S","name":"Social Media and Organizations","description":"Explores the relationship between social media use and organizational communication. Subjects include how organizations use social media for communication with external stakeholders and to facilitate internal communications processes. Three lecture hours a week for one semester. Communication Studies 353S and 367 (Topic: Social Media and Organizations) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 354","name":"Conflict Resolution","description":"Systematic analysis of conflict and communication to examine some of the effects of communication on conflict and of conflict on communication. Readings, analysis of conflicts, and practice with and evaluation of communication behaviors thought to be effective in conflict talk. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 355K","name":"Intercultural Communication","description":"Theories of speech and language that concern interaction between persons from different cultures who speak different languages or dialects. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 357","name":"Family Communication","description":"Some of the common issues that face those who live in, counsel, and conduct research with families. The development of traditional families in the United States, different family structures that make up modern society, current issues that affect families, and the impact of communication on family experiences. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 358","name":"Communication and Personal Relationships","description":"The nature of human interaction in various types of relationships (friends, dates, spouses, roommates), the nature of communication at different stages in a relationship, and the nature of communication at different life stages. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 359H","name":"Honors Tutorial Course: Reading","description":"Intensive reading and research as planned by the departmental honors committee. Individual instruction. Prerequisite: Upper-division standing and admission to the Communication Studies Honors Program.","upper":true},{"key":"CMS 360","name":"Analyzing Social Interaction","description":"Introduction to concepts and research methods related to the study of how verbal and nonverbal communication is used in everyday situations. Includes collecting and analyzing sound and video data. Designed to help students develop skills in interpreting human social interactions. Three lecture hours a week for one semester. Communication Studies 360 and 367 (Topic: Language and the Body in Social Interaction) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 364K","name":"Gender and Communication","description":"Focuses on how communication influences ideas about sex, gender, and identity, from interpersonal relationships to the mass media, and from legislative debates to social movements. Three lecture hours a week for one semester. Communication Studies 364K and 367 (Topic: Gender and Communication) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 365K","name":"Male-Female Communication","description":"Same as Women's and Gender Studies 345 (Topic 21: Male-Female Communication). Studies of speech patterns related to the concepts of male and female, including sexism in speaking, patterns of male and female speaking, patterns of listening to males and females, speech in courtship and family, speech and sexual discrimination in careers. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 366C","name":"Celebrity Culture","description":"Examines the importance of fame and celebrity throughout the nineteenth, twentieth, and twenty-first centuries, in relation to education, entertainment, and politics. Three lecture hours a week for one semester. Communication Studies 366C and 367 (Topic: Celebrity Culture) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 366F","name":"Rhetoric of Film","description":"Film theory and history taught from a rhetorical perspective. Covers the film industry, technology, and the elements of narrative, image, and sound. Emphasis on theory about film and film criticism. Three lecture hours a week for one semester. Communication Studies 366F and 367 (Topic: Rhetoric of Film) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 366M","name":"Rhetoric and Popular Music","description":"Explores music and its relation to identity; how gender, race, and sexual identity are constructed with and within musical texts; meanings and importance of authenticity; and the effectiveness of music as a political tool. Three lecture hours a week for one semester. Communication Studies 366M and 367 (Topic: Rhetoric and Popular Music) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 366R","name":"Rhetoric and Religion","description":"Explores secular and religious instances of ambivalence, and its uses and effects. Three lecture hours a week for one semester. Communication Studies 366R and 367 (Topic: Rhetoric and Religion) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 367","name":"Topics in Communication Studies","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing. Additional prerequisites may vary with the topic and are given in the Course Schedule.","upper":true},{"key":"CMS 369V","name":"Political Research","description":"Students conduct research with Project Vote Smart, a nonpartisan, nonprofit political research organization.  Offered on the pass/fail basis only. Prerequisite: Students must apply by sending a cover letter and resume to projectvotesmart@austin.utexas.edu.","upper":true},{"key":"CMS 370K","name":"Internship in Communication Studies","description":"Restricted to senior communication studies majors. Focuses on career goals of students through classroom discussions and places students in communication positions with public and private organizations. The equivalent of three lecture hours a week for one semester.  Offered on the pass/fail basis only. Prerequisite: Twelve semester hours of communication studies (or speech), including at least three hours of upper-division coursework; a University grade point average of at least 2.50; a grade point average in communication studies of at least 3.00; and consent of instructor.","upper":true},{"key":"CMS 371K","name":"Practicum in Conflict Mediation","description":"Two lecture hours and three discussion hours a week for one semester. Students must also attend one weekend workshop at the beginning of the semester.   With consent of instructor, may be repeated once for credit. Offered on the pass/fail basis only.","upper":true},{"key":"CMS 171M","name":"Communication Studies Internship","description":"Internship and discussion hours to be arranged.  Offered on the pass/fail basis only. Prerequisite: Communication Studies 370K; consent of departmental internship coordinator; and completion of departmental requirements for enrollment in an internship course.","upper":true},{"key":"CMS 372K","name":"Advanced Organizational Communication","description":"In-depth discussion and treatment of advanced organizational communication topics, including socialization and role development, workplace attachments, organizational culture, ethics, structure, conflict, power, decision making and empowerment, technology, and various forms of external communication with relevant organizational stakeholders. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and Communication Studies 313M.","upper":true},{"key":"CMS 372T","name":"Time Matters","description":"An exploration of twentieth and twenty-first century time management issues resulting from the development of communication technologies. Subjects include the concept of twenty-four-hour, seven-day-a-week availability; information overload; increased work hours; sleep deprivation; hurry sickness; multitasking; the human experience of time across diverse social, cultural, and historical contexts; and other time-related issues that shape, and are shaped by, communication behaviors. Three lecture hours a week for one semester. Communication Studies 367 (Topic: Time Matters) and 372T may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"CMS 373D","name":"Advocacy in Applied Settings","description":"An introduction to the issues faced when advocating for an issue, idea, or one's self. The course aims to have students grasp concepts they will see and experience during their internship in Washington, DC. Eight conference hours a day for six days, for the equivalent of three lecture hours a week for one semester. Taught in Washington, DC. Prerequisite: Consent of the department.","upper":true},{"key":"CMS 374D","name":"Beyond Congress and the White House","description":"Explores issues of power in our nation's capital. Students study Washington, DC via visits to sites around the city. One three-hour field trip a week for one semester. Taught in Washington, DC. Prerequisite: Consent of the department.","upper":true},{"key":"CMS 379H","name":"Honors Tutorial Course: Special Project","description":"The writing of a thesis or the presentation of a creative project; final comprehensive examination. Individual instruction. Prerequisite: Communication Studies 359H.","upper":true}]