[{"key":"P R 305","name":"Fundamentals of Public Relations","description":"Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Public Relations degree or the Bachelor of Science in Advertising degree.","upper":false},{"key":"P R 305S","name":"Introduction to Integrated Communication for Sports","description":"Same as Advertising 305S. Examination of the mass media industry in relation to the field of sports. Focus on the \"off-the-field\" industries of advertising, marketing, and public relations that impact sports; rights fees contracts; pre-game shows; gameday production; in-stadium activities; and press coverage. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising 305S, 378 (Topic 7: Integrated Communication for Sports), Kinesiology 352K (Topic: Integrated Communication for Sports), Public Relations 305S.","upper":false},{"key":"P R 309","name":"Introduction to Advertising and Public Relations Research","description":"Same as Advertising 309R. Restricted to advertising and public relations majors. Introduction to concepts and methods of statistics, with emphasis on analyzing personal and group behaviors. Includes exploratory data analysis, correlation and regression, descriptive statistics, sampling distributions, confidence intervals, and hypothesis testing. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising 309R, 378 (Topic: Introduction to Advertising and Public Relations Research), Public Relations 309, 378 (Topic: Topic: Introduction to Advertising and Public Relations Research).","upper":false},{"key":"P R 316","name":"Creativity and American Culture","description":"Same as Advertising 316. A cross-disciplinary view of the creative process and creative products. The conceptual core of film, fine arts, advertising, architecture, and literature. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Advertising or the Bachelor of Science in Public Relations. Fulfills the communication and culture requirement in the College of Communication.","upper":false},{"key":"P R 317","name":"Writing for Public Relations","description":"Restricted to public relations majors. Introduction to writing skills for the media, including readability, clarity, verification, and style. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Advertising 318J with a grade of at least B.","upper":false},{"key":"P R 319","name":"Principles of Public Relations","description":"Restricted to public relations majors. Principles, theory, history, ethics, and practice of public relations in a variety of organizational settings; elements of strategic management. Three lecture hours a week for one semester. Public Relations 319 and 331 may not both be counted. Prerequisite: Advertising 318J with a grade of at least B.","upper":false},{"key":"P R 331","name":"Fundamentals of Media Relations","description":"Strategic public relations decisions as they relate to media; investigation of ethical principles and norms regulating activity of public relations. Three lecture hours a week for one semester. May not be counted toward the major requirement for the Bachelor of Science in Public Relations degree. Public Relations 319 and 331 may not both be counted. Prerequisite: Advertising 318J with a grade of at least B.","upper":true},{"key":"P R 341S","name":"Research in Sports Communication and Media","description":"Same as Advertising 341S. An introduction to advertising and public relations research and methodology for sports. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and a University grade point average of at least 2.25.","upper":true},{"key":"P R 348","name":"Public Relations Techniques","description":"Analysis and production of print, electronic, and oral messages to achieve organizational objectives; fundamentals of media relations; Internet applications. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Upper-division standing; Public Relations 319 (or 333) or 331; and Journalism 315 or Public Relations 317 with a grade of at least C.","upper":true},{"key":"P R 348S","name":"The Business of Sports Media","description":"Same as Advertising 348S and Journalism 348G. Examination of the business of sports-related media, including over-the-air television, cable, satellite television, print, radio, social media, and internet-based media, and the impact of such media on sports presentation and development, professional franchises, colleges, and conferences. Emphasis on how the business of sports media generates revenue and content, and the business models for each type of media, the challenges to such models, and the likely future changes to them. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising 348S, 378 (Topic: The Business of Sports Media), Communication 325 (Topic: The Business of Sports Media), Journalism 348G, 349T (Topic: The Business of Sports Media), Public Relations 348S, 378 (Topic: The Business of Sports Media). Prerequisite: Upper-division standing and a University grade point average of at least 2.25; additional prerequisite for journalism majors: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"P R 350","name":"Public Relations Internship","description":"Restricted to public relations majors. Internship to be arranged by student and approved by instructor. Internship to be arranged. May be taken only once. Offered on the pass/fail basis only. Prerequisite: Advertising 344K, 345J, and Public Relations 348 with a grade of at least C in each.","upper":true},{"key":"P R 350S","name":"Internship in Sports Media","description":"Same as Advertising 350S. Restricted to Texas Program in Sports and Media students. Practical work experience in sports media. Internship to be arranged by student and approved by instructor. The equivalent of three lecture hours a week for one semester. May not be counted toward the Bachelor of Science in Advertising or the Bachelor of Science in Public Relations degrees. Offered on the pass/fail basis only. Prerequisite: Upper-division standing; a University grade point average of at least 2.25; Advertising 305S or Public Relations 305S; and three additional hours from the Sports Media Certificate approved coursework list.","upper":true},{"key":"P R 151","name":"Public Relations Internship","description":"Designed for students who have completed a three-semester-hour internship in public relations.  Internship and discussion hours to be arranged.  Offered on the pass/fail basis only. Prerequisite: Public Relations 350; consent of the public relations internship coordinator; and completion of the major requirements for enrollment in an internship course.","upper":true},{"key":"P R 352","name":"Strategies in Public Relations","description":"Restricted to public relations majors. Strategies relating to public relations disciplines, including the management of external, internal, community, nonprofit, and media issues, and public relations marketing programs. Three lecture hours a week for one semester. Prerequisite: Public Relations 319 or 331, and 348 with a grade of at least C in each.","upper":true},{"key":"P R 353","name":"Advertising and Public Relations Law and Ethics","description":"Same as Advertising 353.  The equivalent of three lecture hours a week for one semester. Only one of the following may be counted: Advertising 353, 371J, 376, Public Relations 353, 371J, 376. Fulfills the communication and culture requirement in the College of Communication. Prerequisite: For advertising majors, Advertising 318J with a grade of at least B; for public relations majors, Public Relations 319; for others, none.","upper":true},{"key":"P R 367","name":"Integrated Communications Management","description":"Public relations as a managerial problem-solving process; strategic management of programs to enhance public-organizational relationships. Three lecture hours a week for one semester. Advertising 370J and Public Relations 367 may not both be counted. Prerequisite: Advertising 344K, 345J, Marketing 320F, and Public Relations 348 with a grade of at least C in each.","upper":true},{"key":"P R 374","name":"Public Relations Publications","description":"Production of controlled public relations media for internal and external publics; analysis of annual reports, trade magazines, and electronic publishing. Three lecture hours a week for one semester. Prerequisite: Public Relations 319 or 331, and 348, or consent of instructor; and Journalism 315 or one of the following courses: Rhetoric and Writing 309K, 309S, 325M, 379C (Topic: Grammar and Style for Writers).","upper":true},{"key":"P R 377H","name":"Integrated Communications Campaigns: Honors","description":"Restricted to students in the Advertising or Public Relations Honors Program. The concept of media mix; matching product, consumer, and media profiles; and the conception, research, planning, and execution of advertising campaigns. Special emphasis on advanced copywriting, layout, and production for print and broadcast media. Students usually participate in major national contests involving brand development in advertising strategies. Three lecture hours a week for one semester, with additional hours to be arranged. Only one of the following may be counted: Advertising, 373, 373H, Public Relations 377H, 377K. Offered on the letter-grade basis only. Prerequisite: Upper-division standing, Advertising 370J or Public Relations 367, Public Relations 352, a University grade point average of at least 3.50, admission to the Advertising or Public Relations Honors Program, and consent of the undergraduate adviser.","upper":true},{"key":"P R 377K","name":"Integrated Communications Campaigns","description":"Integration of theory, research methods, and communication techniques for planning, implementing, and evaluating public relations campaigns; client proposal writing and presentation. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising, 373, 373H, Public Relations 377H, 377K. Prerequisite: Public Relations 367.","upper":true},{"key":"P R 377M","name":"Media Studies","description":"Topics in media and its effects on advertising and public relations strategies. The equivalent of three lecture hours a week for one semester; additional hours may be required for some topics. Advertising 377M and Public Relations 377M may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"P R 378","name":"Advanced Studies in Public Relations","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and a University grade point average of at least 2.25.","upper":true},{"key":"P R 378S","name":"Special Topics in Sports Media","description":"Topics in sports media related to issues in traditional and new media as they affect sports and entertainment advertising and public relations. The equivalent of three lecture hours a week for one semester or as required by the topic. Advertising 378S and Public Relations 378S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; Advertising 305S or Public Relations 305S with a grade of at least C; and a University grade point average of at least 2.25.","upper":true},{"key":"P R 379H","name":"Honors Tutorial Course","description":"Conference course of intensive study, planned by the Advertising Honors Committee; research and the writing of a substantial paper on a special public relations topic. Individual instruction. Prerequisite: Admission to the departmental honors program and consent of the undergraduate adviser.","upper":true}]