[{"key":"HED 110","name":"Freshman seminar","description":"Provides an overview of the life skills that are critical to success, such as academic, social, and health behaviors.  Offered on the pass/fail basis only.","upper":false},{"key":"HED 628","name":"Internship in Health Promotion","description":"Applied experiences in development, delivery, or evaluation of professional health promotion programs. One conference hour and seventeen hours of fieldwork a week for one semester. May be repeated once for credit. Prerequisite: Upper-division standing, consent of the director of the degree program in kinesiology, and a University grade point average of at least 2.50. A higher grade point average may be required.","upper":true},{"key":"HED 335","name":"Theories of Substance Use and Abuse","description":"An introduction to the psychological, social, pharmacological, and cultural aspects of substance use and abuse. Includes a study and critique of the theories of substance use and abuse. Three lecture hours a week for one semester.","upper":true},{"key":"HED 343","name":"Foundations of Epidemiology","description":"Designed to familiarize students with the basic tenets of epidemiology, as well as to provide an introduction to the different types of epidemiological study designs. Three lecture hours a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"HED 352K","name":"Studies in Health: Topical Studies","description":"Analysis and synthesis of the literature and discussion of current and specific issues in health. Three lecture hours a week for one semester. Laboratory work is required for some topics; these are identified in the Course Schedule.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"HED 366","name":"Human Sexuality","description":"Analysis of the physiological, psychological, and social factors in human sexuality. Three lecture hours a week for one semester.","upper":true},{"key":"HED 370K","name":"Topical Seminar in Health Promotion","description":"Identification, causes, incidence, prevention, control, and social implications of major problems in health. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"HED 371K","name":"Foundations of Health Promotion II","description":"Introduction to the processes of planning, implementing, and evaluating health promotion programs. Three lecture hours a week for one semester. Health Education 352K (Topic 1: Foundations of Health Promotion II) and 371K may not both be counted. Prerequisite: Upper-division standing and Health Education 370K (Topic 1: Foundations of Health Promotion I).","upper":true},{"key":"HED 373","name":"Evaluation and Research Design","description":"Restricted to health promotion students. Research methods and program evaluations in health promotion settings. Topics include types of experimental and non-experimental research, validity, reliability, experimental and quasi-experimental research designs, data collection procedures, measurement of health knowledge, attitudes and behaviors, data analysis, and the presentation of results. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true}]