[{"key":"KIN 310","name":"Physiological Basis of Conditioning","description":"Analysis and discussion of current issues and theories of physical conditioning. Three lecture hours a week for one semester. Kinesiology 310 and 339 may not both be counted.","upper":false},{"key":"KIN 311","name":"Water Safety Instruction and Lifeguard Training","description":"Principles and practical application of water safety instruction and lifeguard training, personal water safety skills sets, professional rescues, first aid, and CPR/AED programs. Successful completion of course sessions, activities, lectures, skill development and evaluation requirements will qualify the student to test for certifications from nationally recognized safety agencies. Three lecture hours and one laboratory hour a week for one semester. Only one of the following may be counted: Kinesiology 311, 213 (Topic 2: Water Safety Instruction), 213 (Topic 4: Lifeguarding Instruction). Offered on the letter-grade basis only.","upper":false},{"key":"KIN 311K","name":"Sport Psychology","description":"The psychological response to sport-related stress and the influence of psychological variables on sport performance and coaching. Three lecture hours a week for one semester.","upper":false},{"key":"KIN 312","name":"Issues in Kinesiology: Topical Studies","description":"Analysis and discussion of current issues within the discipline of kinesiology. Three lecture hours a week for one semester. Additional hours may be required for some topics; these are identified in the Course Schedule.  May be repeated for credit when the topics vary.","upper":false},{"key":"KIN 312G","name":"Golf Instruction","description":"Designed to train students to teach the game of golf. Three lecture hours a week for one semester, with additional fieldwork hours to be arranged. Prerequisite: Consent of instructor.","upper":false},{"key":"KIN 312M","name":"Management of Physical Activity and Sport Programs","description":"Introductory survey of the field of sport management.  Examines various types of sport organizations and introduces the student to practices in marketing, management, sport law, and basic finance.  Includes sport-specific management challenges, particularly events and facilities, and considerations for the future, such as social issues. Three lecture hours a week for one semester.","upper":false},{"key":"KIN 213","name":"Safety Information and Procedures","description":"Factors affecting human safety; techniques and procedures to promote and ensure safe living. The equivalent of three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"KIN 314 (TCCN: PHED 1331)","name":"Children's Movement","description":"Introduction to children's movement, physical activity, and fitness; professional standards, policy, and legislation; physiological principles and learning principles. Movement skills and appropriate teaching strategies to provide future teachers with the knowledge and skills to provide and support positive, effective physical education classes for children. Three lecture hours a week for one semester, with additional off-campus service learning project hours to be arranged.","upper":false},{"key":"KIN 315","name":"Motor Learning","description":"Psychological factors affecting performance and acquisition of motor skills. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Psychology 301.","upper":false},{"key":"KIN 316","name":"Structure and Organization of Sport Programs","description":"Introduction to sport management and effective organizational behavior for sport programs. Analysis of the dynamic management process necessary for the improvement of organizational productivity. Three lecture hours a week for one semester. May be repeated once for credit. Prerequisite: Kinesiology 312M and consent of instructor.","upper":false},{"key":"KIN 217","name":"Advanced Scuba Diving Leadership","description":"Designed to prepare experienced scuba divers to instruct, organize, and conduct safe, appropriate-level dives for certified divers. Also designed to prepare students to apply for certification as a National Association of Underwater Instructors (NAUI) Assistant Instructor or Divemaster. Three lecture or open-water hours a week, and three internship hours a week for one semester participating in the training of entry-level students. Prerequisite: Certification as a scuba rescue diver and as a National Association of Underwater Instructor (NAUI) Master Scuba Diver, or equivalent knowledge and experience.","upper":false},{"key":"KIN 119","name":"Movement Competence","description":"Acquisition and knowledge of techniques, with emphasis on learning mechanical and perceptual principles, rules, strategy, and officiating. The equivalent of three laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: A major or minor in the Department of Kinesiology and Health Education.","upper":false},{"key":"KIN 219D","name":"Movement Analysis: Dual Activities","description":"Application of biomechanics and motor learning principles to the analysis of selected movement activities, with particular emphasis on dual sports. Two lecture hours and one laboratory hour a week for one semester. Prerequisite: A major in applied movement science.","upper":false},{"key":"KIN 219G","name":"Advanced Golf","description":"Designed for the advanced golfer. Includes technical swing analysis and instruction, course management and course play, and tournament play. Two lecture hours a week for one semester, with additional fieldwork hours to be arranged. Prerequisite:  Consent of instructor, and a certified Professional Golfers Association (PGA) handicap of 15 or below or equivalent proficiency.","upper":false},{"key":"KIN 219K","name":"Athletics","description":"Knowledge and skills required for officials, coaches, and athletic trainers of interschool sports. Two lecture hours and two laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":false},{"key":"KIN 219S","name":"Movement Analysis: Individual Activities","description":"Restricted to kinesiology and health education majors. Application of movement skill analysis and biomechanical principles, physical laws of movement, fitness training principles and programs, exercise physiology, performance techniques, and skill progressions in individual activities and sport. Two lecture hours and one laboratory hour a week for one semester.","upper":false},{"key":"KIN 219T","name":"Movement Analysis: Team Activities","description":"Restricted to kinesiology and health education majors. Application of scientific and psychosocial aspects of team sports, basic mechanical principles, and basic progressions relevant to performing and teaching selected team sport skills. Students also learn basic strategies and tasks related to coaching and organizing a team. Two lecture hours and one laboratory hour a week for one semester.","upper":false},{"key":"KIN 320","name":"Applied Biomechanics of Human Movement","description":"Designed to provide students with an understanding of applied scientific analysis of movement. Examines the physiological, structural, and mechanical bases for human movement, with examples drawn from sport and rehabilitation. Lectures concentrate on a scientific approach to mechanisms underlying human movement and to strategies and practices of clinical and sport applications. Laboratory sessions focus on both theoretical and applied aspects of selected mechanical concepts. Three lecture hours and one and one half laboratory hours a week for one semester. Prerequisite: Kinesiology 324K, and Mathematics 305G or the equivalent.","upper":true},{"key":"KIN 321M","name":"Motor Development and Performance","description":"Development of fundamental motor patterns and skills from birth to adolescence; factors that influence motor skill development, such as growth, maturation, and neural and physiological mechanisms. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"KIN 322","name":"Diagnosis and Evaluation of Fitness","description":"Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Kinesiology 310, 324K, and 325K.","upper":true},{"key":"KIN 324K","name":"Applied Human Anatomy","description":"Combines the study of systematic and regional human anatomy. Includes applications of the skeletal system, and attachments and actions of muscles, with an emphasis on the mechanics of support and motion and their clinical applications. Two lecture hours and three laboratory hours a week for one semester. Biology 478L and Kinesiology 324K may not both be counted.","upper":true},{"key":"KIN 325K","name":"Physiology of Exercise","description":"Application of principles of physiology to muscular activities. Three lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Kinesiology 324K or a course in human physiology.","upper":true},{"key":"KIN 226","name":"Advanced Weight Training","description":"Explores various advanced techniques of weight training, with emphasis on the lifts used in the competitive strength sports of weightlifting and powerlifting. Includes plyometrics and functional training movements for athletic enhancement. Two lecture hours a week for one semester. Prerequisite: Weight training experience, or consent of instructor.","upper":true},{"key":"KIN 326K","name":"Kinesiology: Biomechanical Analysis of Movement","description":"Study of the principles of equilibrium, force, and motion as applied to human movement. Three lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Kinesiology 324K, Mathematics 408C, and Physics 302K.","upper":true},{"key":"KIN 628","name":"Fieldwork in Sport Management","description":"Twenty-seven hours of fieldwork a week for one semester. May be repeated once for credit. No more than twelve semester hours in the following courses may be counted: Kinesiology 127L, 227L, 327L, 627L, 628. Prerequisite: Upper-division standing, a University grade point average of at least 2.50, completion of an online test, and consent of the faculty adviser.","upper":true},{"key":"KIN 330E","name":"Sport Nutrition","description":"The nutritional needs of people whose physical activity ranges from recreational to elite competitive athletics. Development of practical dietary strategies based upon understanding how macronutrients, vitamins, minerals, and water are digested and absorbed for metabolism. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and Chemistry 314N or a course in human physiology.","upper":true},{"key":"KIN 331","name":"Physical Aging in America","description":"Three lecture hours a week for one semester. Kinesiology 331 and 352K (Topic: Physical Aging in America) may not both be counted. Prerequisite: Upper-division standing; Kinesiology 310, 315, or 325K; and six additional semester hours of coursework in kinesiology.","upper":true},{"key":"KIN 332","name":"Techniques of Fitness Leadership","description":"Practical application of theoretical content from exercise physiology, anatomy, and biomechanics. Emphasis on program design and development for healthy adults and special populations. Three lecture hours a week for one semester, with additional laboratory hours to be arranged. Prerequisite: Kinesiology 310 or 325K.","upper":true},{"key":"KIN 334","name":"Children's Exercise and Physical Activity","description":"Children's changing capacity for performance in exercise and sport. Includes performance changes as a function of physical growth and maturation, physiological response to activity and training, the relationship between children's health and adult health, and the psychosocial parameters that influence participation in physical activity. Three lecture hours a week for one semester. Prerequisite: Kinesiology 310.","upper":true},{"key":"KIN 336","name":"Neuromuscular Control","description":"Central and peripheral nervous system control of human muscular contractions and limb movement. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Kinesiology 324K, or a course in human physiology.","upper":true},{"key":"KIN 338","name":"Motor Development and Assessment","description":"Training in screening, diagnostic, and programmatic motor assessment instruments. Designed to give students practical experience in assessing physical and motoric development in children with and without disabilities. Three lecture hours a week for one semester. Prerequisite: Kinesiology 321M; Kinesiology 360 is recommended.","upper":true},{"key":"KIN 340","name":"Modern Olympic Movement in World Affairs","description":"Examination of the place of the modern Olympic movement in world affairs.  The cultural, political, and economic dynamics of this relationship will receive special emphasis.","upper":true},{"key":"KIN 140C","name":"Practicum in Athletic Training: Level 1A","description":"Supervised clinical experiences in the application of concepts, theories, and techniques associated with the prevention, recognition, and immediate care of injuries and illnesses suffered by athletic and physically active populations. Students use cognitive, psychomotor, and affective skills and knowledge to complete a prescribed set of educational competencies and clinical proficiencies under the direction of an approved clinical instructor. One lecture hour and twenty hours of fieldwork a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"KIN 140D","name":"Practicum in Athletic Training: Level 1B","description":"Supervised clinical experiences in the application of concepts, theories, and techniques associated with the prevention, recognition, immediate care, and treatment of injuries and illnesses suffered by athletic and physically active populations. Emphasizes the application of therapeutic modalities and soft-tissue therapy techniques. Students use cognitive psychomotor and affective skills and knowledge to complete a prescribed set of educational competencies and clinical proficiencies under the direction of an approved clinical instructor. One lecture hour and twenty hours of fieldwork a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"KIN 140E","name":"Practicum in Athletic Training: Level 2A","description":"Supervised clinical experiences in the application of concepts, theories, and techniques associated with the prevention, recognition, immediate care, treatment, evaluation, and diagnosis of injuries and illnesses suffered by athletic and physically active populations. Emphasizes clinical evaluation and assessment techniques. Students use cognitive, psychomotor, and affective skills and knowledge to complete a prescribed set of educational competencies and clinical proficiencies under the direction of an approved clinical instructor. One lecture hour and twenty hours of fieldwork a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"KIN 140F","name":"Practicum in Athletic Training: Level 2B","description":"Supervised clinical experiences in the application of concepts, theories, and techniques associated with the prevention, recognition, immediate care, treatment, evaluation, diagnosis, rehabilitation, and reconditioning of injuries and illnesses suffered by athletic and physically active populations. Emphasizes therapeutic exercise and rehabilitation procedures. Students use cognitive, psychomotor, and affective skills and knowledge to complete a prescribed set of educational competencies and clinical proficiencies under the direction of an approved clinical instructor. One lecture hour and twenty hours of fieldwork a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"KIN 140G","name":"Practicum in Athletic Training: Level 3A","description":"Supervised clinical experiences in the application of concepts, theories, and techniques associated with the prevention, recognition, immediate care, treatment, evaluation, diagnosis, rehabilitation, and reconditioning of injuries and illnesses suffered by athletic and physically active populations. Emphasizes general medical conditions. Students use cognitive psychomotor and affective skills and knowledge to complete a prescribed set of educational competencies and clinical proficiencies under the direction of an approved clinical instructor. One lecture hour and twenty hours of fieldwork a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"KIN 140J","name":"Practicum in Athletic Training: Level 3B","description":"Supervised clinical experiences in the application of concepts, theories, and techniques associated with the prevention, recognition, immediate care, treatment, evaluation, diagnosis, rehabilitation, and reconditioning of injuries and illnesses suffered by athletic and physically active populations. Emphasizes the administrative and professional aspects of managing these conditions. Students use cognitive psychomotor and affective skills and knowledge to complete a prescribed set of education competencies and clinical proficiencies under the direction of an approved clinical instructor. One lecture hour and twenty hours of fieldwork a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"KIN 341","name":"Therapeutic Modalities in Athletic Training","description":"The study and practice of using therapeutic modalities, including soft tissue and manual therapy techniques, to treat athletic injuries. Covers physiological effects, indications, contraindications, protocols, injury pathology, and tissue healing. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Kinesiology 312 (Topic 2), or consent of instructor.","upper":true},{"key":"KIN 342","name":"Clinical Evaluation of Athletic Injuries in the Lower Body","description":"The study and practice of techniques involved in the evaluation of athletic injuries affecting the lower body. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Kinesiology 312 (Topic 2) and 324K, and concurrent enrollment in Kinesiology 343; or consent of instructor.","upper":true},{"key":"KIN 343","name":"Clinical Evaluation of Athletic Injuries in the Upper Body","description":"The study and practice of techniques involved in the evaluation of athletic injuries affecting the upper body. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Kinesiology 312 (Topic 2), 324K, and concurrent enrollment in 342; or consent of instructor.","upper":true},{"key":"KIN 344","name":"Therapeutic Exercise and Rehabilitation Techniques","description":"The study and practice of therapeutic exercise techniques and rehabilitation protocols in treating athletic injuries and illnesses. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Kinesiology 324K and 342, or consent of instructor; credit or registration for Kinesiology 119 (Topic 10) and 226 or 363.","upper":true},{"key":"KIN 345","name":"Topics in Athletic Training","description":"Presentations, including some by medical and allied medical specialists, covering topics in athletic training and sports medicine. Three lecture hours and one laboratory hour a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"KIN 346","name":"Athletic Training Program Administration","description":"The study of organizational and administrative principles involved with athletic training programs. Includes legal issues, budgetary concerns, and policies and procedures. Also includes resume development and career planning. Three lecture hours a week for one semester. Prerequisite: Kinesiology 219K (Topic 3), 341, 342, and 344; or consent of instructor.","upper":true},{"key":"KIN 347","name":"Historical and Ethical Issues in Physical Culture and Sports","description":"Designed to provide an overview of the historical antecedents of the modern fitness movement and examine the intellectual and social motivations involved in the pursuit of health and physical fitness. Explores the history of sport science, how laboratory revelations lead to new fitness regimens, and ethical issues in the field of physical culture and sport, such as the use of ergogenic drugs, the social consequences of high performance sport, and professional ethics in the fields of kinesiology and health education. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 348","name":"Psychological Aspects of Exercise","description":"Examines both the psychological benefits that accrue from exercise, such as reduced depression and stress, as well as the psychological predictors of exercise adherence. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 349","name":"History of Sport and Physical Activity","description":"Restricted to students in the Bachelor of Science in Kinesiology and Health with a major in physical culture and sports or sport management. Significant developments in sport and physical activity since prehistoric time; emphasis on events influencing contemporary American programs and the International Olympic Games. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"KIN 350","name":"Sociological Aspects of Sport and Physical Activity","description":"Restricted to students in the Bachelor of Science in Kinesiology and Health with a major in physical culture and sports or sport management.  Three lecture hours a week for one semester. Kinesiology 350 and 352K (Topic: Sociological Aspects of Sport and Physical Activity) may not both be counted.","upper":true},{"key":"KIN 351","name":"Philosophy of Sport and Physical Activity","description":"Restricted to students in the Bachelor of Science in Kinesiology and Health with a major in physical culture and sports or sport management. Designed to introduce the student to the ideas and methodologies of the philosophic exploration of play, sport, athletics, exercise, and the body. Emphasis on the study of sport and ethics. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"KIN 352K","name":"Studies in Human Movement: Topical Studies","description":"Analysis and synthesis of the literature and discussion of current and specific issues in kinesiology. Three lecture hours a week for one semester. Laboratory work is required for some topics; these are identified in the Course Schedule.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"KIN 353","name":"Sport Law","description":"Restricted to students in the Bachelor of Science in Kinesiology and Health with a major in sport management. Introduces the legal principles applicable to a variety of sport settings. Topics include tort liability, with a special emphasis on the effective management of risk; and constitutional law issues, focusing on the individual rights of amateur athletes and employees in sport organizations. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 354","name":"Sport and Event Marketing","description":"Restricted to students in the Bachelor of Science in Kinesiology and Health with a major in sport management. Application of the fundamental principles used in the marketing of sport and events. An introduction to service quality for increasing customer satisfaction and effectiveness of sport organizations. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 355","name":"Media and Public Relations in Sport","description":"Examination and application of the concepts of public and media relations to sport and leisure organizations. Topics include effective interpersonal communication, persuasion, media relations, publicity tactics, and writing and oral communications skills. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 356","name":"Revenue and Budgeting in Sport","description":"Restricted to students in the Bachelor of Science in Kinesiology and Health with a major in sport management. Introduction to financial analysis and budgeting techniques in the context of sport organizations; conventional and innovative methods for the acquisition of revenue available to sport organizations. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 357","name":"Strategic Management of Sport Organizations","description":"Restricted to students in the Bachelor of Science in Kinesiology and Health with a major in sport management. Examination of management and service delivery systems in sport organizations. Designed to develop specific knowledge and management skills in the areas of human resources, events, facilities, and risk management. Three lecture hours a week for one semester. Prerequisite: Kinesiology 354 and 356.","upper":true},{"key":"KIN 360","name":"Programming for People with Disabilities","description":"Restricted to students with a major or minor in the Department of Kinesiology and Health Education. Designed for Applied Movement Science majors. Course investigates programming options for people with disabilities in the area of sport, recreation, and community involvement. Three lecture hours a week for one semester, with additional field observation hours to be arranged. Prerequisite: Six semester hours of coursework in kinesiology, or consent of instructor.","upper":true},{"key":"KIN 361","name":"Coaching Theory and Principles I","description":"Examines the philosophy, ethics, strategies, motivational techniques, performance analysis, program organization, contest administration, and facilities management related to coaching. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 362","name":"Coaching Theory and Principles II","description":"Examines the process of becoming a successful coach and developing a coaching protocol for a specific sport. Three lecture hours a week for one semester. Prerequisite: Kinesiology 361 or consent of instructor.","upper":true},{"key":"KIN 363","name":"Theory and Practice in Strength Coaching","description":"Explores the physiology and biomechanics of strength training and conditioning, as well as popular assessment protocols and exercise prescription principles. Additional areas include the organization and administration of a strength/conditioning facility, staff utilization, integration of weight training with other training techniques, and other standard strength coaching practices. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 364","name":"Aquatic Facility Operator: Management and Administration","description":"Designed to prepare the aquatic professional for leadership in the management of indoor and outdoor facilities. Includes aquatic facility operation, administration of programs, physical operations, policies and procedures, and staff development and training. Includes design, pool operation, water chemistry, facility management, safety procedures and risk management, budgeting, and marketing aquatic programs. Studies educational, sport, and recreational aspects of pools, lakes, camps, and beachfronts. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 365","name":"The Business of Golf","description":"Restricted to students in the College of Education. Designed for students pursuing a career in the golf business. Includes clubhouse and links management, sales, agronomy, technology, and equipment. Three lecture hours a week for one semester.","upper":true},{"key":"KIN 370K","name":"Topical Seminar in Health Promotion","description":"Identification, causes, incidence, prevention, control, and social implications of major problems in health. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"KIN 375","name":"Issues and Trends in Developmental Movement Programs","description":"Introduction to issues related to the goals, organization, and success of developmental movement programs, such as school physical education, youth sports, YMCA, and other recreation programs and community activities. Issues include equity, competition, fitness, social development, safety and liability, and sportsmanship. Involves group work and observation and involvement in community programs. Two lecture hours and three laboratory hours a week for one semester.","upper":true},{"key":"KIN 376","name":"Measurement in Kinesiology","description":"Measurement and assessment procedures; application of statistical procedures; standards for authentic assessment; measurement/assessment selection and evaluation; use of technology in tracking development of motor skills and fitness. Three lecture hours a week for one semester. Prerequisite: Six semester hours of upper-division coursework in kinesiology.","upper":true},{"key":"KIN 379H","name":"Honors Tutorial Course","description":"Readings or a research project, under the supervision of a faculty member, in specific areas of research within kinesiology. Three lecture hours a week for one semester.  May be repeated for credit. Prerequisite: A University grade point average of at least 3.00 and consent of instructor.","upper":true}]