[{"key":"J 301F","name":"Fundamental Issues in Journalism","description":"Examination of major issues facing the news media in a democratic society and the exploration of digital technology on the future of news gathering, including ethics, institutions, effects, and standards of journalistic performance. Three lecture hours a week for one semester. Journalism 301F and 310 may not both be counted.","upper":false},{"key":"J 302F","name":"Digital Storytelling Basics","description":"Restricted to journalism majors. Introduction to multiple technologies for digital delivery of text, photos, audio, and video news across journalism platforms. Includes a module on grammar, spelling, and punctuation. Students must pass the grammar, spelling, and punctuation module to pass the course. Three lecture hours and three laboratory hours a week for one semester. Journalism 302F and 315 may not both be counted.","upper":false},{"key":"J 310F","name":"Reporting: Words","description":"Restricted to journalism majors. Reporting, writing, and editing skills for print, online, and broadcast. Three lecture hours and three laboratory hours a week for one semester. Journalism 310F and 320D may not both be counted. Prerequisite: Journalism 301F (or 310) and 302F (or 315) with a grade of at least C in each.","upper":false},{"key":"J 310K","name":"Visual Literacy","description":"Introduction to the visual concerns of message design and interpretation, including their bases in theories of visual perception, semiotics, and media practice. Three lecture hours a week for one semester.","upper":false},{"key":"J 311F","name":"Reporting: Images","description":"Restricted to journalism majors. Photography, video, and design for print, web, and broadcast, including design principles, visual perception, typography, manipulation of images, and photographs. Three lecture hours and three laboratory hours a week for one semester. Only one of the following may be counted: Journalism 311F, 318C, 321C. Offered on the letter-grade basis only. Prerequisite: Journalism 301F (or 310) and 302F (or 315) with a grade of at least C in each.","upper":false},{"key":"J 313S","name":"Topics in Texas Sports and Media","description":"Introduction to various contemporary and historical issues, emphasizing interdisciplinary perspectives and critical discourse. Three lecture hours a week for one semester. Communication 310 and Journalism 313S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":false},{"key":"J 318","name":"Photography I","description":"Intensive training in basic digital and black-and-white photography; darkroom techniques; and fundamental approaches to producing images. Three lecture hours and four laboratory hours a week for one semester. Journalism 318 and 325 may not both be counted. Prerequisite: Journalism 316 with grade of at least C, and a major in journalism or consent of instructor.","upper":false},{"key":"J 320F","name":"Covering Law Enforcement and Courts","description":"Restricted to journalism majors. Specialized reporting, research, and writing skills for investigating and covering incidents and issues occurring in law enforcement, public safety, and criminal justice. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 321F","name":"Reporting on City and County Government","description":"Restricted to journalism majors. Basic beat reporting skills to navigate city and county governments, and conducting reporting, research, and writing on issues and people at the local level. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 322F","name":"Navigating State Government","description":"Restricted to journalism majors. Training and instruction in specialized reporting, research, and writing skills as applicable to covering state governments. Analysis of enduring issues and politics at the state level. Fieldwork at the Texas Capitol and state agencies. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 323F","name":"Education Reporting","description":"Restricted to journalism majors. Covering school districts and higher education to produce stories that humanize the bureaucracy of public education and compellingly depict issues, structures, and policies. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 324F","name":"Business and Financial Reporting","description":"Restricted to journalism majors. Instruction in how to conceptualize, source, and prepare news reports on global financial markets, commercial transactions, and company performance. The course is global, with the United States a subset of the material covered. Hands-on course during which students produce multiple news packages for publication. Three lecture hours a week for one semester. Journalism 324F and 349T (Topic 2: Business Journalism) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 325F","name":"Covering Politics","description":"Restricted to journalism majors. Specialized research, reporting, and writing skills to cover political issues, candidates, and campaigns. Three lecture hours a week for one semester. Journalism 325F and 349T (Topic 16: Politics and the Press) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 326F","name":"Reporting Sports","description":"Restricted to journalism majors. Contemporary professional skills and techniques in sports journalism. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each..","upper":true},{"key":"J 326S","name":"Advanced Topics in Texas Sports and Media","description":"Restricted to journalism majors. Critical assessment of various contemporary and historical issues, emphasizing interdisciplinary perspectives. Three lecture hours a week for one semester. Communication 320 and Journalism 326S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 327","name":"Feature Writing","description":"Practice in researching, reporting, writing, structuring, and editing feature stories and news features for the print media. Identifying and contacting appropriate freelance markets regarding queries and stories. Three lecture hours a week for one semester. Only one of the following may be counted: Journalism 327, Latin American Studies 322 (Topic 4: Feature Writing), Mexican American Studies 374 (Topic 6: Feature Writing). Prerequisite: Journalism 310F (or 320D) with a grade of at least C, and admission to a journalism area of concentration.","upper":true},{"key":"J 329T","name":"Topics in Public Affairs Reporting","description":"Restricted to journalism majors. Contemporary social, professional, and intellectual concerns in the practice of public affairs reporting. Three lecture hours a week for one semester. Some topics may require additional laboratory hours.  May be repeated for credit when the topics vary. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 330F","name":"Television Reporting and Producing","description":"Restricted to journalism majors. Basic television news gathering skills, including shooting and editing videotape, planning and executing visual storytelling, and writing and producing news packages. Students assist in the production of a television news program. Three lecture hours and three laboratory hours a week for one semester. Journalism 330F and 353D may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each, and Journalism 331G (or 322D) with a grade of at least C.","upper":true},{"key":"J 330G","name":"Creative Nonfiction for Magazines and Books","description":"Restricted to journalism majors. Reporting and writing skills for narrative nonfiction, including writing book proposals, magazine pitches, and sample chapters. Three lecture hours a week for one semester. Journalism 330G and 359T (Topic 6: Narrative Storytelling) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 330J","name":"Advanced Photo Editing and Design","description":"Restricted to students in the Maymester Abroad Program. Explores intensive photographic reportage and documentation using the camera as a tool of investigation and interaction. Emphasis on creation of photo stories, photo essays, and feature stories, with editing and page layout. Taught abroad; location may vary by semester. Only one of the following may be counted: Journalism 330J, 370K (Topic 1: Advanced Photo Editing and Design), 395 (Topic 2: Advanced Photo Editing and Design).","upper":true},{"key":"J 331","name":"Web Publishing","description":"Advanced skills in Web design and in publishing multimedia content. Emphasis on collaborative work in creating an ongoing Web information product. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with grade of at least C in each, and admission to a journalism area of concentration.","upper":true},{"key":"J 331F","name":"Entrepreneurial Journalism","description":"Restricted to journalism majors. Creating for-profit and nonprofit journalistic enterprises in the news media ecosystem; the impact of digital technology on the news industry, with emphasis on changes to business and distribution models, and ways people consume and produce news and information; and projects and prototypes that include business plans and content planning. Three lecture hours a week for one semester. Journalism 331F and 359T (Topic: Entrepreneurial Journalism) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 331G","name":"Audio Storytelling","description":"Restricted to journalism majors. Examination and practice of writing news for podcast. Three lecture hours and three laboratory hours a week for one semester. Only one of the following may be counted: Journalism 322D, 331G, 359T (Topic 7: Podcasting). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 331J","name":"Studio Photography","description":"Restricted to journalism majors. An investigation of the principles of studio lighting, theory and practice of contemporary color, location lighting, and production of portfolio-quality work, as applicable to advertising, photographic illustration, and photojournalism. Three lectures and four lab hours a week for one semester. Journalism 331J and 371K (Topic 2: Studio Photography) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each; Communications 316 or Journalism 316 with a grade of at least C.","upper":true},{"key":"J 332F","name":"News Editing for Online and Print","description":"Restricted to journalism majors. Advanced multimedia editing and production techniques. Emphasis on news judgment, language use, editing of textual elements, and use of digital software for print and web publication of text, audio, and visual imagery. Three lecture hours and three laboratory hours a week for one semester. Journalism 332F and 330 may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 332G","name":"Explanatory Journalism: Storytelling in a Digital Age","description":"Restricted to journalism majors. Examination of the evolution of long-form explanatory storytelling from print and film to new forms of Web-based and interactive storytelling. Three lecture hours a week for one semester. Journalism 332G and 359T (Topic: Explanatory Journalism: Storytelling in a Digital Age) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 332J","name":"Sports for Reporting Texas","description":"Restricted to journalism majors. Students work as sports reporters for the School of Journalism's Reporting Texas Web site. Three lecture hours a week for one semester. Additional hour(s) to be arranged. Journalism 332J and Journalism 339T (Topic: Sports for Reporting Texas) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each..","upper":true},{"key":"J 333F","name":"Data-Driven Reporting","description":"Restricted to journalism majors. Electronic document retrieval and manipulation; spreadsheet and database management; and Internet skills. Includes collaborative work on major investigative projects. Three lecture hours a week for one semester. Journalism 333F and 338 may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 333G","name":"Advanced Visual Journalism: Photo","description":"Explores intensive photographic reportage and documentation using the camera as a tool of investigation and interaction. Emphasis on creation of photo stories, photo essays, and feature stories, with editing and page layout. Three lecture hours and three laboratory hours a week for one semester. Journalism 333G and 355 may not both be counted. Prerequisite: Communication 316 or Journalism 316 with a grade of at least C.","upper":true},{"key":"J 333J","name":"Photography for Reporting Texas","description":"Restricted to journalism majors. Students work as photographers for the School of Journalism's Reporting Texas Web site. Three lecture hours and three lab hours a week for one semester. Additional hour(s) to be arranged. Journalism 333J and Journalism 359T (Topic: Photography for Reporting Texas) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 334","name":"Multimedia Journalism","description":"Review of online reporting techniques, advanced multimedia skills, and current issues in new media. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least C in each, and admission to a journalism area of concentration.","upper":true},{"key":"J 334F","name":"Oral History as Journalism","description":"Restricted to journalism majors. Instruction in the use of oral history to generate journalistic coverage. Modules include concepts and methods of gathering oral history; illustration of the techniques using the Vietnam War as a topic; and generating oral history-based coverage focusing on the Mexican American experience. Three lectures hours a week for one semester. Only one of the following may be counted: Journalism 334F, 349T (Topic 7: Oral History as Journalism), 395 (Topic 20: Oral History as Journalism). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 334G","name":"Advanced Visual Journalism: Video","description":"Restricted to journalism majors. Explores intensive video reportage and documentation using the camera as a tool of investigation and interaction. Emphasis on creation of video news and feature stories. Three lecture hours and three laboratory hours a week for one semester. Only one of the following may be counted: Journalism 334G, 370K, 371K. Prerequisite: Communication 316 or Journalism 316 with a grade of at least C; and Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 335","name":"Narrative Journalism","description":"Students develop and produce a publication, focusing particularly on underrepresented groups and issues. Three lecture hours and three laboratory hours a week for one semester. Only one of the following may be counted: Journalism 335, Latin American Studies 322 (Topic 11: Latino Community Journalism), 322 (Topic 11: Narrative Journalism), Mexican American Studies 374 (Topic 4: Latino Community Journalism), 374 (Topic 4: Narrative Journalism). Prerequisite: Journalism 310F (or 320D) with a grade of at least C, admission to a journalism area of concentration, and consent of instructor.","upper":true},{"key":"J 335F","name":"Magazine Writing and Production","description":"Restricted to journalism majors. Instruction in and supervised practice of magazine writing and production. Laboratory hours include production of a magazine online and in print. Three lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Journalism 335F, 349T (Topic 15: Magazine Production), 359T (Topic 2: Magazine Production). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 335G","name":"Advanced Television Reporting and Producing","description":"Restricted to journalism majors. Advanced writing and reporting skills for the collaborative production of television news programs on deadline. Students assist in producing a television news program. Three lecture hours and three laboratory hours a week for one semester. Journalism 335G and 372D may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each, and Journalism 330F (or 353D) with a grade of at least C.","upper":true},{"key":"J 335J","name":"Mobile Programming for Journalists","description":"Restricted to journalism majors. Students will learn coding and other skills in preparation for designing mobile news apps. Three lecture hours a week for one semester. Additional hour(s) to be arranged. Journalism 335J and 339T (Topic: Introduction to Mobile Programming for Journalists) may not both be counted. Prerequisite: Upper-division standing and Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 336D","name":"Graphic Design for Print and Online","description":"Restricted to journalism majors. Overview, design, and production of materials for online and print storytelling. Subjects include design principles, visual perception, typography, manipulation of images and photographs, and page design for media platforms. Three lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Journalism 303F, 319, 336, 336D. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 336F","name":"Social Media Journalism","description":"The role of journalism in emerging digital social networks, examining current and traditional theories about social media as a form of journalism.  Practice in the use of live chatting, tagging, geotagging, wikis, Twitter, Flickr, and digital avatars as news-gathering techniques. Three lecture hours a week for one semester. Journalism 336F and 349T (Topic: Social Media Journalism) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 336G","name":"Producing Social Documentaries for Television News","description":"Restricted to journalism majors. Instruction in the production of social documentaries for television, with emphasis on social issues often ignored by television news. Includes production of a twenty-minute long-form story. Three lecture hours and three laboratory hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each; Journalism 331G or 359T (Topic 7: Podcasting) with a grade of at least C.","upper":true},{"key":"J 337F","name":"Long-Form Feature Writing","description":"Restricted to journalism majors. Advanced instruction in reporting and writing long-form narratives, including lessons in analyzing story-telling tools, strategies, and techniques. Examination of narrative strategies and techniques across different media platforms. Three lecture hours a week for one semester. Journalism 337F and 374D may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 337G","name":"Opinion Writing","description":"Restricted to journalism majors. Examines opinion writing and commentary in traditional  print and evolving online formats. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 337J","name":"Writing for Online News Audiences","description":"Restricted to journalism majors. Students will learn how to write informatively and effectively for online audiences, and how to repurpose traditional print journalism for online publication. Three lectures a week for one semester. Journalism 337J and 349T (Topic 22) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 338F","name":"Advanced Visual Design","description":"Restricted to journalism majors. Advanced exploration of principles and processes of visual design, including design principles, visual perception, typography, image making, uses of color, printing techniques, and publication design. Three lecture hours and three laboratory hours a week for one semester. Only one of the following may be counted: Journalism 338F, 359T (Topic 3: Advanced Visual Design), 395 (Topic 5: Advanced Visual Design). Prerequisite: Journalism 303F, (or 319), or 336D with a grade of at least C, and Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 338G","name":"Data Visualization","description":"Restricted to journalism majors. An investigation of how to tell stories through data and data visualization. Subjects include finding compelling data sets, cleaning and analyzing the contents, and presenting results online through a variety of methods, including online interactive charts and maps. Journalism 338G and 359T (Topic: Data Visualization) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 339D","name":"News Documentaries and Public Affairs","description":"Study and practice of researching, writing, and producing short-form and magazine documentaries for television. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) with a grade of at least C, and admission to a journalism area of concentration.","upper":true},{"key":"J 339F","name":"Investigative Reporting","description":"Restricted to journalism majors. Emphasis on determining what an investigative story is, finding investigative stories, and basic tactics in pursuing such stories. Three lecture hours and three laboratory hours a week for a semester. Journalism 339F and 359T (Topic 5: Investigative Reporting) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 339G","name":"Mobile News App Design","description":"Restricted to journalism majors. Planning and building a mobile app, whether for Android, iOS, or web-based, and personal communication in the news business and in various other journalism-related topics. Journalism 339G and Journalism 359T (Topic: Mobile News App Design) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each, and consent of instructor.","upper":true},{"key":"J 339S","name":"Research in Texas Sports and Media","description":"Same as Communication 330. Restricted to journalism majors. Supervised research with a faculty member; research may consist of an individual project or assisting a faculty research project. Hours to be arranged.  May be repeated for credit. Prerequisite: Upper-division standing and a University grade point average of at least 2.25; and Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 339T","name":"Topics in Specialized Journalistic Skills","description":"Restricted to journalism majors. Contemporary social, professional, and intellectual concerns in the practice of specialized journalistic skills. Three lecture hours a week for one semester. Some topics may require additional laboratory hours.  May be repeated for credit when the topics vary. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 340F","name":"Covering the Global Economy","description":"Restricted to journalism majors. Examines the enduring financial, economic, and business issues journalists confront in covering the global economy. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 340G","name":"Reporting Asia: A Foreign Correspondent's Framework","description":"Restricted to journalism majors. Explores dynamic ways of looking at, thinking about, and reporting the world, and establishes a framework for analyzing how the news media cover key events, issues, and processes that shape our lives in a global society. Three lecture hours a week for one semester. Only one of the following may be counted: Journalism 340G, 349T (Topic 17: Reporting Asia), 395 (Topic 17: Reporting Asia). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 340J","name":"Documentary Tradition of Latin America","description":"Restricted to journalism majors. Contemporary social, professional, and intellectual concerns with the practice of journalism. Study of still photographic and video documentary work by Latin Americans about Latin America. Production of photographic essays on Latin American culture. Three lecture hours a week for one semester. Only one of the following may be counted: Journalism 340J, 349T (Topic: Documentary Tradition in Latin America), 395 (Topic 4: Documentary Tradition of Latin America). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 341F","name":"Understanding African Americans and the Media","description":"Restricted to journalism majors. Examination of documentaries and films, readings and discussions, writing and research assignments, and group projects to increase understanding of the historical context of African Americans in United States society. Focuses on evaluating media representation and coverage of African Americans. Three lecture hours a week for one semester. Journalism 341F and 340C (Topic 2: African Americans and the Media) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 341G","name":"Reporting China: A Foreign Correspondent's Workshop","description":"Restricted to journalism majors. Contemporary social, professional, and intellectual concerns with the practice of journalism. Three lecture hours a week for one semester. Journalism 341G and 349T (Topic 18: Reporting China) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 341J","name":"Minorities and the Media","description":"Restricted to journalism majors. Issues concerning minority or nondominant groups in the United States. Survey of minority communication problems, including alienation, fragmentation, and media and Internet access. Criticism and feedback for minority groups based on racial/ethnic background, age, sex, disability, social or economic class, and sexual orientation. Three lecture hours a week for one semester. Only one of the following may be counted: Journalism 340C (Topic 1: Mass Media and Minorities), 341J, Latin American Studies 322 (Topic 10: Minorities and the Media), Mexican American Studies 374 (Topic 22: Minorities and the Media), Urban Studies 354 (Topic: Mass Media and Minorities), Women's and Gender Studies 340 (Topic 21: Minorities and the Media). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 342F","name":"Women and the News","description":"Restricted to journalism majors. Historical and contemporary exploration of women and the news. Examination of the role of women in producing news and the construction of women within news texts. Three lecture hours a week for one semester. Journalism 340C (Topic 5: Women and the News) and 342F may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 342G","name":"Reporting the World: A Critical Examination of the United States News Media","description":"Restricted to journalism majors. Dynamic ways of looking at, thinking about, and reporting the world, both abroad and at home. Establishes a framework for analyzing how the news media cover key events, issues, and processes that shape our lives in a global society. Three lecture hours a week for one semester. Journalism 342G and 349T (Topic 19: Reporting the World) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 343F","name":"Journalism and Religion","description":"Restricted to journalism majors. Critical examination of how religion traditionally has been covered in the United States, and guidelines for developing individual thinking and reporting on religious issues. Three lecture hours a week for one semester. Journalism 340C (Topic 3: Journalism and Religion) and 343F may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 343G","name":"Exploring Digital Media and Society","description":"Restricted to journalism majors. Examines the connection between new media and society through a variety of theoretical and practical perspectives to explore the implications of the use of technology and new media in influencing community, social relationships, and public and private spaces, as well as the profession of journalism. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 343J","name":"Globalization and Social Media","description":"Restricted to journalism majors. An investigation of new communication technologies as they pertain to globalization and social media. Three lecture hours a week for one semester. Only one of the following may be counted: Asian American Studies 320 (Topic: Globalization and Social Media), Journalism 343J, 349T (Topic: Globalization and Social Media), Radio-Television-Film 331M (Topic: Globalization and Social Media), Sociology 321K (Topic: Globalization and Social Media). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 344F","name":"Reporting on Gender and Sexuality","description":"Restricted to journalism majors. Instruction on how to cover controversial issues around gender and sexuality. Review of the sociology of gender and sexuality, with a focus on political, economic, and cultural implications. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 344G","name":"Urban Journalism","description":"Restricted to journalism majors. Studies of basic city functions and how to detect urban dysfunctions before crises become news. Topics include infrastructure decay, traffic congestion, poverty and homelessness, digital divides, school dropouts, conflict and crime, riots and protests, obesity and disease, recreation, and pollution. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 344J","name":"Media Images and Society","description":"Restricted to journalism majors. The power of mediated images in culture and society; exploration of the way images, language, and human activity shape visual messages; and the historical relationship between technology and image creation. Three lecture hours a week for one semester. Journalism 344J and 349T (Topic: Media Images and Society) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 345F","name":"Social Issues Reporting","description":"Restricted to journalism majors. Coverage of social issues such as immigration, health care, and child welfare. Examination of stereotypes, how they affect reporting, and how they change as student reporters encounter new subjects. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 345G","name":"Human Rights Journalism","description":"Restricted to journalism majors. Exploration of the role of journalists in exposing human rights abuses. Modules include case studies from El Salvador, South Africa, Zimbabwe, Rwanda, Bosnia, Sudan, Israel, and Russia, as well as the legal and moral obligations of journalists as witnesses to atrocities and genocide. Examination of the Bush Administration's global War on Terror and the legacy confronting the Obama Presidency. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 345J","name":"Web Design for Journalists","description":"Restricted to journalism majors. An overview of Web technologies used for publishing and marketing purposes, and an analysis of the evolution and potential of digital publishing. Designed to familiarize students with systems commonly used in Web development such as HTML and CSS coding; content management systems; graphic design; usability and search engine optimization (SEO); online advertising and marketing(Google AdWords/AdSense and social media); and audience tracking (Google Analytics). Meets three hours a week for one semester. Journalism 345J and 359T (Topic: Web Design for Journalism) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 346F","name":"Reporting on the Environment","description":"Restricted to journalism majors. Instruction and supervised fieldwork in environmental coverage. Topics include interviewing, elements and structures of good environment writing, the concepts of scientific certainty and uncertainty, and communicating complex science to lay audiences. Issues covered include climate change, energy, air and water quality, and sustainability. Three lecture hours a week for one semester. Journalism 346F and 349T (Environmental Journalism) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 346G","name":"Domestic Issues and Global Perspective","description":"Restricted to journalism majors. Comparative reporting and covering social issues from global and intercultural perspectives. Proper positioning of the United States globally in terms of recession, food, health care, education, energy consumption, and climate change. Three lecture hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 347F","name":"Reporting Latin America","description":"Restricted to journalism majors. Foreign reporting and international news production processes, with special emphasis on Latin America. Three lecture hours a week for one semester. Only one of the following may be counted: Journalism 347F, 349T (Topic 4: International Reporting), 395 (Topic 4: Documentary Tradition of Latin America). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 347G","name":"Cultural Survey of Photography","description":"Restricted to journalism majors. Development of photojournalism and commercial, documentary, amateur, and art photography, including historical processes, the evolution of stylistic trends, and the careers of major photographers. Three lecture hours a week for one semester. Only one of the following may be counted: Journalism 347G, 362E, 387P. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each; and Communication 316 or Journalism 316 with a grade of at least C.","upper":true},{"key":"J 347S","name":"Magazine Management","description":"Study of the business of launching and maintaining successful publications. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Journalism 310F (or 320D) and 327 with a grade of at least C in each, and admission to a journalism area of concentration.","upper":true},{"key":"J 348D","name":"Gender and the News","description":"Restricted to Journalism majors. Historical and contemporary exploration of gender and the news. Examination of the role of marginalized gender groups in producing news and the construction of gender within news texts. Three lecture hours a week for one semester. Journalism 340C (Topic 5: Women and the News) and Journalism 342F may not both be counted. Fulfills the communication and culture requirement in the College of Communication. May be counted toward the cultural diversity flag requirement. Offered on the letter-grade basis only. Prerequisite: Upper-division standing, and Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 348F","name":"Covering the Latino Community in the United States","description":"Restricted to journalism majors. Challenging and developing views of the contemporary Latino community and other underrepresented people in the United States. Topics include a history of ethnic groups in the United States and their politics, education, organization, immigration, culture, power, and media. Three lecture hours a week for one semester. Journalism 348F and 349T (Topic 10: Covering the Latin Community in the United States) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 348G","name":"The Business of Sports Media","description":"Same as Advertising 348S and Public Relations 348S. Examination of the business of sports-related media, including over-the-air television, cable, satellite television, print, radio, social media, and internet-based media, and the impact of such media on sports presentation and development, professional franchises, colleges, and conferences. Emphasis on how the business of sports media generates revenue and content, and the business models for each type of media, the challenges to such models, and the likely future changes to them. Three lecture hours a week for one semester. Only one of the following may be counted: Advertising 348S, 378 (Topic: The Business of Sports Media), Communication 325 (Topic: The Business of Sports Media), Journalism 348G, 349T (Topic: The Business of Sports Media), Public Relations 348S, 378 (Topic: The Business of Sports Media). Prerequisite: Upper-division standing and a University grade point average of at least 2.25; additional prerequisite for journalism majors: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 348S","name":"Media Management","description":"Print and broadcast management and planning in operations, personnel, content, marketing, finance, technology, and regulation. Three lecture hours a week for one semester. Prerequisite: Admission to a journalism area of concentration.","upper":true},{"key":"J 349F","name":"Reporting Public Health and Science","description":"Restricted to journalism majors. Specialty reporting to help news consumers understand complex health and medicine issues. Considers the lack of critical perspective, balanced reporting, and grasp of fundamental issues that afflict much health reporting. Focuses on the latest reporting techniques and narrative skills to illuminate an intellectually demanding field that also includes public health policy. Three lecture hours a week for one semester. Journalism 349F and 349T (Topic: Reporting Public Health and Science) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 349G","name":"Sports Journalism","description":"Restricted to journalism majors. Contemporary professional skills and techniques in covering sports and athletics, including interviewing coaches and athletes, reporting, the business side of sports, ethical issues for sports journalists, and writing sidebars and color stories. Three lecture hours and three laboratory hours a week for one semester. Journalism 349G and 359T (Topic 1: Sports Journalism) may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 349T","name":"Topics in Understanding and Reporting Social Issues","description":"Restricted to journalism majors. Contemporary social, professional, and intellectual concerns in the practice of journalism. Three lecture hours a week for one semester. Some topics may require additional laboratory hours.  May be repeated for credit when the topics vary. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 350F","name":"Media Law","description":"Examination of legal rights and restrictions for online and print journalism, including Constitutional guarantees, libel, invasion of privacy, and contempt of court. Three lecture hours a week for one semester. Journalism 350F and 360 may not both be counted. Required for all journalism majors. Prerequisite: For journalism majors, Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 352F","name":"Ethics in Journalism","description":"Restricted to journalism majors. In-depth examination of the ethical choices individual journalists face and the ethical implications of how news media operate in a larger social and political framework. Three lecture hours a week for one semester. Only one of the following may be counted:  Journalism 352F, 349T (Topic 12: Ethics in Journalism), 395 (Topic 23: Ethics in Journalism). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 353F","name":"Historical Perspectives in Journalism","description":"Restricted to journalism majors. Evolution of journalism and mass media, including the social, economic, and political factors that have contributed to changes in news gathering and distribution. Three lecture hours a week for one semester. Journalism 353F and 366E may not both be counted. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 354F","name":"Journalism and Press Freedom in Latin America","description":"Restricted to journalism majors. Focus on journalism in Latin America with an emphasis on the struggle for democracy and press freedom in the region through country-by-country survey of historical, political, economic, cultural, ethnic and geographical aspects. Examination of the evolution of professional journalism in Latin America, including topics such as the legal framework for freedom of expression, ethical principles, concentration of media ownership and the emergence of digital media. Knowledge of Spanish language is recommended, but it is not a requirement. Three lecture hours a week for one semester. Only one of the following may be counted:  Journalism 354F, Journalism 367E, or Latin American Studies 322 (Topic 14). Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 360F","name":"Internship","description":"Restricted to journalism majors. Internships to be arranged by student and approved by instructor. Internship hours to be arranged. Journalism 331K and 360F may not both be counted. Offered on the pass/fail basis only. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"J 160G","name":"Journalism Practicum","description":"Restricted to journalism majors.  Internship hours to be arranged. Journalism 131P and 160G may not both be counted. May be repeated for credit, but only one hour may be counted toward the Bachelor of Journalism degree. Offered on the pass/fail basis only. Prerequisite: Communication 350 or Journalism 360F.","upper":true},{"key":"J 361F","name":"Reporting Texas","description":"Restricted to journalism majors. Students work as online reporters, photographers, and editors for the School of Journalism's Reporting Texas website. Three lecture hours and three laboratory hours a week for one semester. Journalism 361F and 359T (Topic: Reporting Texas) may not both be counted. Prerequisite: Six semester hours of upper-division coursework in journalism with a grade of at least B in each course.","upper":true},{"key":"J 362F","name":"Journalism Portfolio","description":"Restricted to journalism majors. A synthesis experience to polish journalism skills, showcase reporting and production abilities across multiple journalistic platforms, and complete a professional online portfolio. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Six semester hours of upper-division coursework in journalism with a grade of at least B in each course.","upper":true},{"key":"J 363","name":"Theories of Mass Communication","description":"Comparative survey of perspectives, research, and theories on communication through the mass media; theories on media effects and the construction of social reality, especially regarding the news media. Three lecture hours a week for one semester.","upper":true},{"key":"J 364E","name":"The Mass Media and Society","description":"Readings, lectures, films, guest speakers, and panel discussions on the function, role, and responsibility of the mass media in modern society. Three lecture hours a week for one semester. Prerequisite: Admission to a journalism area of concentration, or consent of instructor.","upper":true},{"key":"J 367E","name":"Journalism in Latin America","description":"Study of the practice of journalism in Latin America. Survey of the region, including historical, political, economic, cultural, ethnic, and geographical aspects. Three lecture hours a week for one semester. Journalism 367E and Latin American Studies 322 (Topic 14) may not both be counted. Prerequisite: Upper-division standing and a major in journalism, or consent of instructor.","upper":true},{"key":"J 370K","name":"Advanced Photojournalism","description":"Explores intensive photographic reportage and documentation using the camera as a tool of investigation and interaction. Emphasis on creation of photo stories, photo essays, and feature stories, with editing and page layout. Three lecture hours and four laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Journalism 355 with a grade of at least C, and acceptance into the photojournalism area of concentration; or consent of instructor.","upper":true},{"key":"J 371K","name":"Photographic Illustration","description":"Principles of studio lighting, theory and practice of contemporary color, location lighting, and the production of portfolio-quality work, as applied to advertising, photographic illustration, and photojournalism. Three lecture hours and four laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Journalism 355 with a grade of at least C, and acceptance into the photojournalism area of concentration; or consent of instructor.","upper":true},{"key":"J 373D","name":"Advanced News Reporting","description":"Study of community and institutional news sources; reporting on courts and city, county, and state governments; emphasis on fact-finding and skill in writing; in-depth reporting of significant events. Three lecture hours and six hours of laboratory reporting a week for one semester. Prerequisite: Journalism 310F (or 320D) with a grade of at least C, and admission to a journalism area of concentration.","upper":true},{"key":"J 375","name":"Magazine Editing and Publishing","description":"Restricted to journalism majors. Advanced magazine design and layout; critical analysis of the magazine in society. Three lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Journalism 375, 376D, 377D. Prerequisite: Journalism 330 and 319 (or 336) with a grade of at least C in each.","upper":true},{"key":"J 376D","name":"Newspaper Editing and Layout","description":"Restricted to journalism majors. Advanced newspaper typography, layout, and editing. Graphics techniques and production processes; planning content and format of newspapers; copydesk management. Three lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Journalism 375, 376D, 377D. Prerequisite: Journalism 330 and 319 (or 336) with a grade of at least C in each.","upper":true},{"key":"J 377D","name":"Print Design","description":"Advanced print design and layout. Graphics techniques and production processes; planning content and format of newspapers and magazines. Three lecture hours and two laboratory hours a week for one semester. Only one of the following may be counted: Journalism, 375, 376D, 377D. Prerequisite: Journalism 319 (or 336) with a grade of at least C, credit with a grade of at least C or registration for Journalism 330, and admission to a journalism area of concentration.","upper":true},{"key":"J 379","name":"Journalism Independent Study","description":"Restricted to journalism majors. Designed to give students the opportunity to pursue special studies for which separate courses have not been organized. The equivalent of nine laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each, and consent of the director of the school.","upper":true},{"key":"J 379H","name":"Honors Tutorial Course","description":"Restricted to journalism majors. Conference course of intensive study, planned by Journalism Honors Committee; research and the writing of a substantial paper on a special journalism topic. Individual instruction.  May be repeated for credit. Prerequisite: Admission to the Journalism Honors Program and consent of the director of the school.","upper":true},{"key":"J 379P","name":"Photojournalism Research Projects","description":"Restricted to journalism majors. Designed to give photojournalism students the opportunity to pursue special studies for which separate courses have not been organized. The equivalent of nine laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true}]