[{"key":"MAN 320F","name":"Foundations of Organizational Behavior and Administration","description":"Restricted to non-McCombs School of Business majors. An introduction to the management of organizations. Issues are addressed from the perspectives of strategy and planning, organizational behavior, and operations management. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Business Administration degree. Prerequisite: Upper-division standing.","upper":true},{"key":"MAN 325","name":"Strategic Human Resources Management","description":"Restricted to students in a business major. Overview of the personnel function, covering recruitment, compensation, equal employment, job analysis, training, benefits, employee discipline, collective bargaining, safety, and health. Three lecture hours a week for one semester. Prerequisite: Credit or registration for Management 336 or 336H.","upper":true},{"key":"MAN 328","name":"Consulting and Change Management","description":"Restricted to students in a business major. Designed to develop the fundamental change knowledge and consulting skills of students who plan to work with organizations as change agents, whether internally as managerial employees or externally as outside consultants. Three lecture hours a week for one semester. Prerequisite: Management 336 or 336H with a grade of at least C-.","upper":true},{"key":"MAN 336","name":"Organizational Behavior","description":"Restricted to students in a business major. The process of managing organizations and the behavior of individuals and groups within the organizational setting. Three lecture hours a week for one semester. Management 336 and 336H may not both be counted. Prerequisite: Credit or registration for Business Administration 324 or 324H; and credit or registration for three semester hours of coursework in anthropology, psychology, or sociology.","upper":true},{"key":"MAN 336H","name":"Organizational Behavior: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. An exploration of the process of managing organizations and the behavior of individuals and groups within the organizational setting. Three lecture hours a week for one semester. Management 336 and 336H may not both be counted. Prerequisite: Accounting 312H; credit or registration for Business Administration 324 or 324H; and thirty semester hours of coursework, including credit or registration for three semester hours of coursework in anthropology, psychology, or sociology.","upper":true},{"key":"MAN 337","name":"Special Topics in Management","description":"Analysis of contemporary management problems. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. Some sections are offered on the letter-grade basis only; these are identified in the Course Schedule. Management 337 and Operations Management 337 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"MAN 137C","name":"Introduction to Management in a Global Environment","description":"Restricted to students accepted to the Global Management Certificate program. Develops students' skills in recognizing cultural tendencies, both in themselves and in new geographic locations; introduces observation and reflection techniques to maximize learning while abroad. Course must be taken before participation in the international experience component required by the Global Management Certificate. One lecture hour a week for one semester. Only one of the following may be counted toward the Global Management Certificate: Applied Learning and Development 119, 219, 319, 419, 519, 619, 179, 279, Liberal Arts 119, 219, 319, 129, 229, 329, Management 137C, 337 (Topic: Intercultural Management), 379, 479, 579, 679. Offered on the letter-grade basis only.","upper":true},{"key":"MAN 237D","name":"Global Management Capstone","description":"Restricted to students accepted to the Global Management Certificate program. Develops students' ability to process and articulate learning from intercultural experience;  develops skills in applying knowledge and strategies gained in one region/country to new cultural and geopolitical contexts. Two lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Management 137C, completion of required international experience component of the Global Management Certificate, and consent of instructor.","upper":true},{"key":"MAN 353","name":"Internship in Management","description":"Restricted to students in a business major. Focuses on students' career goals through academic discussion and evaluations, while placing students in professional internships with public and private enterprises. Internship and discussion hours to be arranged. Only one of the following may be counted toward the Bachelor of Business Administration: Accounting 353J, Business Administration 353, 353H, Finance 353, Management 353, Management Information Systems 353, Marketing 353, Operations Management 353. May not be counted toward the student's major requirement. Offered on the pass/fail basis only. Prerequisite: Completion of forty-five semester hours of college coursework and consent of the departmental internship coordinator.","upper":true},{"key":"MAN 374","name":"General Management and Strategy","description":"Restricted to students in a McCombs School of Business major. Designed to enable students to analyze business situations from the point of view of the practicing general manager. Addresses key tasks involved in general management, including strategic decisions that ensure the long-term health of the entire firm or a major division. Three lecture hours a week for one semester. Management 374 and 374H may not both be counted. Prerequisite: Upper-division standing; seventy-five semester hours of coursework, including: Management 336 or 336H; credit or registration for Finance 357 or 357H, and Marketing 337 or 337H; and credit or registration for one of the following: Accounting 353J, 366P, Business Administration 353, 353H, Finance 353, 366P, Management 353 (or 366P), Management Information Systems 353, 366P, Marketing 353, 366P, Operations Management 353, or 366P.","upper":true},{"key":"MAN 374H","name":"General Management and Strategy: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Designed to enable students to analyze business situations from the point of view of the practicing general manager. Addresses key tasks involved in general management, including strategic decisions that ensure the long-term health of the entire firm or a major division. Three lecture hours a week for one semester. Management 374 and 374H may not both be counted. Prerequisite: Upper-division standing; ninety semester hours of college coursework; Finance 357 or 357H; Management 336 or 336H; Marketing 337 or 337H; and credit or registration for one of the following: Accounting 353J, 366P, Business Administration 353, 353H, Finance 353, 366P, Management 353 (or 366P), Management Information Systems 353, or 366P.","upper":true}]