[{"key":"F A 301C","name":"Freshman Seminar","description":"Restricted to first-semester freshmen. Small-group seminar involving reading, discussion, writing, and oral reports. Introduction to University resources, including libraries, computer and research facilities, and museums. Several sections are offered each semester, with various topics and instructors. Two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"F A 308","name":"Arts Integrations for Multidisciplinary Connections","description":"Through readings, videos, in-class activities, discussion, field trips, micro-teaching, and written reflection, designed to develop a practical understanding of the techniques and skills associated with integrating the arts into various contexts. Provides experience in each art content area (dance, music, theatre arts, and visual arts) to develop an introductory understanding of each of these disciplines. Three lecture hours a week for one semester.  Offered on the letter-grade basis only.","upper":false},{"key":"F A 311","name":"Meanings in Visual Culture and Film","description":"An examination of how meaning is assigned to objects and images in the world of visual culture. Three lecture hours a week for one semester.","upper":false},{"key":"F A 312","name":"Aesthetics of Game Design","description":"Introduction to the design and aesthetics of games. Explores the meaning of playing games, the aesthetics of play and games, and the role of game design as both the creation of designed artifacts and sociocultural texts. Three lecture hours a week for one semester. Fine Arts 310 (Topic: Aesthetics of Game Design) and 312 may not both be counted.","upper":false},{"key":"F A 320","name":"Exploring the Fine Arts","description":"Open to all University students except those in the College of Fine Arts. An interdisciplinary introduction to the fine arts: their basic concepts, meaning, aesthetics, and role in society. Three lecture hours a week for one semester, with field trips as required. May not be counted toward a degree in the College of Fine Arts. Prerequisite: Upper-division standing or consent of instructor.","upper":true},{"key":"F A 330","name":"Film As Art","description":"A historical survey of the evolution of motion pictures from the invention of cinema in 1895 to the recent past and of works by artists in the film medium. Three lecture hours a week for one semester. Fine Arts 330 and Visual Art Studies 379S (Topic: Film as Art) may not both be counted.","upper":true},{"key":"F A 331","name":"Films of Alienation: 1966-1976","description":"An examination of a ten-year period of international film focusing on psychological issues of alienation and angst. Three lecture hours a week for one semester. Fine Arts 331 and Visual Art Studies 379S (Topic: Alienation, Angst, and Anomie: 1966-1976) may not both be counted.","upper":true},{"key":"F A 332","name":"Fifty Years of Nonfiction Films: 1962-2012","description":"A survey of documentary films that were made to reflect a variety of approaches to the nonfiction genre during the years 1962-2012. Three lecture hours a week for one semester. Fine Arts 332 and Visual Art Studies 379S (Topic: Fifty Years of Non-Fiction, 1960-2010) may not both be counted.","upper":true},{"key":"F A 333","name":"Fifty Years of Revisionist Westerns","description":"An examination of the revisionist response to the classic film genre featuring the American West. Three lecture hours a week for one semester. Fine Arts 333 and Visual Art Studies 379S (Topic: Revisionist Westerns 1962-2012) may not both be counted.","upper":true},{"key":"F A 334","name":"Films Projecting the Future","description":"A survey of motion pictures that disclose the evolving notion of the future in cinematic form. Three lecture hours a week for one semester.","upper":true},{"key":"F A 361","name":"Digital Production Art 3-D","description":"Restricted to computer science, fine arts, or radio-television-film majors. In-depth study and practice of 3-D modeling, surfacing, lighting, rendering, animation, compositing, and visual FX using Autodesk Maya, Adobe Photoshop, and other programs. Knowledge of Photoshop or equivalent, and laptop computer for classroom use is recommended. Three lecture hours a week for one semester. Fine Arts 360 (Topic: Digital Production Art 3D) and 361 may not both be counted. Prerequisite: Upper-division standing or consent of instructor.","upper":true}]