[{"key":"ACC 310F","name":"Foundations of Accounting","description":"Restricted to non-McCombs School of Business majors. An introduction to financial and managerial accounting, with emphasis on the content, interpretation, and uses of accounting reports. Discussion of the determination and reporting of net income and financial position, and the theories underlying business financial statements; consideration of managerial accounting topics designed to extend the student's knowledge to the planning and controlling of the operations of the firm. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Business Administration degree.","upper":false},{"key":"ACC 311 (TCCN: ACCT 2301)","name":"Fundamentals of Financial Accounting","description":"Restricted to students in the McCombs School of Business. Concepts and their application in transaction analysis and financial statement preparation; analysis of financial statements. Three lecture hours a week for one semester. Accounting 311 and 311H may not both be counted. Prerequisite: Twenty-four semester hours of college credit.","upper":false},{"key":"ACC 311H","name":"Fundamentals of Financial Accounting: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. An exploration of concepts and their application in transaction analysis and financial statement preparation; and analysis of financial statements. Three lecture hours a week for one semester. Accounting 311 and 311H may not both be counted. Prerequisite: Twenty-four semester hours of college credit, Management Information Systems 301 or its equivalent, and credit or registration for Business Administration 324 or 324H.","upper":false},{"key":"ACC 312 (TCCN: ACCT 2302)","name":"Fundamentals of Managerial Accounting","description":"Restricted to students in the McCombs School of Business. Introduction to cost behavior, budgeting, responsibility accounting, cost control, and product costing. Three lecture hours a week for one semester. Accounting 312 and 312H may not both be counted. Prerequisite: Accounting 311 or 311H.","upper":false},{"key":"ACC 312H","name":"Fundamentals of Managerial Accounting: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Introduction to cost behavior, budgeting, responsibility accounting, cost control, and product costing. Three lecture hours a week for one semester. Accounting 312 and 312H may not both be counted. Prerequisite: Accounting 311 or 311H, and credit or registration for Business Administration 151H.","upper":false},{"key":"ACC 326","name":"Financial Accounting--Intermediate","description":"Restricted to students in a business major. Theoretical foundation, concepts, and principles underlying financial statements; current assets; current liabilities; property, plant, and equipment; short-term investments; present value analysis. Three lecture hours a week for one semester. Accounting 326 and 380K (Topic 1: Financial Accounting Standards and Analysis I) may not both be counted. Offered on the letter-grade basis only. Prerequisite: Accounting 311 or 311H, and 312 or 312H, with a grade of at least C- in each.","upper":true},{"key":"ACC 327","name":"Financial Statement Analysis","description":"Restricted to students in a business major. Study of financial statements and their related footnotes; tools and procedures common to financial statement analysis; the relationships among business transactions, environmental forces (political, economic, and social), and reported financial information; and how financial statement information can help solve certain business problems. Three lecture hours a week for one semester. Accounting 327 and 380K (Topic 7: Financial Statement Analysis) may not both be counted. Prerequisite: Accounting 326 with a grade of at least C-.","upper":true},{"key":"ACC 329","name":"Managerial Accounting and Control","description":"Restricted to students in a business major. The origination, processing, reporting, and use in business operations of accounting information for management purposes. Three lecture hours a week for one semester. Only one of the following may be counted: Business Administration 382T, Accounting 329, 359, 387 (Topic 1), 287 (Topic 5). Prerequisite: Accounting 311 or 311H, and 312 or 312H, with a grade of at least C- in each.","upper":true},{"key":"ACC 151","name":"Accounting Careers Exploration","description":"Restricted to students admitted to the integrated approach to the Master in Professional Accounting. Presentations by professional accountants and managers. One and one-half lecture hours a week for one semester.  Offered on the letter-grade basis only.","upper":true},{"key":"ACC 152","name":"MPA Distinguished Speaker Lyceum","description":"Restricted to students admitted to the integrated approach to the Master in Professional Accounting. Discussion of current issues confronting the accounting profession. The equivalent of two lecture hours a week for one semester.  Offered on the pass/fail basis only.","upper":true},{"key":"ACC 353J","name":"Internship in Accounting","description":"Restricted to students in a business major. Focuses on students' career goals through academic discussion and evaluations, while placing students in professional internships with public and private enterprises. Internship and discussion hours to be arranged. Only one of the following may be counted toward the Bachelor of Business Administration: Accounting 353J, Business Administration 353, 353H, Finance 353, Management 353, Management Information Systems 353, Marketing 353, Operations Management 353. May not be counted toward the student's major requirement. Offered on the pass/fail basis only. Prerequisite: Completion of forty-five semester hours of college coursework and consent of the departmental internship coordinator.","upper":true},{"key":"ACC 355","name":"Introduction to Taxation","description":"Restricted to students admitted to the integrated approach to the Master in Professional Accounting. The role of taxes in contemporary society and their impact on individuals and business. Three lecture hours a week for one semester.   Only one of the following may be counted: Accounting 355, 364, 380K (Topic 11: Introduction to Taxation). Offered on the letter-grade basis only.","upper":true},{"key":"ACC 356","name":"Financial Accounting Concepts and Research","description":"Restricted to students admitted to the integrated approach to the Master in Professional Accounting. Conceptual framework of financial accounting; research methods in financial reporting; and financial reporting institutions and regulations. Three lecture hours a week for one semester.  Offered on the letter-grade basis only.","upper":true},{"key":"ACC 358C","name":"Auditing and Other Assurance Services","description":"Restricted to students admitted to the integrated approach to the Master in Professional Accounting. Information quality assurance, auditing, and control, considered from the perspective of a business manager who must decide the type and amount of assurance to acquire. Three lecture hours a week for one semester. Only one of the following may be counted: Accounting 358C, 362, 380K (Topic 4). Offered on the letter-grade basis only. Prerequisite: Accounting 356 or the equivalent.","upper":true},{"key":"ACC 359","name":"Managerial/Cost Accounting","description":"Restricted to students admitted to the integrated approach to the Master in Professional Accounting. Analysis of manufacturing costs, development of cost estimates, and preparation of relevant information for management decision making. Three lecture hours a week for one semester. Only one of the following may be counted: Accounting 329, 359, 287 (Topic 5), 287 (Topic 1), 387 (Topic 1), 387 (Topic 5), Business Administration 382T. Offered on the letter-grade basis only.","upper":true},{"key":"ACC 362","name":"Auditing and Control","description":"Restricted to students in a McCombs School of Business major. Professional practice standards and procedures of auditing: ethics, legal liability, sampling methods, control systems, control design, and control evaluation. Three lecture hours a week for one semester. Only one of the following may be counted: Accounting 358C, 362, 380K (Topic 4: Introduction to Auditing). Prerequisite: Accounting 311 or 311H, and 312 or 312H, with a grade of at least C- in each.","upper":true},{"key":"ACC 364","name":"Fundamentals of Taxation","description":"Restricted to students in a business major. Introduction to the role of taxes in contemporary society and their impact on individuals and business entities; emphasis on federal income taxation. Three lecture hours a week for one semester. Only one of the following may be counted: Accounting 355, 364, 380K (Topic 11: Introduction to Taxation). Prerequisite: Accounting 311 or 311H, and 312 or 312H, with a grade of at least C- in each.","upper":true},{"key":"ACC 366P","name":"Accounting Practicum","description":"Restricted to business majors. Students apply skills in their major area and focus on additional project management skills through group projects conducted in a professional setting. Students may work with a private or a public enterprise. The equivalent of three lecture hours a week for one semester. Accounting 366P and 384 (Topic: Tax Practicum) may not both be counted. Prerequisite: Forty-five semester hours of college coursework.","upper":true},{"key":"ACC 378","name":"Contemporary Accounting Topics","description":"Restricted to students in a business major. In-depth study of selected accounting topics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Offered on the letter-grade basis only. Prerequisite: Accounting 311 or 311H, and 312 or 312H, with a grade of at least C- in each. Some topics have additional prerequisites; these are given in the Course Schedule.","upper":true}]