[{"key":"LAH 103H","name":"The Ideas of Civic Engagement","description":"Restricted to students in the Liberal Arts Honors Program in the College of Liberal Arts. Introduces Liberal Arts Honors students to the resources of the University, their history, and how to make best use of them. Provides guidance on internships, scholarships, and career paths, encouraging students to prepare for a lifetime of civic engagement and public service. One lecture hour a week for a semester; additional hours may be required. Humanities 116 and Liberal Arts Honors 103H may not both be counted. Offered on the pass/fail basis only. Prerequisite: Liberal Arts Honors 102H.","upper":false},{"key":"LAH 305","name":"Liberal Arts Freshman Honors Seminar","description":"Restricted to students in the Freshman Honors Program in the College of Liberal Arts. Intensive small class lecture or seminar course addressing basic issues in various liberal arts disciplines. Lectures, readings, discussions, examinations. Three lecture hours a week for one semester. Humanities 305 and Liberal Arts Honors 305 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Offered on the letter-grade basis only.","upper":false},{"key":"LAH 112H","name":"The Nature of Inquiry","description":"Designed for students who plan to enter a liberal arts departmental honors program. Introduction to the nature of research in liberal arts disciplines. One and one-half class hours a week for one semester. Prerequisite: Forty-five semester hours of coursework and consent of the liberal arts honors director.","upper":false},{"key":"LAH 316","name":"Studies in the Liberal Arts","description":"Restricted to Plan I majors in the College of Liberal Arts. Intensive lecture or seminar course addressing topics in various liberal arts disciplines. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Offered on the letter-grade basis only.","upper":false},{"key":"LAH 318Q","name":"Supervised Research","description":"Individual instruction. Prerequisite: Consent of the liberal arts honors program adviser.","upper":false},{"key":"LAH 350","name":"Topics in the Liberal Arts","description":"Restricted to Plan I majors in the College of Liberal Arts. Intensive lecture course treating topics from a variety of disciplinary perspectives, taught by instructors from various departments. Lectures, readings, discussions, examinations. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 358Q","name":"Supervised Research","description":"Individual instruction. May be repeated for credit, but no more than six semester hours may be counted toward College Honors. Prerequisite: A University grade point average of at least 3.50 and consent of the liberal arts honors program adviser.","upper":true},{"key":"LAH 364H","name":"The Enlightenment","description":"Restricted to Plan I majors in the College of Liberal Arts. Examination of the European Enlightenment, an intellectual movement centered in eighteenth-century France and England that cut across all disciplines and arts and that looked back to the Renaissance and forward to the modern world. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 365H","name":"Great Books in Political Philosophy","description":"Restricted to Plan I majors in the College of Liberal Arts. An investigation of what it means to think \"philosophically\" about politics and morals, by reading and interpreting primary sources of political philosophy from more than twenty centuries. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 368H","name":"Literature of the Hispanic World","description":"Restricted to Plan I majors in the College of Liberal Arts. An examination of the literature and culture of Spain and Spanish America, from the Middle Ages to the present. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 369H","name":"Comparative Legal Systems","description":"Restricted to Plan I majors in the College of Liberal Arts. A comparison of legal traditions from Europe, English common law, and Asia. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 371H","name":"Classics of Greek Philosophy","description":"Restricted to Plan I majors in the College of Liberal Arts. A close reading of major works in the philosophy of Plato and Aristotle, supported by background reading in the history and literature of ancient Greece. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 373H","name":"Literature of the Western World: Continuities","description":"Restricted to Plan I majors in the College of Liberal Arts. Tradition and innovation of form and thought in literature from Homer to the twentieth century. Three lecture hours and one discussion hour a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 376H","name":"The Rise of Modern America","description":"Restricted to Plan I majors in the College of Liberal Arts. The end of Reconstruction (1877) to the end of the war in Vietnam (1975)--industrialization, urbanization, immigration, nuclear energy, and global reach. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 377H","name":"Ideas of the Twentieth Century","description":"Restricted to Plan I majors in the College of Liberal Arts. Central philosophical controversies of the twentieth century: ethics, politics, comparative religions, science and human nature. Three lecture hours and one discussion hour a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 378H","name":"The Natural Sciences in the Liberal Arts Context","description":"Restricted to Plan I majors in the College of Liberal Arts. An attempt to understand contemporary developments in science by focusing on the history and philosophy of science. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 379H","name":"Classical Asian Civilizations","description":"Restricted to Plan I majors in the College of Liberal Arts. An examination of the contributions of India and China to intellectual history. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing and a grade point average of at least 3.50.","upper":true},{"key":"LAH 679T","name":"Honors Thesis","description":"Restricted to Plan I majors in the College of Liberal Arts. Supervised research, reading, and writing of a substantial paper on an interdepartmental subject. Conference course for two semesters.  Offered on the letter-grade basis only. Prerequisite: For Liberal Arts Honors 679TA, upper-division standing, a grade point average of at least 3.50, and written consent of the director of the Liberal Arts Honors Program; for 679TB, Liberal Arts Honors 679TA.","upper":true}]