[{"key":"COM 301C","name":"Freshman Seminar","description":"Restricted to first-semester freshmen. Small-group seminar involving reading, discussion, writing, and oral reports. Introduction to University resources, including libraries, computer and research facilities, and museums. Several sections are offered each semester, with various topics and instructors. Two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"COM 309","name":"Communication Technology and Society","description":"Same as Radio-Television-Film 309. Study of communication technologies, from writing to the Internet; their uses in interpersonal, group, mass, and international contexts; and the impact of technologies on work. Three lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"COM 310","name":"Topics in Texas Sports and Media","description":"Introduction to various contemporary and historical issues, emphasizing interdisciplinary perspectives and critical discourse. Three lecture hours a week for one semester. Communication 310 and Journalism 313S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":false},{"key":"COM 314","name":"Special Topics in Communication","description":"Contemporary issues and practices in communication. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"COM 316 (TCCN: COMM 1316)","name":"Photographic Communication","description":"Introduction to photographic technique and recent trends, evaluation, visual design, and use of images in the media. Students must provide their own 35-mm single-lens reflex or digital camera that can be operated under manual mode and with off-camera flash. Three lecture hours and one and one-half laboratory hours a week for one semester. Communication 316 and Journalism 316 may not both be counted.","upper":false},{"key":"COM 320","name":"Advanced Topics in Texas Sports and Media","description":"Critical assessment of various contemporary and historical issues, emphasizing interdisciplinary perspectives. Three lecture hours a week for one semester. Communication 320 and Journalism 326S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Completion of at least sixty semester hours of coursework and a University grade point average of at least 2.25.","upper":true},{"key":"COM 324","name":"Topics and Skills in Communication","description":"Contemporary issues, practices, and skills related to communication and the entertainment industries, including studies in the business of entertainment, the creative process, and contemporary Hollywood cinema. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, three hours of lower-division coursework in radio-television-film, admission to the Semester in Los Angeles program, and a University grade point average of at least 2.25.","upper":true},{"key":"COM 325S","name":"Issues in Sports Media","description":"Special topics in the role and convergence of sports and the media. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"COM 330","name":"Research in Texas Sports and Media","description":"Same as Journalism 339S. Restricted to journalism majors. Supervised research with a faculty member; research may consist of an individual project or assisting a faculty research project. Hours to be arranged.  May be repeated for credit. Prerequisite: Upper-division standing and a University grade point average of at least 2.25; and Journalism 310F (or 320D) and 311F (or 321C) with a grade of at least B- in each.","upper":true},{"key":"COM 350","name":"Communication Internship","description":"Restricted to students in the College of Communication. Practical work experience related to the student's area of interest in the communication field. An average of 10 hours of work a week, for a total of at least 150 hours a semester or summer term. May not be taken by students who have credit for any three-semester-hour communication internship course. Offered on the pass/fail basis only. Prerequisite: Completion of the prerequisite for the three-semester-hour internship course in the student's major department.","upper":true},{"key":"COM 350L","name":"Semester in Los Angeles Internship","description":"Practical work experience in the entertainment industry in Los Angeles. An average of 10 hours of work a week, for a total of at least 150 hours a semester or summer term.  Offered on the pass/fail basis only. Prerequisite: Upper-division standing, three hours of lower-division coursework in radio-television-film, admission to the Semester in Los Angeles program, and a University grade point average of at least 2.25.","upper":true},{"key":"COM 360","name":"Communication Research Design","description":"An introduction to sampling, measurement, data collection, and analytic procedures as applied to research problems in communication. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"COM 370","name":"Advanced Study in Communication","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, admission to the College of Communication Senior Fellows Program, and consent of instructor.","upper":true},{"key":"COM 178","name":"Communication Internship","description":"Restricted to students in the College of Communication. Practical work experience related to the student's area of interest in the communication field. An average of 10 hours of work a week, for a total of at least 150 hours a semester or summer term. May be repeated, but only one hour may be counted toward a degree in the College of Communication. Offered on the pass/fail basis only. Prerequisite: Completion of a three-hour internship course in the College of Communication.","upper":true}]