[{"key":"ANT 301 (TCCN: ANTH 2301)","name":"Physical Anthropology","description":"Human evolution, race, heredity, the organic basis of culture; culture history through the Paleolithic stage. The equivalent of three lecture hours a week for one semester.","upper":false},{"key":"ANT 302 (TCCN: ANTH 2351)","name":"Cultural Anthropology","description":"The concept of culture; social and political organization; language; the supernatural; elementary cultural theory. Three lecture hours a week or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"ANT 304 (TCCN: ANTH 2302)","name":"Introduction to Archaeological Studies: Prehistoric Archaeology","description":"Anthropological study of prehistory, from human beginnings to the appearance of written records. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Anthropology 304 and Archaeology 301 may not both be counted.","upper":false},{"key":"ANT 304T","name":"Introduction to Texas Archaeology","description":"Introduces students to Texas archaeology through lectures, interactive virtual labs, and hands-on laboratory sections that emphasize experimentation. The equivalent of three lecture hours or two lecture hours and two laboratory hours a week for one semester.","upper":false},{"key":"ANT 305","name":"Expressive Culture","description":"How cultural assumptions affect how we tell and respond to different kinds of stories, including fairy tales, movies, and televised news. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"ANT 307","name":"Culture and Communication","description":"Same as Linguistics 312C. An introduction to the study of culture through communication and the theory of signs. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Anthropology 307, Linguistics 312 (Topic: Culture and Communication), 312C.","upper":false},{"key":"ANT 310D","name":"Introduction to Black Studies","description":"Same as African and African Diaspora Studies 303. Introduction to canonical black studies literature, themes, and theories. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 303, Anthropology 310D, 310L (Topic: Intro to African and African Diaspora Studies).","upper":false},{"key":"ANT 310L","name":"Introductory Topics in Anthropology","description":"Three lecture hours or two lecture hours and one discussion hour a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"ANT 314C","name":"Introduction to Mesoamerican Archaeology","description":"Same as Latin American Studies 315 (Topic 2). Introduction to ancient Mesoamerica from the time of emerging social inequality in the formative period until the Spanish conquest of Mexico-Tenochtitlan in the sixteenth century. Only one of the following may be counted: Anthropology 310L (Topic 1: Introduction to Mesoamerican Archaeology), 314C, Latin American Studies 310 (Topic 3: Introduction to Mesoamerican Archaeology), 315 (Topic 2).","upper":false},{"key":"ANT 318L","name":"Mexican American Culture","description":"Same as Mexican American Studies 318. Mexican American cultural distinctiveness in the areas of social organization, child rearing, food culture, folklore, language, and religion. Three lecture hours a week for one semester.","upper":false},{"key":"ANT 322K","name":"Southwestern Archaeology","description":"Prehistory of New Mexico, Arizona, Utah, and neighboring areas, from the earliest human occupation to the Spanish conquest. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 322M","name":"Topics in Cultures of the World","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"ANT 324L","name":"Topics in Anthropology","description":"Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"ANT 325J","name":"The Photographic Image","description":"Applies concepts and practices from visual ethnography to the study of memory, place, and everyday life. Subjects include developing counterintuitive and subversive approaches to practices of looking and techniques of representation. Two lecture hours and two lab hours a week for one semester. Anthropology 325L (Topic: The Photographic Image) and 325J may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 325M","name":"Language in Culture and Society","description":"Same as Linguistics 373 (Topic 3: Language in Culture and Society) and Sociology 352M (Topic 4: Language in Culture and Society). Language as a cultural resource; functions of language in society; survey of language communities. Three lecture hours a week for one semester. Prerequisite: Anthropology 302, 305, 307, or Linguistics 306; or consent of instructor.","upper":true},{"key":"ANT 325N","name":"Language and Speech in American Society","description":"Same as American Studies 321 (Topic 2: Language and Speech in American Society), Linguistics 373 (Topic 2: Language and Speech in American Society), and Sociology 352M (Topic 3: Language and Speech in American Society).  Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and Anthropology 302, 305, 307, or Linguistics 306.","upper":true},{"key":"ANT 326C","name":"Native Americans in Texas","description":"Same as American Studies 321G. Studies the history of Native Americans in Texas using concepts and evidence from anthropology, history, archaeology, historical geography, and Native American studies. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 321 (Topic: Native Americans in Texas), Anthropology 324L (Topic: Native Americans in Texas), 326C. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 326D","name":"Native Americans in the Plains","description":"The ethnohistory of some of the most influential Native American groups on the plains, from the arrival of the Spanish through the reservation period. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 321 (Topic: Native Americans in the Plains), Anthropology 324L (Topic: Native Americans in the Plains), 326D, History 365G (Topic: Native Americans in the Plains. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 326E","name":"Plains Archaeology: Prehistory and History","description":"Explores the evidence of human activities on the central and southern plains from prehistoric to historical times (ca. 11,000 BC to ca. AD 1850). Three lecture hours a week for one semester. Anthropology 324L (Topic: Plains Archaeology: Prehistory and History) and 326E may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 326F","name":"Great Discoveries in Archaeology","description":"Same as European Studies 346 (Topic 2: Great Discoveries in Archaeology). The stories, myths, and people behind some of the great archaeological discoveries. Three lecture hours a week for one semester. Only one of the following may be counted: Anthropology 324L (Topic: Great Discoveries in Archaeology), Anthropology 326F, European Studies 346 (Topic 2). Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 326L","name":"Cultures in Contact","description":"History of the interactions of the indigenous peoples of the Americas with Africans, Asians, and Europeans over the past five hundred years. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 327C","name":"Topics in American Cultures","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 327D","name":"Colonial Latin American Archaeology","description":"Same as Latin American Studies 324L (Topic 13: Colonial Latin American Archaeology). Focuses on the Spanish colonies in Latin America. Three lecture hours a week for one semester. Only one of the following may be counted: Anthropology 324L (Topic: Colonial Latin American Archaeology), 327D, Latin American Studies 324L (Topic 13).","upper":true},{"key":"ANT 330C","name":"Theories of Culture and Society","description":"Examination of the theoretical approaches that have established the intellectual foundations of contemporary sociocultural anthropology. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 432L","name":"Primate Anatomy","description":"Comparative and functional anatomy of primates, including humans; emphasis on adaptations and evolution of the various taxa. Three lecture hours and two laboratory hours a week for one semester. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 334L","name":"North American Archaeology","description":"Regional cultural development of Native American societies from the earliest human occupations to the historic period. Three lecture hours a week for one semester. Prerequisite: Upper-division standing or consent of instructor.","upper":true},{"key":"ANT 336L","name":"Native American Cultures North of Mexico","description":"Same as American Studies 321 (Topic 3: Native American Cultures North of Mexico).  Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 340C","name":"Ethnographic Research Methods","description":"Introduction to methods used in conducting ethnographic research; emphasis on research design, analysis, writing, and ethical considerations. Three lecture hours a week for one semester. Prerequisite: Anthropology 302, 305, or 307.","upper":true},{"key":"ANT 344K","name":"Films: An Anthropological Perspective","description":"Films viewed and discussed. How is cultural meaning communicated? What systems of signification are involved? What are possibilities and limitations of ethnographic films? Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 345C","name":"Urban Cultures","description":"The culture of cities, including the distinctive forms of expressive culture, ethnic and racial conflict, and political or economic activity that cities generate. Three lecture hours a week or two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 346L","name":"Primate Social Behavior","description":"Studies primate behavior and why primates do what they do, including basic theoretical principles and the models used to explain primate behavior. Three lecture hours a week for one semester. Anthropology 346L and 348K (Topic 6: Primate Social Behavior) may not both be counted. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 346M","name":"Comparative Primate Ecology","description":"The basics of how organisms interact with their environment, focusing on a wide range of primates from a comparative perspective. Discusses how various aspects of ecology are used to conserve primate populations. Three lecture hours a week for one semester. Anthropology 346M and 348K (Topic 7: Comparative Primate Ecology) may not both be counted. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 347C","name":"Methods in Primate Biology","description":"The study of primate behavior and the methods by which animal behavior is observed and documented. Students conduct a research project and write a report. One lecture hour and three laboratory hours a week for one semester. Prerequisite: Anthropology 346L , 346M , or Biology 359K with a grade of at least C.","upper":true},{"key":"ANT 348","name":"Human Origins and Evolution","description":"Detailed examination and analysis of morphological trends evident in the hominid fossil record. Two lecture hours and two laboratory hours a week for one semester. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 348K","name":"Current Topics in Physical Anthropology","description":"An in-depth study of current topics, controversies, and literature on the evolution, morphology, genetics, and behavioral ecology of primates, including humans. Three lecture hours a week for one semester; additional hours may be required for some topics.  May be repeated for credit when the topics vary. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 349C","name":"Human Variation","description":"The patterns of biological variation within and between human populations.  Examines physical, genetic, and behavioral traits, and considers both the microevolutionary and cultural processes that influence those traits. Three lecture hours a week for one semester. Anthropology 348K (Topic: Human Variation) and 349C may not both be counted. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 349D","name":"Anthropological Genetics","description":"Basic principles of molecular genetics and population genetics as they relate to the study of humans and other primates. Three lecture hours a week for one semester. Anthropology 348K (Topic: Anthropological Genetics) and 349D may not both be counted. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 350C","name":"Primate Sensory Ecology","description":"An integrated perspective on the comparative anatomy, physiology, and ecological significance of sensory adaptations in primates. Three lecture hours a week for one semester. Anthropology 348K (Topic 5: Primate Sensory Ecology) and 350C may not both be counted. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 350M","name":"Evolution of Primate Behavior","description":"Mechanisms underlying the evolution of human and nonhuman primate behavior. The reasons and ways primates live in social groups; comparisons between human and nonhuman primates using living primates, fossil remains, and archaeological evidence. Three lecture hours a week for one semester. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 351E","name":"Primate Evolution","description":"Examination of the fossil record for nonhuman primate evolution, including basic concepts of the anatomy, ecology, and systematics of living primates. Three lecture hours a week for one semester. Anthropology 348K (Topic 4: Primate Evolution) and 351E may not both be counted. Prerequisite: Anthropology 301.","upper":true},{"key":"ANT 453","name":"Archaeological Analysis","description":"Derivation of chronology and cultural information from archaeological data; the role of archaeology in modern life. Four lecture hours a week for one semester. Prerequisite: Anthropology 304 or Archaeology 301.","upper":true},{"key":"ANT 353E","name":"Archaeological Laboratory Analysis","description":"The analysis of artifacts, features, architecture, and other remains recovered in the field. Four and one-half laboratory hours a week for one semester. Anthropology 324L (Topic: Archaeological Laboratory Analysis) and 353E may not both be counted. Prerequisite: Anthropology 662.","upper":true},{"key":"ANT 358Q","name":"Supervised Research","description":"Individual instruction. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 360K","name":"The Civilization of the Maya","description":"Same as Latin American Studies 324L (Topic 10: The Civilization of the Maya). Maya prehistory and history: the archaeological record, codices and inscriptions, and Spanish conquest writings. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 361K","name":"The Civilizations of Ancient Mexico","description":"Same as Latin American Studies 324L (Topic 11: The Civilizations of Ancient Mexico). Mexican cultures from earliest prehistory to the European conquest. Three lecture hours a week for one semester. Prerequisite: Anthropology 302 and six semester hours of upper-division coursework in social science.","upper":true},{"key":"ANT 662","name":"Field Archaeology","description":"Two hundred and forty hours of fieldwork. May be repeated for credit, but may be taken only once on the letter-grade basis. May be repeated for credit.","upper":true},{"key":"ANT 362K","name":"Archaeology of Texas and Vicinity","description":"Cultural history of Texas and neighboring areas, from early prehistoric times to Anglo-American settlements. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANT 462M","name":"Archaeological Techniques","description":"Problems in planning, organizing, and carrying out archaeological surveys and excavations. Four lecture hours a week for one semester. Prerequisite: Anthropology 453.","upper":true},{"key":"ANT 366","name":"Anatomy and Biology of the Human Skeleton","description":"Comprehensive study of the human skeleton, with special attention to methods of identification. One lecture hour and four laboratory hours a week for one semester. Prerequisite: Upper-division standing and Anthropology 301.","upper":true},{"key":"ANT 374M","name":"Sociolinguistics","description":"Same as Linguistics 374M. An in-depth treatment of current interests in sociolinguistic research literature. Subjects include language and gender; social, regional, and ethnic dialects of American English; language use in African American communities; language and identity in a pluralistic society; and language, literacy, and education. Three lecture hours a week for one semester. Prerequisite: Anthropology 302 or Linguistics 306.","upper":true},{"key":"ANT 379","name":"Problems in Anthropology","description":"Supervised individual research on selected problems in anthropology. Three lecture hours a week for one semester.  May be repeated for credit. Prerequisite: Six semester hours of upper-division coursework in anthropology and consent of instructor.","upper":true},{"key":"ANT 679H","name":"Honors Tutorial Course","description":"For honors candidates in anthropology. Individual reading of selected works for one semester, followed in the second semester by the writing of an honors thesis. Conference course for two semesters. Prerequisite: For 679HA, admission to the Anthropology Honors Program; for 679HB, Anthropology 679HA.","upper":true}]