[{"key":"ECO 301","name":"Introduction to Economics","description":"Explores how economists describe and measure the economy in the aggregate and in specific markets, such as the labor market, the housing market, financial markets, and international trade. Studies concepts for measurement and data, as well as methods, approaches, and technologies used in social and behavioral science. Three lecture hours a week for one semester. May not be counted toward a major in economics.","upper":false},{"key":"ECO 304K (TCCN: ECON 2302)","name":"Introduction to Microeconomics","description":"Analysis of the economic behavior of individual consumers, firms, and workers; special attention to the role of markets. Three lecture hours a week for one semester. Some sections require an additional discussion hour a week.","upper":false},{"key":"ECO 304L (TCCN: ECON 2301)","name":"Introduction to Macroeconomics","description":"Analysis of the economy as a whole (its organization and the basic forces influencing its growth and development); money and banking, national income, public finance, and international linkages. Three lecture hours a week for one semester. Some sections require an additional discussion hour a week. Prerequisite: Economics 304K with a grade of at least C-.","upper":false},{"key":"ECO 305","name":"Introductory Topics in Economics","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"ECO 318Q","name":"Supervised Research","description":"Individual instruction. May be repeated once for credit when the research topics vary. Prerequisite: Economics 304K and 304L with a grade of at least C- in each.","upper":false},{"key":"ECO 420K","name":"Microeconomic Theory","description":"A survey of neoclassical and contemporary theories of the principal determinants of prices and of the role of prices in economic organization. Four lecture hours a week for one semester. Required of students majoring in economics. Students may not attempt Economics 420K more than twice. Prerequisite: Economics 304K and 304L with a grade of at least C- in each; and Mathematics 408C and 408D, or 408K and 408L, or 408N and 408S, with a grade of at least C- in each.","upper":true},{"key":"ECO 320L","name":"Macroeconomic Theory","description":"Theory of the determination of national income, employment, and the price level, with policy implications. Three lecture hours a week for one semester. Required of students majoring in economics. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 321","name":"Public Economics","description":"Study of appropriate allocations of economic activity between government (federal, state, and local) and the private sector. The workings of social security, welfare, education, pollution control, deregulation, taxation; and proposals for reform. Three lecture hours a week for one semester. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 322","name":"Money and Banking","description":"The role of money and depository institutions in the economy; introduction to financial and monetary theory and policy. Three lecture hours a week for one semester. Only one of the following may be counted: Economics 322, Finance 354, 354H. Prerequisite: Economics 420K and 320L with a grade of at least C- in each.","upper":true},{"key":"ECO 323T","name":"Studies in Economic History","description":"Study of economic development, emphasizing more recent periods; causal factors, emerging problems, and major policy issues. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Economics 304K and 304L with a grade of at least C- in each.","upper":true},{"key":"ECO 324","name":"Introduction to Labor Economics","description":"Study of labor in industrial societies, with emphasis on principles, institutions, and policies for understanding labor and personnel problems. Three lecture hours a week for one semester. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 327","name":"Comparative Economic Systems","description":"Theories of and practices in the principal types of economic systems. Three lecture hours a week for one semester. Prerequisite: Economics 304K and 304L with a grade of at least C- in each.","upper":true},{"key":"ECO 328","name":"Industrial Organization","description":"The organization of industries and markets: competition, monopoly, and oligopoly; antitrust policy and its alternatives. Three lecture hours a week for one semester. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 329","name":"Economic Statistics","description":"Methods of statistical analysis and interpretation of quantitative data in the field of economics. Three lecture hours a week for one semester. Only one of the following may be counted: Economics 329, Statistics 309, 309H. Prerequisite: Economics 304K and 304L with a grade of at least C- in each; and Mathematics 408C and 408D, or 408K and 408L, or 408N and 408S, with a grade of at least C- in each.","upper":true},{"key":"ECO 330T","name":"Topics in Economics","description":"Open to nonmajors. Topics may include economic theory, applications, and policy. Three lecture hours a week for one semester.   Economics 330T and 350K may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"ECO 333K","name":"Development Economics","description":"Same as Urban Studies 351 (Topic 4). Introduction to theories of economic development; discussion of leading issues. Three lecture hours a week for one semester. Only one of the following may be counted: Economics 333K, Urban Studies 351 (Topic: Development Economics), 351 (Topic 4). Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 334K","name":"Urban Economics","description":"Same as Urban Studies 351 (Topic 2: Urban Economics). Economic analysis of urban areas; emphasis on the nature of current urban problems--slums, transportation, finance--and an evaluation of current policy. Three lecture hours a week for one semester. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 334L","name":"Regional Economics","description":"Same as Urban Studies 351 (Topic 3: Regional Economics). Spatial aspects of economics, including concepts, theories, and policy applications. Three lecture hours a week for one semester. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 339K","name":"International Trade and Investment","description":"Topics addressed include patterns and theories in the international trade of goods and services between Organisation for Economic Co-operation and Development (OECD) member countries, and between OECD countries and emerging markets; questions facing firms of where to locate production facilities; implications of international trade for per capita income, growth, and inequality. Three lecture hours a week for one semester. Only one of the following may be counted: Economics 339K, European Studies 348 (Topic 2: International Trade), International Business 320F, 350. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 339L","name":"International Finance","description":"Exchange rates and foreign exchange markets; reasons for financial globalization; open-economy macro; exchange rate regimes (fixed and floating exchange rates, currency boards, and currency areas such the eurozone); central bank accumulation of foreign exchange reserves; and sovereign debt crises and currency crashes. Reasons for different exchange rate arrangements and other policies are also explored. Three lecture hours a week for one semester. Prerequisite: Economics 420K and 320L with a grade of at least C- in each.","upper":true},{"key":"ECO 341K","name":"Introduction to Econometrics","description":"Introduces the student to standard regression procedures of parameter estimation and hypothesis testing in economics. Three lecture hours a week for one semester. Prerequisite: Economics 420K and 329 with a grade of at least C- in each.","upper":true},{"key":"ECO 346K","name":"Russian Economic Development since 1917","description":"The growth of the planned economy in industry, agriculture, and labor. Three lecture hours a week for one semester. Economics 346K and Russian, East European, and Eurasian Studies 335 (Topic 13: Russian Economic Development since 1917) may not both be counted. Prerequisite: Economics 304K and 304L with a grade of at least C- in each.","upper":true},{"key":"ECO 350K","name":"Advanced Topics in Economics","description":"Designed primarily for economics majors. Topics may include in-depth analysis of problems in economic theory, applications, and economic policy. Three lecture hours a week for one semester.   Economics 330T and 350K may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Economics 420K with a grade of at least C-.  Additional prerequisites may vary with the topic and are given in the Course Schedule.","upper":true},{"key":"ECO 351K","name":"Current Issues in Business Economics","description":"Newly emerging problems in business and the approaches used for structuring, analyzing, and treating them. Three lecture hours a week for one semester. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 351L","name":"Business Trends and the Operational Environment in the United States Economy","description":"The technological basis of the United States economy; conditions, such as regulations, that define the macroenvironment. Three lecture hours a week for one semester. Prerequisite: Economics 420K, 320L, and 329 with a grade of at least C- in each.","upper":true},{"key":"ECO 351M","name":"Managerial Economics","description":"The use of economic analysis optimizing techniques as tools for improving managerial decision making in business. Three lecture hours a week for one semester. Prerequisite: Economics 420K, and Economics 329 or Mathematics 362K, with a grade of at least C- in each.","upper":true},{"key":"ECO 354K","name":"Introductory Game Theory","description":"Introduction to the formal study of interdependent decision making. Applications of game theory include pricing and advertising strategies, labor-management bargaining, and tariff negotiations. Three lecture hours a week for one semester. Prerequisite: Economics 420K and 329 with a grade of at least C- in each.","upper":true},{"key":"ECO 355","name":"Development Problems and Policies in Latin America","description":"Same as Latin American Studies 355 (Topic 1: Development Problems and Policies in Latin America) and Urban Studies 351 (Topic 1: Development Problems and Policies in Latin America). Description of the Latin American economy; business and market organization; problem of growth (involving credit, public finance, trade, investment aspects). Three lecture hours a week for one semester. Prerequisite: Economics 304K and 304L with a grade of at least C- in each.","upper":true},{"key":"ECO 357K","name":"Marxist Economics","description":"An introduction to the Marxian economic theory of capitalism through the study of Karl Marx's Capital, volume I, and of its contemporary relevance. Three lecture hours a week for one semester. Economics 357K and Russian, East European, and Eurasian Studies 335 (Topic 1: Marxist Economics) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"ECO 357L","name":"Political Economy of International Crises","description":"Examines several dimensions of the ongoing crises in the world economic order and the interrelationships among them. Problem areas covered are neoliberalism, international money, debt, famine, immigration, and energy shocks. Three lecture hours a week for one semester. Economics 357L and Russian, East European, and Eurasian Studies 335 (Topic 14: Political Economy of International Crises) may not both be counted. Prerequisite: Economics 304K and 304L with a grade of at least C- in each.","upper":true},{"key":"ECO 358Q","name":"Supervised Research","description":"Individual instruction. May be repeated once for credit when the research topics vary. May not be counted toward the twenty-five semester hours in economics required for the major in economics. Prerequisite: Economics 420K and 329 with a grade of at least C- in each.","upper":true},{"key":"ECO 359M","name":"Environmental and Natural Resource Economics","description":"Optimal use of exhaustible and renewable resources, including fuels, minerals, fisheries, forests, and water; resource scarcity and economic growth; valuation of nonmarketed environmental amenities; the economics of pollution control instruments, including taxes, permits, direct regulation, and negotiation; environmental quality and international trade; the economics of global climate change; pollution control policy in practice. Three lecture hours a week for one semester. Prerequisite: Economics 420K and 329 with a grade of at least C- in each.","upper":true},{"key":"ECO 361","name":"Studies in Public Economics","description":"Studies in the principal problem areas of governmental revenues and expenditures. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 361N","name":"Informational Society","description":"The social impact of the current technological changes in electronics, communications, and automation; focus on efficient institutions given the technological possibilities. Three lecture hours a week for one semester. Prerequisite: Economics 304K and 304L with a grade of at least C- in each.","upper":true},{"key":"ECO 362M","name":"Mathematics for Economists","description":"Application of mathematics in economic analysis. Three lecture hours a week for one semester. Prerequisite: Economics 420K, and Mathematics 408D or 408M, with a grade of at least C- in each.","upper":true},{"key":"ECO 363C","name":"Computational Economics","description":"Three lecture hours a week for one semester. Prerequisite: Economics 420K or 320L with a grade of at least C-.","upper":true},{"key":"ECO 367R","name":"Monetary Economics","description":"Major issues in the monetary field. Three lecture hours a week for one semester. Prerequisite: Economics 430K and 320L with a grade of at least C- in each.","upper":true},{"key":"ECO 368","name":"Survey of the History of Economic Thought","description":"Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ECO 369F","name":"Financial Economics","description":"Economic analysis of the operation of financial markets, including arbitrage theory, asset pricing, and corporate finance. Three lecture hours a week for one semester. Prerequisite: Economics 420K, 320L, and 329 with a grade of at least C- in each.","upper":true},{"key":"ECO 372M","name":"Studies in Developing Economies","description":"An introductory analysis of the structure, functioning, and problems of developing economies. Specific geographical areas to be studied will vary each semester. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 376M","name":"Studies in Labor Economics","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 377R","name":"Selected Topics in Economics Research","description":"Designed to teach undergraduate students how to conduct research. Focus on four fundamentals of economic research: the economic theory that underlies the research question, the research methods used, conducting research, and writing the research report. Three lecture hours a week for one semester; some topics may require field trips.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, and Economics 420K, 320L, and 329 with a grade of at least C- in each.","upper":true},{"key":"ECO 378H","name":"Honors Tutorial Course I","description":"Supervised individual reading, research, and writing of a substantial paper on a special topic in the field of economics. Conference course. Prerequisite: Upper-division standing, admission to the Economics Honors Program, and consent of the honors adviser.","upper":true},{"key":"ECO 379C","name":"Individual Conference Course","description":"Supervised individual study of selected problems in economics. Conference course. May not be counted toward the twenty-four semester hours in economics required for the major in economics. May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor. Students should ordinarily have completed six semester hours of upper-division coursework in economics and coursework with supervising instructor.","upper":true},{"key":"ECO 379D","name":"Internship in Economics","description":"Students conduct research while working in an appropriate government agency or private business. Ten hours of fieldwork a week for one semester. May be repeated once for credit when the internships vary. Offered on the pass/fail basis only. Prerequisite: Economics 420K with a grade of at least C-.","upper":true},{"key":"ECO 379H","name":"Honors Tutorial Course II","description":"Supervised individual reading, research, and writing of a substantial paper on a special topic in the field of economics. Conference course. Prerequisite: Economics 378H.","upper":true}]