[{"key":"AMS 310","name":"Introduction to American Studies","description":"Same as History 315G. An interdisciplinary introduction to the historical exploration of American culture. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 310, History 306N (Topic 2: Introduction to American Studies), 315G. Partially fulfills legislative requirement for American history.","upper":false},{"key":"AMS 311S","name":"Introductory Seminar in American Studies","description":"Writing, reading, and discussion on an American studies topic, with emphasis on the evaluation of information, analytical reading, and critical writing. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"AMS 315","name":"Topics in American Life","description":"Interdisciplinary exploration of American cultural and intellectual life. Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"AMS 315C","name":"Movies Go To War","description":"Same as Comparative Literature 305 (Topic 3), European Studies 307 (Topic 4),  and German, Scandinavian, and Dutch Studies 311C. A comparison of films from various nations about major twentieth century wars to the historical facts of the conflicts as practicums in critical comparative analysis of histories as representations. Only one of the following may be counted: American Studies 315 (Topic: Movies Go to War, World War I to Vietnam), 315C, Comparative Literature 305 (Topic: Movies Go to War, World War I to Vietnam), 305 (Topic 3), European Studies 307 (Topic: Movies Go to War, World War I to Vietnam), 307 (Topic 4), German, Scandinavian, and Dutch Studies 311C, Germanic Civilization 311 (Topic 2: Movies Go to War, World War I to Vietnam).","upper":false},{"key":"AMS 315D","name":"Anthropology of Race and Ethnicity: An Introduction","description":"Same as Anthropology 310L (Topic 2: Anthropology of Race and Ethnicity: An Introduction) and African and African Diaspora Studies 317D (Topic 2: Anthropology of Race and Ethnicity: An Introduction). Examines the social importance of race and ethnicity both in America and around the world. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 317D (Topic 2) and American Studies 315 (Topic: Anthropology of Race and Ethnicity), 315D, Anthropology 310L (Topic 2).","upper":false},{"key":"AMS 315E","name":"Introduction to Historical Archaeology","description":"Same as Anthropology 310L (Topic 4: Introduction to Historical Archaeology). A comprehensive survey of the methods, theories, and discoveries of historical archaeology, an interdisciplinary field that draws its theoretical and methodological foundations from anthropology, archaeology, and history. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: American Studies 315 (Topic: Introduction to Historical Archaeology), 315E, Anthropology 310L (Topic 4).","upper":false},{"key":"AMS 315F","name":"Native American Literature and Culture","description":"Same as English 314V (Topic 5: Native American Literature and Culture). Studies Native American literature from different regions and cultures and considers this literary tradition in tribal national and United States national contexts. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 315 (Topic: Native American Literature and Culture), 315F, English 314V (Topic 5). Prerequisite: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"AMS 321","name":"Studies in American Societies","description":"A study of America through its geography, language, government, or cultures. Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites vary with the topic.","upper":true},{"key":"AMS 321E","name":"African American History to 1860","description":"Same as African and African Diaspora Studies 357C and History 357C. Review of West African origins; New World settlement patterns, social life, and culture; discussion of the Atlantic slave trade, the development of capitalism and plantation slavery, and the origins of racism. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 357C, American Studies 321 (Topic: African American History to 1860), 321E, History 357C. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"AMS 321F","name":"African American History since 1860","description":"Same as African and African Diaspora Studies 357D, History 357D, and Urban Studies 353 (Topic 1: African American History since 1860). Survey of the history of African Americans in the United States from 1860 to the present: Emancipation, Reconstruction politics, migration and urbanization, and the evolution of African American culture; kinds of sources and methods valuable for analyzing African American life and culture. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 357D, American Studies 321 (Topic: African American History since 1860), 321F, History 357D, Urban Studies 353 (Topic 1). Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"AMS 321G","name":"Native Americans in Texas","description":"Same as Anthropology 326C. Studies the history of Native Americans in Texas using concepts and evidence from anthropology, history, archaeology, historical geography, and Native American studies. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 321 (Topic: Native Americans in Texas), 321G, Anthropology 324L (Topic: Native American in Texas). Prerequisite: Upper-division standing.","upper":true},{"key":"AMS 321J","name":"African American Social and Political Thought","description":"Same as African and African Diaspora Studies 374D (Topic 21), Core Texts and Ideas 326 (Topic 3),  and Government 335M (Topic 10). Examines the speeches and writings by major theorists and critics of the prophetic tradition of black political thought. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 374D (Topic: African American Social and Political Thought), 374D (Topic 21), American Studies 321 (Topic: African American Social and Political Thought), 321J, Core Texts and Ideas 326 (Topic 3), 335 (Topic: African American Social and Political Thought), Government 335M  (Topic: African American Social and Political Thought), 335M (Topic 10). Prerequisite: Upper-division standing and six semester hours of lower-division coursework in government.","upper":true},{"key":"AMS 322","name":"Studies in American Writing","description":"A study of America through its literature, popular fiction, journalism, and folklore. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites vary with the topic.","upper":true},{"key":"AMS 325","name":"Studies in American Art and Media Culture","description":"Study of American culture and society through media and the arts. Three lecture hours or two lecture hours and one discussion hour a week for one semester; additional hours may be required for some topics.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"AMS 325C","name":"Popular Music in the United States","description":"Same as History 365G (Topic 2). Traces the history of popular music in the United States and its influence on American politics, economics, and culture from the 1880s to present day. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 321 (Topic: Popular Music in the US), 325C, History 365G (Topic: Popular Music in the US), 365G (Topic 2). Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"AMS 327","name":"Studies in Religion and Philosophy","description":"Interdisciplinary exploration of religion and philosophy in American culture. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites may vary with the topic.","upper":true},{"key":"AMS 329","name":"Environmental History of North America","description":"Same as History 350R (Topic 7: Environmental History of North America) and Urban Studies 353 (Topic 5: Environmental History of North America). The history of humanity's influence on the plants, animals, microlife, soils, water, and air of North America, and vice versa, from the arrival of the proto-Indians to the contemporary environmental crisis. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 329, History 350L (Topic 4: Environmental History of North America), 350R (Topic 7), Urban Studies 353 (Topic 5). Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing and six semester hours of coursework in history.","upper":true},{"key":"AMS 330","name":"Modernism in American Design and Architecture","description":"Same as Art History 339Q and Urban Studies 352 (Topic 5). A historical survey of artifacts, buildings, and urban environments, focusing on responses to machine-age civilization. Prerequisite: Upper-division standing.","upper":true},{"key":"AMS 355","name":"Main Currents of American Culture to 1865","description":"Same as History 355N. Traces the development of American culture and society from the colonial era until the end of the Civil War. Major themes include racial conflict, religion, slavery, the development of democracy, and cultural reform. Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"AMS 356","name":"Main Currents of American Culture since 1865","description":"Same as History 356K. Traces the development of American culture and society from the end of the Civil War to the present. Major themes include racial conflict, pluralism, religion, urban development and reform, modernism, government centralization, cultural radicalism, and the rebirth of conservatism. Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"AMS 370","name":"Seminar in American Culture","description":"Interdisciplinary seminar on themes in American life. Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; additional prerequisites may vary with the topic.","upper":true},{"key":"AMS 372","name":"Conference Course","description":"Supervised individual study of selected subjects in American studies. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"AMS 679H","name":"Honors Tutorial Course","description":"Individual readings and conferences in connection with an original research paper. Conference course for two semesters. Prerequisite: For 679HA, upper-division standing and admission to the American Studies Honors Program; for 679HB, American Studies 679HA.","upper":true}]