[{"key":"C L 301","name":"Introduction to Comparative Literature","description":"Reading and interpretation of literary texts in translation drawn from cultures around the world, focusing on methods of criticism and analysis. Three lecture hours a week for one semester.","upper":false},{"key":"C L 305","name":"Topics in Comparative Literature","description":"Study of masterpieces of world literature; of different literary genres; and the relationship between literature and other disciplines such as psychology, philosophy, and film. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"C L 315","name":"Masterworks of World Literature","description":"Introduction to masterpieces of the world's literary traditions, emphasizing historical, generic, and thematic connections. Three lecture hours a week for one semester. Some sections require an additional discussion hour a week. Only one of the following may be counted: Comparative Literature 315, English 603B, Tutorial Course 603B. Prerequisite: One of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A; and a passing score on the reading section of the Texas Higher Education Assessment (THEA) test.","upper":false},{"key":"C L 318Q","name":"Supervised Research","description":"Individual instruction.","upper":false},{"key":"C L 320","name":"Conference Course in Comparative Literature","description":"Independent study of literary projects under supervision of professors in comparative literature. Conference course. Prerequisite: Six semester hours of upper-division coursework in literature, of which three hours must be in a classical or foreign language.","upper":true},{"key":"C L 323","name":"Topics in Comparative Literature","description":"Study of masterpieces of world literature; of different literary genres; of the relationship between literature and other disciplines, such as psychology, philosophy, and film; and of special topics of a comparative nature. Three lecture hours a week for one semester. Some sections offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"C L 358Q","name":"Supervised Research","description":"Individual instruction. Prerequisite: Upper-division standing.","upper":true}]