[{"key":"CTI 301","name":"Ancient Philosophy and Literature","description":"Studies classical philosophy and literature, primarily from ancient Greece, to explore fundamental questions about human nature, justice, ethics, and humanity's place in the cosmos. Readings include one or more masterpieces of epic or tragedy and one or more dialogues of Plato. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Core Texts and Ideas 301 and Western Civilization 301 may not both be counted.","upper":false},{"key":"CTI 302","name":"Classics of Social and Political Thought","description":"Explores the origins of social scientific thought in the history of political philosophy and traces the development of one or more of the social sciences in modern times. Focuses on fundamental ideas about human nature, civil society, and politics, explored through reading such authors as Aristotle, Aquinas, Locke, Rousseau, Marx, Weber, Durkheim, and Freud. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"CTI 303","name":"Competing Visions of the Good Life","description":"Same as Government 314 (Topic 6: Competing Visions of the Good Life). Introduces the great rival conceptions of the moral basis and goals of political life as elaborated by revolutionary thinkers throughout the history of political philosophy, including Aristotle, Aquinas, Locke, late modern critics of the Enlightenment, and others. Three lecture hours a week for one semester. Only one of the following may be counted: Core Texts and Ideas 303, Government 314 (Topic 6), Western Civilization 303 (Topic: Competing Visions of the Good Life).","upper":false},{"key":"CTI 304","name":"World Religions: Traditions and Texts","description":"A study of basic religious texts, including both the Hebrew Bible and New Testament, examined from various perspectives (including comparative, historical, philosophical, and literary), with emphasis on the fundamental questions and ideas raised in those texts. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Core Texts and Ideas 304 and Western Civilization 303 may not both be counted unless the topics vary. May be repeated for credit when the topics vary.","upper":false},{"key":"CTI 305G","name":"Introduction to the Old Testament","description":"Same as Jewish Studies 311 (Topic 4), Middle Eastern Studies 310 (Topic 3),  and Religious Studies 313C. Introduction to the many interpretations of the Hebrew Bible (the Old Testament) and its meaning in the context of its historical and cultural setting in the ancient Near East. Only one of the following may be counted: Core Texts and Ideas 305G, 310 (Topic: Introduction to the Hebrew Bible), Jewish Studies 311 (Topic: Introduction to the Hebrew Bible), 311 (Topic 4), Middle Eastern Studies 310 (Topic: Introduction to the Hebrew Bible), 310 (Topic 3), Religious Studies 313 (Topic: Introduction to the Hebrew Bible), 313C.","upper":false},{"key":"CTI 310","name":"Topics in Core Texts and Ideas","description":"Introduction to fundamental texts and questions that have helped shape the world. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Core Texts and Ideas 310 and Western Civilization 303 may not both be counted unless the topics vary. May be repeated for credit when the topics vary.","upper":false},{"key":"CTI 111","name":"Core Texts Seminar","description":"Close reading and discussion of primary sources, normally pursued in conjunction with another three-hour course in a field of study such as history or government. One discussion hour a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"CTI 320","name":"The Classical Quest for Justice","description":"Same as Government 351C. Introduces students to classical political thought through a study of seminal works of antiquity, focusing on those of Plato and Aristotle. Three lecture hours a week for one semester. Only one of the following may be counted: Core Texts and Ideas 320, 335 (Topic: Classical Quest for Justice), Government 335M (Topic: Classical Quest for Justice), 351C, Western Civilization 320 (Topic: Classical Quest for Justice). Prerequisite: Completion of at least thirty semester hours of coursework.","upper":true},{"key":"CTI 321","name":"The Theoretical Foundations of Modern Politics","description":"Same as Government 351D. Examines competing foundations of the ongoing development of political and social modernity. Examines a selection of major authors from Machiavelli to Nietzsche. Three lecture hours a week for one semester. Only one of the following may be counted: Core Texts and Ideas 321, 335 (Topic: The Theoretical Foundations of Modern Politics), Government 335M (Topic: The Theoretical Foundations of Modern Politics), 351D Western Civilization 320 (Topic: The Theoretical Foundations of Modern Politics). Prerequisite: Completion of at least thirty semester hours of coursework.","upper":true},{"key":"CTI 321F","name":"Spinoza and Modernity","description":"Same as European Studies 346 (Topic 21), History 362P, Jewish Studies 364 (Topic 9), Philosophy 354 (Topic 7),  and Religious Studies 357 (Topic 8). Introduction to the core of Spinoza's writings and the diverse reactions they have elicited. Examines Spinoza's refusal of mind-body dualism, as well as a transcendent god or ideal as a way of understanding Spinoza's concepts and ideas. Three lecture hours a week for one semester. Only one of the following may be counted: Core Texts and Ideas 335 (Topic: Spinoza and Modernity), 321F, European Studies 346 (Topic: Spinoza and Modernity), 346 (Topic 21), 347 (Topic: Spinoza and Modernity), History 362G (Topic: Spinoza and Modernity), 362P, Jewish Studies 364 (Topic: Spinoza and Modernity), 364 (Topic 9), Philosophy 334K (Topic: Spinoza and Modernity), 354 (Topic: Spinoza and Modernity), 354 (Topic 7), Religious Studies 357 (Topic: Spinoza and Modernity), 357 (Topic 8). Prerequisite: Upper-division standing.","upper":true},{"key":"CTI 322","name":"Critics of Modern Liberalism","description":"Same as Government 351G. Selected critics of the philosophy of the Enlightenment from both the Left and the Right, and from the time of Rousseau to the present. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Core Texts and Ideas 322, Government 335M (Topic: Liberalism and its Critics), 351G. Prerequisite: Upper-division standing.","upper":true},{"key":"CTI 323","name":"Might and Right among Nations","description":"Same as Government 351J. Major alternative approaches to the question of the moral character of international relations, as elaborated by some of the greatest political thinkers. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Core Texts and Ideas 323, 335 (Topic: Might and Right among Nations), Government 335M (Topic: Might and Right among Nations), 351J, Western Civilization 320 (Topic: Might and Right among Nations). Prerequisite: Upper-division standing and six semester hours of lower-division coursework in government.","upper":true},{"key":"CTI 324","name":"Politics and Literature","description":"Explores the \"old battle between the poets and philosophers,\" in which the two sides battle for recognition as the deepest source of wisdom about politics and ethics. Includes readings from great works of political philosophy and literature. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CTI 325","name":"Morality and Politics","description":"Same as Government 351L. Interdisciplinary readings from major works exploring issues of ethics and leadership. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Core Texts and Ideas 325, Government 335M (Topic: Morality and Politics), 351L. Prerequisite: Upper-division standing.","upper":true},{"key":"CTI 326","name":"Core Texts on American Democracy","description":"A close study of major texts and documents that shed light on fundamental issues in American democracy such as rights, equality, individual liberty, and the proper ends and limits of government. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Core Texts and Ideas 326 and Western Civilization 320 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"CTI 335","name":"Core Texts in Philosophy","description":"Three lecture hours or two lecture hours and one discussion hour a week for one semester. Core Texts and Ideas 335 and Western Civilization 320 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"CTI 345","name":"Core Texts in Literature","description":"Major works of literature from one or more cultures, studied with special attention to questions of universal human concern. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Core Texts and Ideas 345 and Western Civilization 320 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"CTI 350","name":"Masterworks of World Drama","description":"Studies major tragedies, comedies, and historical plays from various epochs, including at least one of Shakespeare's plays. Explores themes related to ethics, politics, and human nature, as well as the craft of the playwright. Students attend and discuss at least one play performance. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CTI 351","name":"The Idea of the Beautiful","description":"Classical philosophical discussions of the idea of the beautiful (or noble or sublime), illustrated through selected works of art, drama, and literature. Explores the human perception of and response to beauty and its relation to such ideas as happiness and the promise of happiness, moral nobility or selflessness, and the divine. Philosophical works are studied in connection with examples drawn from the arts and are considered in their historical contexts. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CTI 365","name":"Classics of Social Scientific Thought","description":"Studies a selection of foundational modern classics in economics, psychology, sociology, political science, and anthropology, drawn mainly from the nineteenth and twentieth centuries. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"CTI 366","name":"Topics in Economic and Social Thought","description":"Three lecture hours or two lecture hours and one discussion hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"CTI 370","name":"Core Texts of Science and Mathematics","description":"Studies works of major scientists, mathematicians, and philosophers, and explores the fundamental ideas from one discipline or time period and the nature and grounds of human knowledge. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Core Texts and Ideas 370 and Western Civilization 320 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"CTI 371","name":"Einstein in the Age of Conflict","description":"Same as History 350L (Topic 64: Einstein in the Age of Conflict). Following the life and work of Albert Einstein, course examines the rise of the theories of relativity and quantum mechanics upon the stage of international political upheaval. Three lecture hours a week for one semester. Only one of the following may be counted: Core Texts and Ideas 370 (Topic: Einstein in the Age of Conflicts), 371, History 350L (Topic 64). Prerequisite: Upper-division standing.","upper":true},{"key":"CTI 372","name":"Darwin and the Politics of Evolution","description":"Same as Government 353D. A careful reading of Darwin's influential Origin of the Species by Means of Natural Selection, together with an examination of the religious, political, and scientific controversies the book has inspired from its first publication to the present day. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted:  Core Texts and Ideas 370 (Topic: The Politics of Evolution), 372, Government 335M (Topic: The Politics of Evolution), 353D. Prerequisite: Upper-division standing and six semester hours of lower-division coursework in government.","upper":true},{"key":"CTI 375","name":"Topics in Core Texts and Ideas","description":"Study of classic texts, connected historically or thematically. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Core Texts and Ideas 375 and Western Civilization 320 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"CTI 379","name":"Conference Course","description":"Intensive tutorial study of selected major texts. Individual instruction.  May be repeated for credit. Prerequisite: Upper-division standing and consent of the director of the Jefferson Center and instructor.","upper":true}]