[{"key":"SED 332","name":"Field Experiences in Special Education","description":"Observation and participation in a variety of educational settings that serve children with disabilities. Two lecture hours and two four-hour sessions of fieldwork a week for one semester. Fieldwork sessions must be arranged between 8:00 AM and noon. Required for all undergraduate students seeking special education certification.","upper":true},{"key":"SED 337","name":"Intercultural Communication and Collaboration","description":"Basic principles of interpersonal and intergroup communication in culturally and linguistically diverse educational settings. Designed to help students understand the relationship between culture, language, and disability using a variety of formats, including discussion, dialogue, journals, simulations, case studies, and field-based assignments. Three lecture hours a week for one semester. Required for undergraduate students seeking special education certification. Prerequisite: Admission to the teacher preparation program and consent of the Office of Student Field Experiences.","upper":true},{"key":"SED 366","name":"Behavior Management for the Exceptional Learner","description":"Behavior management procedures used in a variety of educational environments with a wide range of learners. Emphasis on instructional procedures, behavior and program evaluation, and principles of applied behavior analysis. Instructional management, classroom management, functional assessment of behavior, procedures for increasing successful school behavior while decreasing undesirable behavior, social skills instruction, and crisis management. Three lecture hours and two one-hour field placement sessions a week for one semester. Required for students seeking special education certification. Prerequisite: Applied Learning and Development 322 and consent of the undergraduate adviser.","upper":true},{"key":"SED 667","name":"Student Teaching in Special Education","description":"Directed and closely supervised performance in the full range of duties of a teacher, conducted in cooperating schools; accompanying directed study and seminars. Required in the professional development sequence for elementary school teacher candidates also seeking special education certification. Forty hours a week for one semester.  Offered on the pass/fail basis only. Prerequisite: Completion of the twenty-four hours of coursework required for the special education academic specialization; consent of the undergraduate adviser; and admission to the professional development sequence of courses. Admission by application only, filed in the Office of Student Field Experiences by March 1 for fall semester registration and by October 1 for spring semester registration.","upper":true},{"key":"SED 372","name":"Assessment of Individuals with Mild to Moderate Disabilities","description":"Assessment and high-stakes testing policies, procedures, and practices in special education; curriculum-based measurement used to monitor academic outcomes for students with disabilities; and principles and procedures used to reduce misidentification of individuals from culturally and linguistically diverse backgrounds and with limited English proficiency. Assessment data and individualized education plan development is also covered. Three lecture hours a week for one semester. Required for students seeking special education certification. Prerequisite: Admission to the teacher preparation program and consent of the Office of Student Field Experiences.","upper":true},{"key":"SED 675","name":"Instructional Methods in Special Education","description":"Procedures and practice in the instruction of students with mild or moderate exceptionalities. Emphasis on adaptations within the regular classroom and methods specific to exceptionalities. Three lecture hours a week for one semester, and six hours a week in an internship. Required for students seeking special education certification. Prerequisite: Applied Learning and Development 322, Special Education 376, and consent of the undergraduate adviser.","upper":true},{"key":"SED 375C","name":"Teaching Individuals with Mild to Moderate Disabilities","description":"Instructional practices associated with improved outcomes for students with mild to moderate disabilities receiving services in general and special education classrooms, including an emphasis on teaching reading in content areas, such as mathematics, science, and social studies. Three lecture hours and sixteen to twenty internship hours a week for one semester. Required for students seeking special education certification. Prerequisite: Admission to the teacher preparation program and consent of the Office of Student Field Experiences.","upper":true},{"key":"SED 376","name":"Foundations and Issues in Special Education","description":"Key issues affecting decision-making and practices by special education teachers, assessment personnel, and administrators related to the treatment and education of students with disabilities. Three lecture hours a week for one semester. Required for students seeking special education certification.","upper":true},{"key":"SED 377","name":"Transition and the Exceptional Learner","description":"An overview of the transitions within the life span, particularly the transition to postsecondary school settings for individuals with disabilities. Designed to help students develop the ability to infuse transition-related topics into curricula, assess transition needs, develop transition plans, and become knowledgeable about existing vocational and community services. Three lecture hours a week for one semester, with fieldwork to be arranged. Required for students seeking special education certification. Prerequisite: Applied Learning and Development 322 and consent of the undergraduate adviser.","upper":true},{"key":"SED 378D","name":"Assessment Practices in Autism and Developmental Disabilities","description":"Assessment practices for developing and evaluating educational programs for individuals with autism and developmental disabilities. Considers the theoretical orientations that underlie the major assessment strategies, including standardized, behavioral, and informal practices. Three lecture hours and three hours of fieldwork a week for one semester. Required for students seeking special education certification. Prerequisite: Admission to the teacher preparation program and consent of the Office of Student Field Experiences.","upper":true},{"key":"SED 378E","name":"Advanced Early Childhood Intervention","description":"Designed to assist students in acquiring in-depth knowledge of early childhood intervention, particularly related to services within the state of Texas, including an understanding of the legal policies related to serving young children with disabilities and their families. Three lecture hours and eight hours of fieldwork a week for one semester. Required for students seeking special education certification. Prerequisite: Admission to the teacher preparation program and consent of the Office of Student Field Experiences.","upper":true},{"key":"SED 378R","name":"Reading Assessment and Development with Diverse Populations","description":"The knowledge and skills associated with assessing, instructing, and monitoring the progress of students who experience mild to moderate difficulties with reading, as well as students with dyslexia. The emphasis is on reading, spelling, and writing for kindergarten through grade five. Three lecture hours and four hours of fieldwork a week for one semester. Required for students seeking special education certification. Prerequisite: Admission to the teacher preparation program and consent of the Office of Student Field Experiences.","upper":true},{"key":"SED 378S","name":"Teaching Individuals with Autism and Developmental Disabilities","description":"Assessment and instructional strategies for educating students with autism and other developmental and physical disabilities. Focuses on implementation and evaluation of instructional procedures for teaching a range of adaptive behaviors, such as self-care, and communication, social, and community living skills. Three lecture hours and eight hours of fieldwork a week for one semester. Required for students seeking special education certification. Prerequisite: Admission to the teacher preparation program and consent of the Office of Student Field Experiences.","upper":true},{"key":"SED 378T","name":"Topics in Special Education","description":"Three lecture hours and three and one-half hours of fieldwork a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"SED 379","name":"Seminar in Special Education","description":"Specialized study in an identified area of interest in education of the exceptional child. Three lecture hours a week for one semester.  May be repeated for credit. Prerequisite: Applied Learning and Development 322 and consent of the undergraduate adviser.","upper":true}]