[{"key":"L A 101L","name":"Introduction to the Liberal Arts","description":"Topics related to exploring the various disciplines in the College of Liberal Arts. One lecture hour a week for one semester, or as required by the topic. Some sections are offered on the pass/fail basis only and some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary.","upper":false},{"key":"L A 302","name":"Critical Thinking Seminar","description":"An examination of fundamental concepts in critical thinking, including the role of intellectual virtues, an analysis of the elements of thought, Socratic thinking, and the application of universal intellectual standards. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Liberal Arts 302 and Natural Sciences 302 may not both be counted. May not be repeated for credit.","upper":false},{"key":"L A 104R","name":"Community Service","description":"Restricted to recipients of the Rapoport Service Scholarship. Tutorial course, in which students submit reports based on service learning and appropriate supplementary reading. The equivalent of one lecture hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":false},{"key":"L A 110","name":"Internship","description":"Restricted to students in the College of Liberal Arts. Students work in a professional environment and apply analysis, communication, and other academic skills to practical work. The equivalent of one lecture hour and ten hours of fieldwork a week for one semester.  May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Completion of at least thirty semester hours of coursework, a University grade point average of at least 2.25, and consent of instructor.","upper":false},{"key":"L A 320","name":"Internship","description":"Designed to establish the academic foundations of an internship course in the liberal arts. Students integrate knowledge derived from their academic studies with the experiences gained in an internship setting. The equivalent of three lecture hours and ten hours of fieldwork a week for one semester.  May be repeated for credit. Prerequisite: Completion of at least thirty semester hours of coursework, a University grade point average of at least 2.25, and consent of instructor.","upper":true},{"key":"L A 621","name":"International Internship","description":"Restricted to students participating in a study abroad program.  One lecture hour and seven and one-half laboratory hours a week for one semester; with additional fieldwork hours to be arranged. Prerequisite: Upper-division standing.","upper":true}]