[{"key":"GRG 301C (TCCN: GEOG 1301)","name":"The Natural Environment","description":"Geomorphic processes that shape the earth's surface; origin and evolution of landforms. Groundwater and water resources. Pedogenesis and soil properties. Three lecture hours and one and one-half laboratory hours a week for one semester, and a one-day field trip.","upper":false},{"key":"GRG 301K (TCCN: GEOL 1347)","name":"Weather and Climate","description":"A survey of meteorological phenomena and climatological processes of the earth. Three lecture hours a week for one semester.","upper":false},{"key":"GRG 302P","name":"Topics in Cultural Geography","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"GRG 303P","name":"Topics in Physical Geography","description":"Three lecture hours or two lecture hours and one discussion hour a week for one semester. Additional hours may be required for some topics. Only one of the following may be counted unless the topics vary: Geography 303P, 304P, 309. May be repeated for credit when the topics vary.","upper":false},{"key":"GRG 304E","name":"Environmental Science: A Changing World","description":"Surveys the major global environmental concerns affecting the Earth and its residents from the perspectives of the environmental sciences. Three lecture hours and one and one-half laboratory hours a week for one semester.","upper":false},{"key":"GRG 304P","name":"Topics in Geographical Methods","description":"Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted unless the topics vary: Geography 303P, 304P, 309. May be repeated for credit when the topics vary.","upper":false},{"key":"GRG 305 (TCCN: GEOG 1303)","name":"This Human World: An Introduction to Geography","description":"Introductory survey of human geography, including human-environment relations, cultural patterns and processes, and geography's relation to other fields of study. Three lecture hours and one laboratory hour a week for one semester.","upper":false},{"key":"GRG 306C","name":"Conservation","description":"Introduction to environmental management, with emphasis on the major causes and consequences of environmental degradation. The course is organized around the premise that people cannot solve environmental problems unless they know how and why they occur; a major objective is to identify and understand the sociocultural forces that drive environmental degradation. Three lecture hours a week for one semester.","upper":false},{"key":"GRG 307C","name":"Introduction to Urban Studies","description":"Same as Urban Studies 301. A multidisciplinary study of cities and complex urban environments; historical and contemporary issues from both national and international perspectives. Three lecture hours a week for one semester.","upper":false},{"key":"GRG 309","name":"Topics in Human Geography","description":"Three lecture hours a week for one semester. Only one of the following may be counted unless the topics vary: Geography 303P, 304P, 309. May be repeated for credit when the topics vary.","upper":false},{"key":"GRG 310C","name":"Spatial Data and Analysis","description":"Fundamental concepts in spatial data acquisition, analysis, and presentation, with emphasis on the needs of professionals in cartography, geographic information systems (GIS), and remote sensing. Three lecture hours a week for one semester.","upper":false},{"key":"GRG 319","name":"Geography of Latin America","description":"Same as Latin American Studies 319. Adaptations to population growth and spatial integration in cultural landscapes of great natural and ethnic diversity; problems of frontiers and cities. Three lecture hours a week for one semester.","upper":false},{"key":"GRG 320K","name":"Land and Life: The American Southwest","description":"Historical geography of the southwestern United States, emphasizing the ways of life of American Indian, Spanish, mestizo, and Anglo cultures. Three lecture hours a week for one semester, with one field trip to be arranged. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 325","name":"Geography of Texas","description":"Texas as an environmental and cultural borderland: as a transition zone between plains and mountains, humid and arid, South and West, Anglo-America and Latin America. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 326","name":"Regions and Cultures of Europe","description":"Same as European Studies 346 (Topic 19) and Russian, East European, and Eurasian Studies 345 (Topic 2). Spatial patterns in Europe, with emphasis on cultural, historical, and political geography. Only one of the following may be counted: European Studies 346 (Topic: Regions and Cultures of Europe), 346 (Topic 19), Geography 326, Russian, East European, and Eurasian Studies 345 (Topic 2). Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 327","name":"Geography of the Former Soviet Union","description":"Same as Russian, East European, and Eurasian Studies 345 (Topic 4: Geography of the Former Soviet Union). A systematic introduction to cultural, physical, political, and economic geography of the former Soviet Union. Focus on the fundamental transformation that the former Socialist Union Republics, now sovereign states, have undergone since 1991. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 328","name":"Geography of the Middle East","description":"Same as Middle Eastern Studies 341 (Topic 1: Geography of the Middle East). Major elements of physical and social environment in the region extending from Egypt to Afghanistan. Three lecture hours a week for one semester. Only one of the following may be counted: Geography 328, Middle Eastern Studies 322K (Topic 3: Geography of the Middle East), 341 (Topic 1). Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 331","name":"Geography of Asia","description":"Natural regions and cultural landscapes of Asia, excluding the former Soviet Union. Three lecture hours a week for one semester. Asian Studies 331 and Geography 331 may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 333C","name":"Severe and Unusual Weather","description":"In-depth discussion of inclement weather phenomena (tornadoes, tropical cyclones, floods, drought) and their effects on human beings, as well as the climatology of those types of weather events. Three lecture hours a week for one semester, with additional field hours to be arranged. Prerequisite: Geography 301K.","upper":true},{"key":"GRG 333K","name":"Climate Change","description":"Examines changes in climatic systems over both short and long time periods in relation to impacts on physical and ecological systems. Discusses past, present, and future changes in climatic conditions and the methods used to make those evaluations. Three lecture hours a week for one semester. Geography 333K and 356T (Topic: Climate Change) may not both be counted. Prerequisite: Upper-division standing and Geography 301C or 301K.","upper":true},{"key":"GRG 334C","name":"Environmental Hazards","description":"Earth science processes that affect human activities: soil, erosion, flooding, slope stability, earthquakes, volcanism, and water resources and quality. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 334K","name":"Soils","description":"Morphology, genesis, properties, and distribution of world soils. Factors of soil formation. Three lecture hours a week for one semester. Prerequisite: Upper-division standing; and six semester hours of coursework in physical geography or one or more of the geological or natural sciences, or the equivalent.","upper":true},{"key":"GRG 335C","name":"Quaternary Landscapes","description":"Changing physical and biotic landscapes on the Ice Age earth during the last two million years. Reconstruction of Quaternary geomorphic landscapes based on principles and applications of geochronology and paleoclimatology. Three lecture hours a week for one semester. Geography 335C and 385C may not both be counted. Prerequisite: Upper-division standing and Geography 301C.","upper":true},{"key":"GRG 335K","name":"Mountain Geoecology","description":"Geological evolution of mountains. Physical geography of mountains: climates, soils, vegetation, landforms and geomorphic processes. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and six semester hours of coursework in physical geography or one or more of the geological or natural sciences.","upper":true},{"key":"GRG 335N","name":"Landscape Ecology","description":"The study of spatial patterns in the earth's biosphere found within landscapes, typically areas measured in square kilometers. Examines the processes that create those patterns, drawing from ecology, biogeography, and many other disciplines. Also explores the practical applications of landscape ecology to the study of natural environments and those managed or altered by human activities. Three lecture hours a week for one semester. Geography 335N and 356T (Topic: Landscape Ecology) may not both be counted. Prerequisite: Upper-division standing and three semester hours of coursework in physical geography or one of the geological or natural sciences.","upper":true},{"key":"GRG 336","name":"Contemporary Cultural Geography","description":"Same as Urban Studies 354 (Topic 8). Recent theoretical developments in cultural geography, with a focus on landscapes and the everyday practices that imbue them with meaning; the ways those meanings are contested and are the foci of struggle; and how the relationship between culture and space plays a central role in the social construction of identity. Three lecture hours a week for one semester. Only one of the following may be counted: Geography 336, Urban Studies 354 (Topic: Contemporary Cultural Geography), 354 (Topic 8). Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 336C","name":"National Parks and Protected Areas","description":"The history, purpose, and meaning of national parks (and preserves, refuges, and other publicly protected natural areas), from their inception at Yellowstone in 1872 to their present global distribution. Emphasis is on key management issues and dilemmas in the parks today; and the adoption and modification of Western notions of nature preservation within non-Western cultural settings. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 337","name":"The Modern American City","description":"Same as Architecture 350R (Topic 1: The Modern American City) and Urban Studies 352 (Topic 1: The Modern American City). Issues facing residents of United States cities, such as transportation and housing, poverty and crime, metropolitan finance, environmental and architectural design; historical/comparative urban evolution. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 338C","name":"Rivers and Landscapes: Fluvial Geomorphology","description":"Drainage basin evolution and channel adjustment, variability of river systems in differing geomorphic regimes, relationships between fluvial systems and other components of physical geography, and the role of humans as geomorphic agents. Three lecture hours a week for one semester, with additional field hours to be arranged. Prerequisite: Upper-division standing; and Geography 301C or Geological Sciences 401, or the equivalent.","upper":true},{"key":"GRG 339","name":"Process Geomorphology","description":"Analysis of geomorphic processes and their effects on landform development. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and credit or registration for Geography 301C or Geological Sciences 401.","upper":true},{"key":"GRG 339C","name":"Principles of Environmental Conservation","description":"Environmental conservation issues, focusing on the factors that control the production and consumption of environment-based resources. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 340D","name":"Political Ecology of Globalization and Environmental Degradation","description":"Study of current environmental problems from the perspective of political ecology, which critically examines political, economic, and social relations between humans and the natural world. Uses case studies from Africa, Latin America, Asia, and the Middle East to address climate change, deforestation, desertification, biodiversity, and environmental justice. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 341K","name":"Landscapes of Mexico and Caribbean America","description":"Same as Latin American Studies 330 (Topic 2: Landscapes of Mexico and Caribbean America). The natural regions and cultural landscapes of Mexico, Central America, and the West Indies. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 342C","name":"Sustainable Development","description":"Historical and contemporary analysis of international development with a focus on the prospects for environmental sustainability. Three lecture hours a week for one semester. Asian Studies 342C and Geography 342C may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 346","name":"The Human Use of the Earth","description":"The state of the world from an ecological perspective. Case studies are drawn from a wide range of ecological settings and involve both traditional and modern societies. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 348C","name":"Geography of South Asia","description":"Same as Asian Studies 348C. Natural regions and cultural landscapes of South Asia. Agriculture, urban structure, issues of environment and development. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 350K","name":"Geographies of Globalization","description":"Examines the process of globalization by theoretically and empirically analyzing the rise of capitalism and industrial modernity, its evolution into a global system through methods such as colonization and free-trade imperialism, and its metamorphosis into the postmodern cultural, economic and political process known as globalization. Three lecture hours a week for one semester. Geography 350K and 356T (Topic: Introduction to Globalization) may not both be counted.","upper":true},{"key":"GRG 356","name":"Topics in Environmental Geography","description":"Topics include environmental assessment methods and techniques, the conservation movement, and climate and people. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 356C","name":"Geo-Archaeology and Environmental History","description":"Long-term ecology as reconstructed from settlement and land-use histories. Empirical case studies in environmental history from the Mediterranean region, the Near East, and Mesoamerica. Applications to degradation, desertification, sustainability, and global change. Three lecture hours a week for one semester. Only one of the following may be counted: Anthropology 382N, Geography 356C, 382K. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 356T","name":"Topics in Geography","description":"Three lecture hours a week for one semester. Some topics may require additional field trips; these are identified in the Course Schedule.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"GRG 357","name":"Medical Geography","description":"The geographic distribution, expansion, and contraction of the infectious diseases that have the greatest influence in shaping human societies today: malaria, AIDS, and others. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 358","name":"Cities in Developing Countries","description":"Comparative analysis of demographic, social, economic, and political features of cities in Latin America, the Middle East, Asia, and Africa; emphasis on regional imbalance, migration, occupational and social stratification, housing the poor, and suburbanization. Possibilities for individual research. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 358E","name":"Geography and Religion","description":"Same as Humanities 350 (Topic 3: Geography and Religion). Ideas about the relationships among the natural world, myth, and ritual; principal focus on Christianity, Islam, and Judaism and their offshoots and antagonists in the Western world. Three lecture hours a week for one semester. Only one of the following may be counted: Geography 358E, Humanities 350 (Topic 3), Middle Eastern Studies 322K (Topic 15: Geography and Religion). Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 460C","name":"The Geographer's Craft","description":"A comprehensive introductory survey of research techniques used in contemporary geography. The course uses the problem-solving approach to teach technical skills and concepts drawn from cartography, remote sensing, geographical information systems, spatial statistics, and maps and map interpretation. Three lecture hours and one and one-half laboratory hours a week for one semester.","upper":true},{"key":"GRG 360G","name":"Environmental Geographic Information Systems","description":"An introduction to the creation and use of geographic information systems. Three lecture hours and two discussion hours a week for one semester. Prerequisite: Geography 310C.","upper":true},{"key":"GRG 360L","name":"Spatial Analysis","description":"Application of statistical techniques to spatial problems: research and experimental design, hypothesis testing and sampling, with reference to spatial patterns and areal associations. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 462K","name":"Introduction to Remote Sensing of the Environment","description":"The use of electromagnetic energy to sense objects in the natural environment; interpretation and recognition of patterns detected by sensors. Three lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 464K","name":"Advanced Remote Sensing and Pattern Analysis","description":"Advanced classification techniques for satellite image processing and landscape pattern analysis. Three lecture hours and one and one-half discussion hours a week for one semester. Geography 356 (Topic: Advanced Remote Sensing and Pattern Analysis) and 464K may not both be counted. Prerequisite:  Upper-division standing, and Geography 462K or the equivalent or consent of instructor.","upper":true},{"key":"GRG 366C","name":"Comparative Ecosystems","description":"The important ecosystem processes that affect the distributions, characteristics, and management of natural environments at landscape, regional, and continental scales. Ecosystem functions, including nutrient cycling, water balance, and the role of natural disturbances in a wide range of ecosystems, from the tundra to the rain forests and grasslands of the tropics. Three lecture hours a week for one semester. Geography 356T (Topic: Comparative Ecosystems) and 366C may not both be counted. Prerequisite: Upper-division standing and three semester hours of coursework in physical geography or one of the geological or natural sciences.","upper":true},{"key":"GRG 366K","name":"Biogeography","description":"Contemporary patterns of plant and animal distribution, and the environmental and historical processes affecting them. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and three semester hours of coursework in physical geography or one of the geological or natural sciences.","upper":true},{"key":"GRG 367K","name":"Vegetation Ecology","description":"Plant autecology and synecology. Ecological factors and processes of plant communities. Vegetation geoecology, succession, and dynamics. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and six semester hours of coursework in physical geography or one or more of the geological or natural sciences.","upper":true},{"key":"GRG 368C","name":"Spatial Analysis and Geographic Information Systems","description":"Addresses spatial problem solving by focusing on both the theoretical/conceptual and practical aspects of geographic information systems modeling. Describes geographic information systems techniques and spatial statistics used to quantify and measure spatial patterns. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and credit or registration for Geography 360G.","upper":true},{"key":"GRG 470C","name":"Advanced Geographic Information Systems","description":"Study of methods of spatial analysis, design and implementation of a geographic information system, vector and raster modeling, and advanced applications of geographic information systems. Three lecture hours and one and one-half laboratory hours a week for one semester. Prerequisite: Geography 360G and consent of instructor.","upper":true},{"key":"GRG 373F","name":"Field Techniques","description":"Introduction to the collection and mapping of environmental and cultural data, involving both classroom lectures and outdoor exercises. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, a major in geography, and consent of instructor.","upper":true},{"key":"GRG 373K","name":"Field Methods for Landscape Characterization","description":"The design of research questions and the acquisition of data for the characterization of landscapes. Utilizes geographical and ecological field-based methods. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and Geography 301C or the equivalent.","upper":true},{"key":"GRG 374","name":"Frontiers in Geography","description":"Restricted to geography majors and students seeking a secondary school teaching certificate with geography as the second teaching field. Current concerns and methodology in the field of geography; an introduction to theory and research in geography. The equivalent of three lecture hours a week for one semester, with one field trip to be arranged. Prerequisite: Upper-division standing and consent of the undergraduate adviser.","upper":true},{"key":"GRG 476T","name":"Topics in Geography","description":"Three lecture hours and one and one-half laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"GRG 679H","name":"Honors Tutorial Course","description":"For honors candidates in geography. Individual reading of selected works for one semester, followed in the second semester by the writing of an honors thesis. Regular conferences with the faculty supervisor are also required. Conference course for two semesters. Prerequisite: For 679HA, admission to the Geography Honors Program no later than two semesters before expected graduation; for 679HB, Geography 679HA. A University grade point average of at least 3.00 and a grade point average in geography of at least 3.50 are required for admission to the Geography Honors Program.","upper":true},{"key":"GRG 379K","name":"Conference Course","description":"Supervised individual study of selected problems in geography. Conference course.  May be repeated for credit. Prerequisite: Six semester hours of upper-division coursework in one or more of the social, geological, or natural sciences; and consent of instructor.","upper":true},{"key":"GRG 379L","name":"Practicum: Internships in Applied Geography","description":"Research and staff experience working in an appropriate government agency or private business. At least six but no more than nine hours of work a week for one semester. Prerequisite: Completion of at least seventy semester hours of coursework, including twelve semester hours of geography, and consent of the undergraduate adviser.","upper":true}]