[{"key":"URB 301","name":"Introduction to Urban Studies","description":"Same as Geography 307C. A multidisciplinary study of cities and complex urban environments; historical and contemporary issues from both national and international perspectives. Three lecture hours a week for one semester.","upper":false},{"key":"URB 305","name":"Introductory Topics in Urban Studies","description":"An introduction to urban studies within the framework of different disciplines. Topics include urban history, urban education, politics and governance, economics, design and planning, and society and culture. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"URB 315","name":"Urban Studies Research Methods","description":"An introduction to urban studies research methodologies. Includes sources of urban data, the use of the library in urban research, formulating research questions, research design, methods commonly used in urban research, the use of computers to store and manipulate quantitative urban data, and an introduction to data analysis and theoretical and practical applications of urban research. Three lecture hours a week for one semester. Prerequisite: Mathematics 408C or 408K with a grade of at least C-; Mathematics 316 or Statistics and Scientific Computation 305 with a grade of at least C-; and Urban Studies 301.","upper":false},{"key":"URB 325","name":"Special Topics in Urban Studies","description":"Three lecture hours a week for one semester. Additional hours may be required for some topics; these are identified in the Course Schedule.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"URB 350","name":"Topics in Urban Politics and Governance","description":"The basic political and administrative structures of cities and metropolitan regions, including problems associated with local and regional government. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"URB 351","name":"Topics in Urban Economics","description":"Urban economics and the application of economic analysis to urban concerns, including economic development, urbanization, urban form, public finance, and competition. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"URB 352","name":"Topics in Urban Design and Planning","description":"Issues concerning the built environment and urban infrastructure, environmental sustainability, and the public policy framework designed to manage the challenges presented by these issues. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"URB 353","name":"Topics in Urban History","description":"The historical evolution of cities, contemporary urban development trends, and the links between social development and physical form. Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"URB 354","name":"Topics in Urban Society and Culture","description":"Topics on the social and cultural diversity within cities; social policies; and the sociocultural impact of the media and other institutions on urban development. Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"URB 360","name":"Internship and Service Learning","description":"Internship experience in an urban studies-related public or nonprofit agency. Students have the opportunity to apply the knowledge, theory, and understanding gained from courses in their areas of specialization to urban issues in a professional setting. Includes an academic service-learning component. Approximately five to ten hours a week for one semester. Prerequisite: Urban Studies 301 and 315, and upper-division standing or consent of instructor.","upper":true},{"key":"URB 370","name":"Senior Project","description":"Students identify an urban issue, develop a position paper, and work closely with a faculty adviser on a project. Students may use text or other media (such as video or portfolio) to present their arguments. The equivalent of three lecture hours a week for one semester. Prerequisite: Upper-division standing, and Urban Studies 301, 315, and 360 with a grade of at least C in each.","upper":true},{"key":"URB 379","name":"Conference Course","description":"Supervised individual study of selected problems in urban studies. Conference course. Prerequisite: Upper-division standing and consent of instructor and the undergraduate adviser.","upper":true},{"key":"URB 679H","name":"Honors Tutorial Course","description":"Directed reading and research or creation of an honors project, followed by the writing of a thesis. Conference course for two semesters. Prerequisite: For 679HA, admission to the Urban Studies Honors Program and consent of the urban studies adviser; for 679HB, Urban Studies 679HA.","upper":true}]