[{"key":"EUS 302","name":"Introductory Interdisciplinary Topics in European Studies","description":"Analysis of various aspects of European culture, science, and technology. Three lecture hours a week for one semester.   Only one of the following may be counted unless the topics vary: European Studies 301, 302, 306, 307, 308. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"EUS 305","name":"Introduction to European Studies","description":"The myths, ideas, and sociopolitical realities that underpin the intellectual and cultural construction of Europe. Core course. Three lecture hours a week for one semester.","upper":false},{"key":"EUS 113","name":"Preparation for Study Abroad in Europe","description":"One lecture hour a week for one semester.   May not be counted by students who have previously taken an international learning seminar. Offered on the pass/fail basis only.","upper":false},{"key":"EUS 318Q","name":"Supervised Research","description":"Individual instruction.","upper":false},{"key":"EUS 340M","name":"Continuity and Change in Modern France","description":"Same as French Civilization 340M. Focuses on various social, political, and cultural crises in France from the revolution of 1789 to the present time. Three lecture hours a week for one semester. Only one of the following may be counted: European Studies 340M, French 340T, French Civilization 340M. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: Upper-division standing.","upper":true},{"key":"EUS 350","name":"Governments and Politics of Western Europe","description":"Same as Government 324L. Comparative study of peoples, institutions, parties, interest groups, and bureaucracy in the countries of Western Europe, concentrating on the major political systems of Britain, France, Germany, and Italy. Three lecture hours a week for one semester. European Studies 350 and Government 324L may not both be counted. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"EUS 356","name":"Germany and Europe since 1945","description":"Restricted to students participating in the summer program in Wuerzburg, Germany.  The equivalent of three lecture hours a week for one semester. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"EUS 358Q","name":"Supervised Research","description":"Individual instruction. Prerequisite: Upper-division standing.","upper":true},{"key":"EUS 362","name":"Independent Research in European Studies","description":"Tutorially directed research on a modern European topic. Conference course. Required for the concentration in European studies. May be repeated for credit. Prerequisite: Upper-division standing, admission to the European studies program, and consent of instructor.","upper":true},{"key":"EUS 363","name":"Interdisciplinary Topics in European Studies","description":"An analysis of various aspects of European culture, science, and technology. Three lecture hours a week for one semester.   Only one of the following may be counted unless the topics vary: European Studies 346, 347, 348, 363. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"EUS 375","name":"Capstone Research in European Studies","description":"Supervised research on a modern European topic chosen in consultation with the student's adviser and culminating in a full-length thesis. Individual instruction. Prerequisite: Upper-division standing, admission to the European studies major, and consent of instructor.","upper":true}]