[{"key":"MAS 307","name":"Introduction to Mexican American Cultural Studies","description":"An introduction to the theoretical and substantive issues covered under the interdisciplinary rubric of cultural studies. Explores the Mexican American cultural experience through the methodological approaches of historical analysis, cultural critique, and literary production. Three lecture hours a week for one semester.","upper":false},{"key":"MAS 308","name":"Introduction to Mexican American Policy Studies","description":"An introduction to the basics of policy analysis, employing demographic and empirical information on the Mexican American and Latino populations in the United States. Current policy issues such as bilingual education, affirmative action, the English-only movement, immigration, Latino consumers, Latino entrepreneurship, and NAFTA. Three lecture hours a week for one semester.","upper":false},{"key":"MAS 310 (TCCN: HUMA 1305)","name":"Chicanos in American Society","description":"Same as Sociology 309. Introduction to the study of American character and its bearing on the Chicano experience. Three lecture hours a week for one semester.","upper":false},{"key":"MAS 312 (TCCN: GOVT 2311)","name":"Mexican American Politics","description":"Mexican American political life from 1848 to the present; focuses on Mexican American institutions, values, and political groups. Three lecture hours a week for one semester. Mexican American Studies 312 and 313 may not both be counted. Prerequisite: Three semester hours of lower-division coursework in government.","upper":false},{"key":"MAS 313","name":"Latino Politics","description":"Analysis of issues involving political institutions and policies, with emphasis on Latino politics. Three lecture hours a week for one semester. Mexican American Studies 312 and 313 may not both be counted. Prerequisite: Three semester hours of lower-division coursework in government.","upper":false},{"key":"MAS 314","name":"Mexican American Literature and Culture","description":"Same as English 314V (Topic 3: Mexican American Literature and Culture). Representative Chicano writers and genres, such as poetry, prose fiction, and theatre. Three lecture hours a week for one semester. English 314V (Topic 3) and Mexican American Studies 314 may not both be counted. May not be substituted for English 316L (or 316K), 316M (or 316K), 316N (or 316K), 316P (or 316K). Prerequisite: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"MAS 316","name":"History of Mexican Americans in the United States","description":"Same as History 314K. Examines the origin and growth of the Mexican American community in the United States. Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history.","upper":false},{"key":"MAS 318","name":"Mexican American Culture","description":"Same as Anthropology 318L. Mexican American cultural distinctiveness in the areas of social organization, child rearing, food culture, folklore, language, and religion. Three lecture hours a week for one semester.","upper":false},{"key":"MAS 319","name":"Special Topics","description":"Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary.","upper":false},{"key":"MAS 320L","name":"Texas until 1845","description":"Same as History 320L. A study of Texas from before the European discovery through the exploration and mission periods to status as a Mexican colony and an independent republic. Three lecture hours a week for one semester. Only one of the following may be counted: History 320L, Mexican American Studies 320L, 374 (Topic: Texas until 1845). Three semester hours of Texas history may be substituted for half of the legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"MAS 350","name":"Advanced Grammar and Composition for Bilingual/Bicultural Speakers","description":"Designed for Hispanic bilingual students whose home language is Spanish, but whose dominant language is English. The principal objective is to learn to write correctly and proficiently and to gain a strong cultural perspective on Latin America. The main focus of the course is on writing discourse, but oral language development is also addressed. Three lecture hours a week for one semester. International Business 372 (Topic 8: Business Spanish) and Mexican American Studies 350 may not both be counted. Prerequisite: Spanish 612 or 312L.","upper":true},{"key":"MAS 361","name":"Mexican American Cultural Studies Seminar","description":"Explores cultural studies literature as read through the experience of the Mexican-origin community in the United States. Discussions include race, class, and feminism. Students write a research paper and deliver a scholarly presentation. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and Mexican American Studies 307.","upper":true},{"key":"MAS 362","name":"Mexican American Policy Studies Seminar","description":"Profiles the current economic status of Mexican Americans in the United States. Examines two dimensions of public policy: historical trends and comparisons with other ethnic groups. Students write a policy report and deliver a professional presentation. Three lecture hours a week for one semester. Mexican American Studies 362 and 374 (Topic: Mexican American Public Policy Issues) may not both be counted. Prerequisite: Upper-division standing and Mexican American Studies 308.","upper":true},{"key":"MAS 371","name":"Readings in Mexican American Studies","description":"Supervised readings with parallel work in relevant non-Chicano materials; preparation for Mexican American Studies 372. Individual instruction. Prerequisite: Mexican American Studies 310, 318, and 374; or consent of the director.","upper":true},{"key":"MAS 372","name":"Research Seminar in Mexican American Studies","description":"Supervised research on a Mexican American topic chosen in consultation with adviser and leading to a full-length essay. Individual instruction. Prerequisite: Mexican American Studies 310, 318, and 374; or consent of the director.","upper":true},{"key":"MAS 373","name":"Independent Research","description":"Individual instruction.  May be repeated for credit. Prerequisite: Mexican American Studies 310, 318, and 374; or consent of the director.","upper":true},{"key":"MAS 374","name":"Special Topics","description":"Three lecture hours a week for one semester. Additional hours are required for some topics; these topics are identified in the Course Schedule. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"MAS 375","name":"Internship","description":"Restricted to Mexican American studies majors. Students participate in a nonpartisan, direct-service capacity in a community, civic, or government organization or program that facilitates the economic, political, and social development of the Mexican American community. Under the supervision of a faculty member, students write a report based on the internship project. The equivalent of three lecture hours a week for one semester. Additional weekly meeting times are sometimes required. With consent of the director or academic adviser, may be repeated for credit. Prerequisite: Mexican American Studies 310, 318, and 374; or consent of the director.","upper":true},{"key":"MAS 679H","name":"Honors Tutorial Course","description":"Restricted to Mexican American studies majors. Supervised research, readings, and writing of a substantial paper on a Mexican American studies topic. The equivalent of three lecture hours a week for two semesters. Prerequisite: For 679HA, Mexican American Studies 361, 362, or 372 with a grade of A; admission to the Mexican American Studies Honors Program no later than two semesters before expected graduation; a University grade point average of at least 3.00; and a grade point average in Mexican American studies of at least 3.50; for 679HB, Mexican American Studies 679HA.","upper":true}]