[{"key":"ANS 301M","name":"Introductory Topics in Asian Studies","description":"Discussion of various problems involving language, history, and culture in Asia. Three lecture hours a week for one semester; additional hours may be required for some topics. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary.","upper":false},{"key":"ANS 301R","name":"History of the Religions of Asia","description":"Same as Religious Studies 302. Eastern religions: an introduction to the basic forms and the historical development of the religious traditions of India, China, and Japan. Three lecture hours a week for one semester.","upper":false},{"key":"ANS 302C","name":"Introduction to China","description":"Same as History 302C. Introduction to Chinese civilization, past and present, including religion, literature, arts, philosophy, and history. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 302C, History 302C, 306N (Topic: Introduction to China).","upper":false},{"key":"ANS 302D","name":"Introduction to Korean Culture and History","description":"Introduction to Korea's history, culture, and civilization from antiquity to the present. Three lecture hours a week for one semester. Asian Studies 301M (Topic 10) and 302D may not both be counted.","upper":false},{"key":"ANS 302J","name":"Introduction to Japan","description":"Introduction to Japanese civilization, past and present, including religion, literature, arts, philosophy, and history. Three lecture hours a week for one semester.","upper":false},{"key":"ANS 302K","name":"Introduction to South Asia","description":"Same as Anthropology 310L (Topic 5: Introduction to India). Introduction to Indian and south Asian civilization, past and present, including religion, literature, arts, philosophy, and history. Only one of the following may be counted: Anthropology 310L (Topic 5), Asian Studies 302K, History 306N (Topic: Introduction to India).","upper":false},{"key":"ANS 307C","name":"Introduction to the History of India","description":"Same as History 307C. Survey of the history of the Indian subcontinent from prehistoric times to the present. Three lecture hours a week for one semester.","upper":false},{"key":"ANS 320","name":"Topics in Great Literatures of Asia","description":"Conducted in English. Introduction to various Asian literatures, emphasizing philosophical, religious, and social concepts. Three lecture hours a week for one semester; additional hours may be required for some topics. Asian Studies 320 and 361 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"ANS 321M","name":"Politics in Japan","description":"Same as Government 321M. Survey of postwar Japanese politics; the occupation, governmental institutions, interest groups, protest movements, industrial policy, the government-business relationship, and political and economic reform. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 321M, 361 (Topic: Politics in Japan), Government 321M. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"ANS 322M","name":"Politics in China","description":"Same as Government 322M. Survey of twentieth-century China: historical trends; 1911 revolution; Warlord-Nationalist period; Communist revolution; post-1949 issues; new social and political institutions. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 322M, 361 (Topic: Politics in China), Government 322M. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"ANS 338L","name":"East Asian International Relations","description":"Same as Government 338L. Survey of Russian/Soviet, Japanese, Chinese, and American foreign policies of the twentieth century, emphasizing Pacific-region interests; historical policies; intermittent conflicts, such as China versus Japan, Korean War, Indochina Wars; China's emergence as a nuclear power. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 338L, 361 (Topic: East Asian International Relations), Government 338L. Prerequisite: Upper-division standing and six semester hours of lower-division coursework in government.","upper":true},{"key":"ANS 340","name":"Topics in Asian Religions","description":"Topics in the religions and mythologies of the peoples of Asia. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"ANS 340L","name":"Post-Mao China: Change and Transformation","description":"Same as History 340L. Examines in a historical context the Chinese economy, society, politics, and culture during the reform era that began in the late 1970s. Explores the transformation of rural and urban economies and related social consequences; government systems, political ideologies, and popular values; and China's integration into the global system and its impact on China's role in world politics. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 340L, 361 (Topic: Post-Mao China: Change and Transformation), History 340L, 364G (Topic: Post-Mao China: Change and Transformation). Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 340M","name":"Modern China","description":"Same as History 340M. History of China from the intrusion of the West circa 1500 to the Communist revolution. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 340P","name":"European Expansion in Asia","description":"Same as History 340P. European exploration, the commerce of the East India Companies, and the beginnings of empire in South and Southeast Asia from the fifteenth to the early nineteenth century. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 340R","name":"European Empires in Asia","description":"Same as History 340R. The British in India and Malaya, the Dutch in Indonesia, and the French in Indochina since 1800. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 340S","name":"The Chinese in the United States","description":"Same as Asian American Studies 325 (Topic 3: The Chinese in the United States) and History 340S. A lecture and discussion course on the history of the Chinese in the United States from their first arrival in significant numbers during the California Gold Rush of the mid-nineteenth century to the present. Three lecture hours a week for one semester. Only one of the following may be counted: Asian American Studies 325 (Topic: Chinese in the United States), 325 (Topic 3), Asian Studies 340, History 340S. Partially fulfills the legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 341K","name":"Origins of Modern Japan","description":"Same as History 341K. Japan to the beginnings of the Industrial Revolution, with a focus on the culminating age of samurai rule, the Tokugawa period (1600-1867). Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 341M","name":"Imperial Japan","description":"Same as History 341M. Japan from the Meiji transformation through war, defeat, and occupation. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 341N","name":"Postwar Japan","description":"Same as History 342C. Japan since the war and occupation. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 342D","name":"Political Economy of Japan","description":"Same as History 342D. Historical development of the Japanese economy since early modern times. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 346C","name":"Ancient India","description":"Same as History 346C. History and culture of South Asia from its protohistoric beginnings in the Indus Valley through the period of the early empires of the Mauryas and Guptas. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 346D","name":"Medieval India","description":"Same as History 346D. History and culture of South Asia from approximately 500 to 1500, with emphasis on religious and political institutions and the emergence of regional cultures. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 346M","name":"Early Modern India","description":"Same as History 346M. The history and culture of South Asia from approximately 1500 to 1750. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 346M, History 346M, Religious Studies 341 (Topic 6). Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 347K","name":"Governments and Politics of South Asia","description":"Same as Government 347K. A survey of political developments, governmental organization, and economic and social problems in South Asia. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"ANS 348C","name":"Geography of South Asia","description":"Same as Geography 348C. Natural regions and cultural landscapes of South Asia. Agriculture, urban structure, issues of environment and development. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ANS 361","name":"Topics in Asian Studies","description":"Selected topics in south and east Asian anthropology, economics, history, geography, government, and sociology. Three lecture hours a week for one semester; additional hours may be required for some topics. Asian Studies 320 and 361 may not both be counted unless the topics vary. Some sections offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"ANS 362","name":"Research in Asian Studies","description":"Individual instruction for Asian studies majors and nonmajors. Discussion, research, and the writing of papers about various general and specialized Asian subjects. Conference course.  May be repeated for credit. Prerequisite: Six semester hours of coursework in Asian studies and written consent of instructor on form obtained from the undergraduate adviser.","upper":true},{"key":"ANS 372","name":"Topics in Asian Cultures","description":"Selected topics in south and east Asian art, literature, music, and philosophy. Three lecture hours or two lecture hours and one discussion hour a week for one semester; additional hours may be required for some topics. Some topics partially fulfill legislative requirement for American history. Some sections offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"ANS 678H","name":"Honors Tutorial Course","description":"Three lecture hours a week for two semesters. Prerequisite: For 678HA, credit or registration for Asian Studies 378 and admission to the Asian Studies Honors Program; for 678HB, Asian Studies 678HA.","upper":true},{"key":"ANS 379","name":"Capstone Seminars in Asian Studies","description":"Three lecture hours a week for one semester; additional hours may be required for some topics. Asian Studies 378 and 379 may not both be counted. Some sections offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: For Asian studies majors, twelve semester hours of upper-division coursework in Asian studies; for others, upper-division standing; additional prerequisites vary with the topic.","upper":true},{"key":"ANS 379H","name":"Honors Tutorial Course","description":"Supervised research, readings, and writing of a substantial paper on a particular Asian topic. Conference course. Prerequisite: Upper-division standing, Asian Studies 378 with a grade of at least B, admission to the Asian Studies Honors Program no later than two semesters before expected graduation, a University grade point average of at least 3.00, and a grade point average in Asian studies of at least 3.50.","upper":true}]