[{"key":"CHI 604","name":"Accelerated First-Year Chinese","description":"Designed for students who understand or speak but do not read or write Mandarin Chinese.  Six class hours a week for one semester. Chinese 604 and 506 may not both be counted; Chinese 604 and 507 may not both be counted. Prerequisite: Results on the placement examination in Chinese that indicate that the student is ineligible to receive credit for Chinese 507. If the student is eligible to receive credit by examination for Chinese 506, this credit must not appear on the student's record.","upper":false},{"key":"CHI 506 (TCCN: CHIN 1511)","name":"First-Year Chinese I","description":"Not open to students who understand or speak Mandarin Chinese. Modern Standard Chinese (Mandarin). Six class hours a week for one semester. Chinese 604 and 506 may not both be counted.","upper":false},{"key":"CHI 507 (TCCN: CHIN 1512)","name":"First-Year Chinese II","description":"Not open to native speakers of Chinese. Continuation of Chinese 506. Six class hours a week for one semester. Chinese 604 and 507 may not both be counted. Prerequisite: Chinese 506 with a grade of at least C.","upper":false},{"key":"CHI 612","name":"Accelerated Second-Year Chinese","description":"Continuation of Chinese 604. Six class hours a week for one semester. Chinese 612 and 412K may not both be counted; Chinese 612 and 412L may not both be counted. Prerequisite: Chinese 604 with a grade of at least C.","upper":false},{"key":"CHI 412K","name":"Second-Year Chinese I","description":"Not open to native speakers of Chinese. Modern Standard Chinese (Mandarin). Four class hours a week for one semester. Chinese 612 and 412K may not both be counted. Prerequisite: Chinese 507 with a grade of at least C.","upper":false},{"key":"CHI 412L","name":"Second-Year Chinese II","description":"Not open to native speakers of Chinese. Continuation of Chinese 412K. Four class hours a week for one semester. Chinese 612 and 412L may not both be counted. Prerequisite: Chinese 412K with a grade of at least C.","upper":false},{"key":"CHI 320K","name":"Readings in Modern Chinese I","description":"Readings in expository prose: selections from journals, newspapers, and other sources. Three lecture hours a week for one semester. Prerequisite: Chinese 612 or 412L with a grade of at least C.","upper":true},{"key":"CHI 320L","name":"Readings in Modern Chinese II","description":"Readings in modern fiction, poetry, and drama. Three lecture hours a week for one semester. Prerequisite: Chinese 320K with a grade of at least C.","upper":true},{"key":"CHI 322","name":"Introduction to Classical Chinese","description":"Beginning study of wen yen, the particles, and syntax of the Chinese classics. Three lecture hours a week for one semester. Prerequisite: Chinese 612 or 412L with a grade of at least C.","upper":true},{"key":"CHI 325K","name":"Advanced Conversation I","description":"Not open to native speakers of Chinese. Drill in conversation on general topics. Three lecture hours a week for one semester. Prerequisite: Chinese 412L with a grade of at least C.","upper":true},{"key":"CHI 325L","name":"Advanced Conversation II","description":"Not open to native speakers of Chinese. Practice in speaking Modern Standard Chinese. Three lecture hours a week for one semester. Prerequisite: Chinese 325K with a grade of at least C.","upper":true},{"key":"CHI 326","name":"Business Chinese","description":"Advanced Chinese conversation, with emphasis on business vocabulary. Three lecture hours a week for one semester. Chinese 326 and 330 (Topic: Business Chinese) may not both be counted. Prerequisite: Chinese 612, 320K, or 325K with a grade of at least C.","upper":true},{"key":"CHI 330","name":"Topics in Advanced Chinese","description":"Fourth-year Chinese readings on special topics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Chinese 320K and 320L with a grade of at least C in each.","upper":true},{"key":"CHI 130D","name":"Chinese across Disciplines","description":"Reading and discussion of Chinese language materials related to the subject matter of another designated course in Asian studies. Meetings with the instructor will be devoted to the discussion of linguistic problems, literary features, and crucial passages. Individual instruction. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Upper-division standing, concurrent enrollment in an appropriate Asian studies course, and written consent of instructor on form obtained from the undergraduate adviser.","upper":true},{"key":"CHI 340","name":"Topics in Chinese Literature","description":"Study of Chinese literary texts in the original. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Chinese 320L with a grade of at least C.","upper":true},{"key":"CHI 341","name":"Classical Chinese Poetry","description":"Study of Chinese poetry in the original. Three lecture hours a week for one semester. Chinese 340 (Topic: Classical Chinese Poetry) and 341 may not both be counted. Prerequisite: Chinese 320L with a grade of at least C.","upper":true},{"key":"CHI 360","name":"Conference Course in Chinese Language and Literature","description":"Supervised individual study of selected problems in Chinese language or literature. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and written consent of instructor on form obtained from the undergraduate adviser.","upper":true}]