[{"key":"HIN 604","name":"Accelerated First-Year Hindi","description":"For speakers of Hindi who have not studied it formally. Six lecture hours a week for one semester. Hindi 604 and 506 may not both be counted; Hindi 604 and 507 may not both be counted; Hindi 604 and Urdu 604 may not both be counted; Hindi 604 and Urdu 506 may not both be counted; Hindi 604 and Urdu 507 may not both be counted.","upper":false},{"key":"HIN 506","name":"First-Year Hindi I","description":"Not open to native speakers of Hindi. Modern Hindi of India. Five class hours a week for one semester. Hindi 604 and 506 may not both be counted; Hindi 506 and Urdu 604 may not both be counted.","upper":false},{"key":"HIN 507","name":"First-Year Hindi II","description":"Not open to native speakers of Hindi. Continuation of Hindi 506. Five class hours a week for one semester. Hindi 604 and 507 may not both be counted; Hindi 507 and Urdu 604 may not both be counted. Prerequisite: Hindi 506 with a grade of at least C.","upper":false},{"key":"HIN 612","name":"Accelerated Second-Year Hindi","description":"Continuation of Hindi 604. Six lecture hours a week for one semester. Hindi 612 and 312K may not both be counted; Hindi 612 and 312L may not both be counted. Prerequisite: Hindi 604 with a grade of at least C.","upper":false},{"key":"HIN 312K","name":"Second-Year Hindi I","description":"Not open to native speakers of Hindi. Modern Hindi of India. Three lecture hours a week for one semester. Hindi 612 and 312K may not both be counted. Prerequisite: Hindi 507 with a grade of at least C.","upper":false},{"key":"HIN 312L","name":"Second-Year Hindi II","description":"Not open to native speakers of Hindi. Continuation of Hindi 312K. Three lecture hours a week for one semester. Hindi 612 and 312L may not both be counted. Prerequisite: Hindi 312K with a grade of at least C.","upper":false},{"key":"HIN 118","name":"Practice in Spoken Hindi","description":"Not open to native speakers of Hindi. Instruction and practice in conversation for intermediate-level students. Two lecture hours a week for one semester. Prerequisite: Hindi 507 with a grade of at least C.","upper":false},{"key":"HIN 125","name":"Advanced Practice in Spoken Hindi","description":"Instruction and practice in conversation for advanced students. Two lecture hours a week for one semester. Prerequisite: Hindi 118 with a grade of at least C.","upper":true},{"key":"HIN 330","name":"Topics in Hindi Language and Literature","description":"Study of specific subjects related to Hindi culture as reflected in its literary productions and other modes of expression. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Hindi 312L with a grade of at least C.","upper":true},{"key":"HIN 130D","name":"Hindi Across Disciplines","description":"Reading and discussion of Hindi language materials related to the subject matter of another designated course in Asian studies, with a focus on linguistic and literary features, and crucial passages. One lecture hour a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. May be repeated for credit. Prerequisite: Registration for an appropriate Asian studies course, and written consent of instructor on a form obtained from the undergraduate adviser.","upper":true},{"key":"HIN 332","name":"Style and Register in Hindi","description":"Practicing skills in reading, listening, writing, and speaking in everyday social situations and some formal situations. Relevant for students working toward the \"Advanced\" level on the American Council for the Teaching of Foreign Languages (ACTFL) proficiency scale, and equivalent to level two on the Interagency Language Roundtable (ILR) scale. Three lecture hours a week for one semester. Hindi 330 (Topic: Style and Register in Hindi) and 332 may not both be counted. Prerequisite: Hindi 312L with a grade of at least C.","upper":true},{"key":"HIN 360","name":"Conference Course in Hindi Language and Literature","description":"Supervised individual study of selected problems in Hindi language and literature. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and written consent of instructor on form obtained from the undergraduate adviser.","upper":true}]