[{"key":"JPN 601D","name":"Japanese I","description":"Not open to native speakers of Japanese. Designed for students with no previous coursework in Japanese. Emphasis on basic skills in listening and speaking Japanese and in reading and writing hiragana, katakana, and kanji. Introduction to Japanese culture. Includes computer-assisted instruction. Six lecture hours a week for one semester. Japanese 601D and 506 may not both be counted.","upper":false},{"key":"JPN 506 (TCCN: JAPN 1511)","name":"First-Year Japanese I","description":"Not open to native speakers of Japanese.  Six class hours a week for one semester. Japanese 601D and 506 may not both be counted.","upper":false},{"key":"JPN 507 (TCCN: JAPN 1512)","name":"First-Year Japanese II","description":"Not open to native speakers of Japanese.  Six class hours a week for one semester. Japanese 507 and 610D may not both be counted. Prerequisite: Japanese 506 with a grade of at least C.","upper":false},{"key":"JPN 610D","name":"Japanese II","description":"Not open to native speakers of Japanese. Expands on skills acquired in Japanese 601D or its equivalent. Includes computer-assisted instruction. Six lecture hours a week for one semester. Japanese 507 and 610D may not both be counted. Prerequisite: Japanese 601D or 506 with a grade of at least C.","upper":false},{"key":"JPN 611D","name":"Intermediate Japanese","description":"Not open to native speakers of Japanese. Intermediate level of competency in Japanese to enable students to function in a variety of real-life contexts. Six lecture hours a week for one semester. Japanese 611D and 412K may not both be counted. Japanese 611D and 412L may not both be counted. Prerequisite: Japanese 507 or 610D with a grade of at least C.","upper":false},{"key":"JPN 412K","name":"Second-Year Japanese I","description":"Not open to native speakers of Japanese.  Five class hours a week for one semester. Japanese 611D and 412K may not both be counted. Prerequisite: Japanese 507 or the equivalent with a grade of at least C.","upper":false},{"key":"JPN 412L","name":"Second-Year Japanese II","description":"Not open to native speakers of Japanese.  Five class hours a week for one semester. Japanese 611D and 412L may not both be counted. Japanese 412L and 317C may not both be counted. Prerequisite: Japanese 412K or the equivalent with a grade of at least C.","upper":false},{"key":"JPN 320K","name":"Readings in Modern Japanese I","description":"Not open to native speakers of Japanese. Exploration of different types of texts written in a variety of grammar structures with rich vocabulary. Examination of similarities and differences between various aspects of Japanese culture and the student's own culture. Three lecture hours a week for one semester. Prerequisite: Japanese 412L or 317C with a grade of at least C.","upper":true},{"key":"JPN 320L","name":"Readings in Modern Japanese II","description":"Not open to native speakers of Japanese. Continued development of Japanese reading and comprehension skills using authentic print and web-based resources. Three lecture hours a week for one semester. Prerequisite: Japanese 320K with a grade of at least C.","upper":true},{"key":"JPN 322","name":"Classical Japanese","description":"An introduction to the principal elements of premodern literary or \"classical\" Japanese (bungo), the standard form of the written language. A survey of the principal linguistic features, close reading, and translation of a variety of prose and poetry texts. Three lecture hours a week for one semester. Prerequisite: Japanese 320L with a grade of at least C.","upper":true},{"key":"JPN 325K","name":"Advanced Conversation I","description":"Not open to native speakers of Japanese. Conversations on more complex situations and topics, including formal and informal contexts; designed to continue students' development of conversation skills taught in Japanese 412L and 317C. Three lecture hours a week for one semester. Prerequisite: Japanese 412L or 317C with a grade of at least C.","upper":true},{"key":"JPN 325L","name":"Advanced Conversation II","description":"Not open to native speakers of Japanese. Continued development of conversation skills taught in Japanese 325K. Three lecture hours a week for one semester. Prerequisite: Japanese 325K with a grade of at least C.","upper":true},{"key":"JPN 326","name":"Business Japanese","description":"Not open to native speakers of Japanese. Development of basic business manners and business-related vocabulary and conversation skills appropriate in an office environment. Three lecture hours a week for one semester. Prerequisite: Japanese 412L or 317C with a grade of at least C.","upper":true},{"key":"JPN 327","name":"Advanced Reading and Writing of Kanji Characters","description":"Not open to native speakers of Japanese. Building more advanced vocabulary and kanji knowledge through systematic study (recognition, reading, and writing) of kanji. Three lecture hours a week for one semester. Prerequisite: Japanese 412L or 317C with a grade of at least C.","upper":true},{"key":"JPN 330","name":"Topics in Advanced Japanese","description":"Not open to native speakers of Japanese. Fourth-year Japanese readings on special topics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Japanese 320L with a grade of at least C.","upper":true},{"key":"JPN 130D","name":"Japanese across Disciplines","description":"Reading and discussion of Japanese language materials related to the subject matter of another designated course in Asian studies. Meetings with the instructor will be devoted to the discussion of linguistic problems, literary features, and crucial passages. Individual instruction. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Upper-division standing, concurrent enrollment in an appropriate Asian studies course, and written consent of instructor on form obtained from the undergraduate adviser.","upper":true},{"key":"JPN 360","name":"Conference Course in Japanese Language and Literature","description":"Not open to native speakers of Japanese. Supervised individual study of selected problems in Japanese language or literature. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing, six semester hours of upper-division coursework in Japanese, and written consent of instructor on form obtained from the undergraduate adviser.","upper":true}]