[{"key":"KOR 604","name":"Accelerated First-Year Korean","description":"Designed for students who understand or speak but do not read or write Korean. Not open to native speakers of Korean.  Six class hours a week for one semester. Korean 604 and 506 may not both be counted; Korean 604 and 507 may not both be counted. Prerequisite: Results on the placement examination in Korean that indicate that the student is ineligible to receive credit for Korean 507. If the student is eligible to receive credit by examination for Korean 506, this credit must not appear on the student's record.","upper":false},{"key":"KOR 506 (TCCN: KORE 1511)","name":"First-Year Korean I","description":"Not open to native speakers of Korean.  Five class hours a week for one semester. Korean 604 and 506 may not both be counted.","upper":false},{"key":"KOR 507 (TCCN: KORE 1512)","name":"First-Year Korean II","description":"Not open to native speakers of Korean. Continuation of Korean 506. Five class hours a week for one semester. Korean 604 and 507 may not both be counted. Prerequisite: Korean 506 with a grade of at least C.","upper":false},{"key":"KOR 612","name":"Accelerated Second-Year Korean","description":"Not open to native speakers of Korean. Continuation of Korean 604. Six class hours a week for one semester. Korean 612 and 412K may not both be counted; Korean 612 and 412L may not both be counted. Prerequisite: Korean 604 with a grade of at least C.","upper":false},{"key":"KOR 412K","name":"Second-Year Korean I","description":"Not open to native speakers of Korean.  Four lecture hours a week for one semester. Korean 612 and 412K may not both be counted. Prerequisite: Korean 507 with a grade of at least C.","upper":false},{"key":"KOR 412L","name":"Second-Year Korean II","description":"Not open to native speakers of Korean.  Four lecture hours a week for one semester. Korean 612 and 412L may not both be counted. Prerequisite: Korean 412K with a grade of at least C.","upper":false},{"key":"KOR 320K","name":"Third-Year Korean I","description":"Three lecture hours a week for one semester. Prerequisite: Korean 612 or 412L with a grade of at least C.","upper":true},{"key":"KOR 320L","name":"Third-Year Korean II","description":"Three lecture hours a week for one semester. Prerequisite: Korean 320K with a grade of at least C.","upper":true},{"key":"KOR 330","name":"Topics in Advanced Korean","description":"Fourth-year Korean readings on special topics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Korean 320L with a grade of at least C.","upper":true},{"key":"KOR 360","name":"Conference Course in Korean Language and Literature","description":"Supervised individual study of selected problems in Korean language or literature. Conference course.  May be repeated for credit. Prerequisite: Korean 412K and written consent of instructor on form obtained from the undergraduate adviser.","upper":true}]