[{"key":"SAN 506","name":"First-Year Sanskrit I","description":"Introduction to basic grammatical principles, with reading of Ramayana episodes as illustrations. Five class hours a week for one semester.","upper":false},{"key":"SAN 507","name":"First-Year Sanskrit II","description":"Detailed study of problems of grammar and syntax; reading of extracts from Hitopadesha and the Bhagavad Gita. Five class hours a week for one semester. Prerequisite: Sanskrit 506 with a grade of at least C.","upper":false},{"key":"SAN 312K","name":"Second-Year Sanskrit I","description":"Introduction to classical Sanskrit prose literature; readings from the Epics and Kathasaritsagara. Three lecture hours a week for one semester. Prerequisite: Sanskrit 507 with a grade of at least C.","upper":false},{"key":"SAN 312L","name":"Second-Year Sanskrit II","description":"Introduction to classical Sanskrit poetry and philosophical literature; readings from the Upanishads and Kalidasa's Meghaduta. Three lecture hours a week for one semester. Prerequisite: Sanskrit 312K with a grade of at least C.","upper":false},{"key":"SAN 325K","name":"Advanced Sanskrit Readings and Composition I","description":"Three lecture hours a week for one semester. Prerequisite: Sanskrit 312L with a grade of at least C.","upper":true},{"key":"SAN 325L","name":"Advanced Sanskrit Readings and Composition II","description":"Three lecture hours a week for one semester. Prerequisite: Sanskrit 325K with a grade of at least C.","upper":true},{"key":"SAN 330","name":"Topics in Sanskrit Language and Literature","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Sanskrit 312L with a grade of at least C.","upper":true},{"key":"SAN 360","name":"Conference Course in Sanskrit Language and Literature","description":"Supervised individual study of selected problems in Sanskrit language or literature. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing, Sanskrit 312L, and written consent of instructor on form obtained from the undergraduate adviser.","upper":true}]