[{"key":"TEL 604","name":"Accelerated First-Year Telugu","description":"Six lecture hours a week for one semester. Telugu 604 and 506 may not both be counted; Telugu 604 and 507 may not both be counted.","upper":false},{"key":"TEL 506","name":"First-Year Telugu I","description":"Not open to native speakers of Telugu.  Five class hours a week for one semester. Telugu 604 and 506 may not both be counted.","upper":false},{"key":"TEL 507","name":"First-Year Telugu II","description":"Not open to native speakers of Telugu.  Five class hours a week for one semester. Telugu 604 and 507 may not both be counted. Prerequisite: Telugu 506 with a grade of at least C.","upper":false},{"key":"TEL 612","name":"Accelerated Second-Year Telugu","description":"Continuation of Telugu 604. Six lecture hours a week for one semester. Telugu 612 and 312K may not both be counted; Telugu 612 and 312L may not both be counted. Prerequisite: Telugu 604.","upper":false},{"key":"TEL 312K","name":"Second-Year Telugu I","description":"Not open to native speakers of Telugu.  Three lecture hours a week for one semester. Telugu 612 and 312K may not both be counted. Prerequisite: Telugu 507 with a grade of at least C.","upper":false},{"key":"TEL 312L","name":"Second-Year Telugu II","description":"Not open to native speakers of Telugu.  Three lecture hours a week for one semester. Telugu 612 and 312L may not both be counted. Prerequisite: Telugu 312K with a grade of at least C.","upper":false},{"key":"TEL 118K","name":"Practice in Spoken Telugu","description":"Not open to native speakers of Telugu. Instruction and practice in conversation for intermediate-level students. Two lecture hours a week for one semester. Prerequisite: Telugu 507 with a grade of at least C.","upper":false},{"key":"TEL 118L","name":"Practice in Spoken Telugu II","description":"Not open to native speakers of Telugu. Instruction and practice in conversation for intermediate-level students. Two lecture hours a week for one semester. Prerequisite: Telugu 312K or 118K with a grade of at least C.","upper":false},{"key":"TEL 330","name":"Telugu Language and Literature","description":"Three lecture hours a week for one semester. Prerequisite: Telugu 312L with a grade of at least C.","upper":true},{"key":"TEL 360","name":"Conference Course in Telugu Language and Literature","description":"Individual instruction.  May be repeated for credit. Prerequisite: Upper-division standing and written consent of instructor on form obtained from the undergraduate adviser.","upper":true}]