[{"key":"URD 604","name":"Accelerated First-Year Urdu","description":"Designed for students who have some knowledge of spoken Urdu but have not studied Urdu formally. Six lecture hours a week for one semester. Hindi 604 and Urdu 604 may not both be counted; Hindi 506 and Urdu 604 may not both be counted; Hindi 507 and Urdu 604 may not both be counted; Urdu 604 and 506 may not both be counted; Urdu 604 and 507 may not both be counted.","upper":false},{"key":"URD 506","name":"First-Year Urdu I","description":"Not open to native speakers of Urdu.  Five class hours a week for one semester. Urdu 604 and 506 may not both be counted.","upper":false},{"key":"URD 507","name":"First-Year Urdu II","description":"Not open to native speakers of Urdu.  Five class hours a week for one semester. Urdu 604 and 507 may not both be counted. Prerequisite: Urdu 506 with a grade of at least C.","upper":false},{"key":"URD 612","name":"Accelerated Second-Year Urdu","description":"Continuation of Urdu 604. Six lecture hours a week for one semester. Urdu 612 and 312K may not both be counted; Urdu 612 and 312L may not both be counted. Prerequisite: Urdu 604 with a grade of at least C.","upper":false},{"key":"URD 312K","name":"Second-Year Urdu I","description":"Not open to native speakers of Urdu. Introduction to the Urdu script, followed by Urdu reading, composition, and conversation. Three lecture hours a week for one semester. Urdu 612 and 312K may not both be counted. Prerequisite: Urdu 507 with a grade of at least C.","upper":false},{"key":"URD 312L","name":"Second-Year Urdu II","description":"Not open to native speakers of Urdu. Continuation of Urdu 312K. Three lecture hours a week for one semester. Urdu 612 and 312L may not both be counted. Prerequisite: Urdu 312K with a grade of at least C.","upper":false},{"key":"URD 118K","name":"Practice in Spoken Urdu I","description":"Not open to native speakers of Urdu. Instruction and practice in conversation for intermediate-level students. Two lecture hours a week for one semester. Prerequisite: Urdu 507 with a grade of at least C.","upper":false},{"key":"URD 118L","name":"Practice in Spoken Urdu II","description":"Not open to native speakers of Urdu.  Two lecture hours a week for one semester. Prerequisite: Urdu 118K with a grade of at least C.","upper":false},{"key":"URD 330","name":"Topics in Urdu Language and Literature","description":"Study of specific subjects related to Urdu culture as reflected in literary productions and other modes of expression. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Urdu 312L with a grade of at least C.","upper":true},{"key":"URD 130D","name":"Urdu Across Disciplines","description":"Reading of Urdu language materials related to the subject matter of another designated course in Asian studies. One lecture hour a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. May be repeated for credit. Prerequisite: Registration for an appropriate Asian studies course, and written consent of instructor on form obtained from the undergraduate adviser.","upper":true},{"key":"URD 332","name":"Style and Register in Urdu","description":"Practice of skills in reading, listening, writing, and speaking for everyday social situations and some formal situations. Relevant to students working toward the \"Advanced\" level on the American Council for the Teaching of Foreign Languages (ACTFL) proficiency scale, equivalent to level 2 on the Interagency Language Roundtable (ILR) scale. Three lecture hours a week for one semester. Urdu 330 (Topic: Style and Register in Urdu) and 332 may not both be counted. Prerequisite: Urdu 312L with a grade of at least C.","upper":true},{"key":"URD 360","name":"Conference Course in Urdu Language and Literature","description":"Supervised individual study of selected problems in Urdu language or literature. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and written consent of instructor on form obtained from the undergraduate adviser.","upper":true}]