[{"key":"HMN 101","name":"Community Service","description":"Tutorial course, in which the student submits a report based on a community service project and appropriate supplementary reading. Conference course. Prerequisite: Consent of the humanities adviser.","upper":false},{"key":"HMN 305","name":"Freshman Seminar","description":"Reading, discussion, writing, and oral reporting on various humanities topics. Three lecture hours a week for one semester. Humanities 305 and Liberal Arts Honors 305 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Offered on the letter-grade basis only. Prerequisite: Advanced placement credit for Rhetoric and Writing 306 or the equivalent.","upper":false},{"key":"HMN 318Q","name":"Supervised Research","description":"Individual instruction. Prerequisite: Consent of the humanities adviser.","upper":false},{"key":"HMN 321","name":"Humanism and Western Civilization: The Ancient World","description":"A history of humanism in ancient Greece and Rome. The contributions of humanism to the values we place on the individual and human potential, democratic government, the arts, religion, and the family. Three lecture hours a week for one semester. Prerequisite: Upper-division standing or consent of instructor.","upper":true},{"key":"HMN 322","name":"Humanism and Western Civilization: The Renaissance","description":"A history of humanism during the European Renaissance, the thirteenth through the sixteenth century. The contributions of humanism to the values we place on the individual and human potential, democratic government, the arts, religion, and the family. Three lecture hours a week for one semester. Prerequisite: Upper-division standing or consent of instructor.","upper":true},{"key":"HMN 323","name":"Humanism and Western Civilization: The Enlightenment","description":"A history of humanism during the Enlightenment. The contributions of humanism to the values we place on the individual and human potential, democratic government, the arts, religion, and the family. Three lecture hours a week for one semester. Prerequisite: Upper-division standing or consent of instructor.","upper":true},{"key":"HMN 350","name":"Topics in the Humanities","description":"Study of the values underlying humanistic disciplines. Three lecture hours a week for one semester. Some sections may be offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"HMN 358Q","name":"Supervised Research","description":"Individual instruction.  May be repeated for credit. Prerequisite: Consent of the humanities adviser.","upper":true},{"key":"HMN 370","name":"Senior Tutorial Course","description":"A tutorial program of supervised reading and writing, including an individual paper or papers in which the student draws together the central directions and discoveries of his or her studies in the humanities. Three lecture hours a week for one semester. Humanities 370 and 679HB may not both be counted. Prerequisite: Consent of the humanities adviser.","upper":true},{"key":"HMN 379","name":"Conference Course","description":"Individual instruction in a topic approved by the instructor and the humanities adviser. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of the humanities adviser.","upper":true},{"key":"HMN 679H","name":"Honors Tutorial Course","description":"Directed reading and research, followed by the writing of a report or the creation of a project. Conference course for two semesters. Humanities 370 and 679HB may not both be counted. Prerequisite: For 679HA, admission to the Humanities Honors Program and consent of the humanities adviser; for 679HB, Humanities 679HA.","upper":true}]