[{"key":"J S 301","name":"Introduction to Jewish Studies","description":"Jewish literature and Jewish thought, comprising a general introduction to biblical, rabbinic, philosophic, and literary Jewish texts from the sixth century BC to the twenty-first century CE. Emphasis on hermeneutics (interpretation). Three lecture hours a week for one semester.","upper":false},{"key":"J S 304M","name":"Jewish Civilization: Beginnings to 1492","description":"Same as History 306N (Topic 10: Jewish Civilization: Beginnings to 1492) and Religious Studies 313M. Introduction to the history, culture, and religion of the Jewish people from around 1000 BC to the end of the medieval period. Subjects may include ancient Israel, late Second Temple sectarianism, the rise of Christianity, rabbinic Judaism, medieval Jewish philosophy, Jewish mysticism, and Hebrew poetry. Three lecture hours a week for one semester. Only one of the following may be counted: History 306N (Topic: Jewish Civilization I), 306N (Topic 10), Jewish Studies 304M, 311 (Topic: Jewish Civilization I), Religious Studies 313 (Topic: Jewish Civilization I), 313M.","upper":false},{"key":"J S 304N","name":"Jewish Civilization: 1492 to the Present","description":"Same as History 306N (Topic 11: Jewish Civilization: 1492 to the Present) and Religious Studies 313N. Subjects may include trends toward secularization, the emancipation of European Jewry, the emergence of American Jewry, the Holocaust, the establishment of the State of Israel, and the Arab-Israeli conflict. Three lecture hours a week for one semester. Only one of the following may be counted: History 306N (Topic 11), Jewish Studies 304N, 311 (Topic: Jewish Civilization: 1492 to the Present), Religious Studies 313 (Topic: Jewish Civilization: 1492 to the Present), 313N.","upper":false},{"key":"J S 311","name":"Topics in Jewish Studies","description":"Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":false},{"key":"J S 361","name":"Topics in Jewish Studies","description":"Three lecture hours a week for one semester; additional hours may be required for some topics.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"J S 362","name":"Independent Research in Jewish Studies","description":"Tutorially directed research in Jewish studies. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"J S 363","name":"Topics in the Humanities and Arts","description":"Three lecture hours a week for one semester; additional hours may be required for some topics. Jewish Studies 361 and 363 may not both be counted unless the topics vary. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"J S 364","name":"Topics in History","description":"Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"J S 365","name":"Topics in the Social Sciences","description":"Three lecture hours a week for one semester; additional hours may be required for some topics. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"J S 375","name":"Senior Seminar","description":"Intensive study and research on selected topics in Jewish studies, with on-going, in-class presentations for critique by fellow students and the instructor. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and consent of the Jewish studies adviser.","upper":true},{"key":"J S 679H","name":"Honors Tutorial Course","description":"Restricted to Jewish studies majors. Supervised individual reading and research for one semester, followed by writing a substantial honors thesis during the second semester. Conference course for two semesters. Prerequisite: For 679HA, admission to the Jewish Studies Honors Program; for 679HB, Jewish Studies 679HA.","upper":true}]