[{"key":"LEB 320F","name":"Foundations of the Legal Environment of Business","description":"Restricted to non-McCombs School of Business majors. Not open to law students. Introduction to the legal problems confronting businesses in the global environment. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Business Administration degree. Prerequisite: Upper-division standing.","upper":true},{"key":"LEB 323","name":"Business Law and Ethics","description":"Restricted to students in a McCombs School of Business major. An investigation of the role of law in society; introduction to legal reasoning, dispute resolution, judicial process, constitutional law, agency, torts, government regulations; business ethics; study of contracts. Three lecture hours a week for one semester. Legal Environment of Business 323 and 323H may not both be counted.","upper":true},{"key":"LEB 323H","name":"Business Law and Ethics: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. An investigation of the role of law in society; introduction to legal reasoning, dispute resolution, judicial process, constitutional law, agency, torts, government regulations; business ethics; study of contracts. Three lecture hours a week for one semester. Legal Environment of Business 323 and 323H may not both be counted. Prerequisite: Upper-division standing, ninety semester hours of college coursework, Accounting 312 or 312H, and credit or registration for Business Administration 324 or 324H.","upper":true},{"key":"LEB 361","name":"Law of Business Organizations","description":"Restricted to students in a business major. Study of basic legal principles of business organizations and operations, including practical comparison and assessment of advantages and disadvantages of different types of organization. Three lecture hours a week for one semester. Prerequisite: Thirty semester hours of undergraduate coursework, or consent of instructor.","upper":true},{"key":"LEB 363","name":"Real Estate Law","description":"An examination of law pertaining to estates and interests in land, conveyances and mortgages, brokers, easements, contracts, default and foreclosure. Three lecture hours a week for one semester. Prerequisite: Thirty semester hours of undergraduate coursework, or consent of instructor.","upper":true},{"key":"LEB 366","name":"Commercial Transactions","description":"Restricted to students in a business major. Applied business transactions, with emphasis on the Uniform Commercial Code; emphasis on bailments, sales of goods, commercial paper, bank-customer relationships, creditor security devices, and bankruptcy. Three lecture hours a week for one semester. Prerequisite: Thirty semester hours of undergraduate coursework, or consent of instructor.","upper":true},{"key":"LEB 370","name":"Topics in the Legal Environment of Business","description":"Selected topics on legal constraints affecting managerial decision making and business behavior. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Thirty semester hours of undergraduate coursework, or consent of instructor.","upper":true}]