[{"key":"ARH 301 (TCCN: ARTS 1301)","name":"Introduction to the Visual Arts","description":"The visual elements, their nature, functions, and relationships in painting, sculpture, and architecture. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"ARH 302 (TCCN: ARTS 1303)","name":"Survey of Ancient through Medieval Art","description":"A study of the major monuments of architecture, sculpture, painting, and metalwork from the ancient period through the end of the Middle Ages. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"ARH 303 (TCCN: ARTS 1304)","name":"Survey of Renaissance through Modern Art","description":"A study of the major monuments of architecture, sculpture, painting, and metalwork from the Renaissance to the present. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"ARH 304","name":"Issues in Visual Culture","description":"Restricted to majors in the Department of Art and Art History. Examines the modern and contemporary history of art and visual culture in relation to a broader set of problems fundamental to visual representation throughout the history of art. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"ARH 325","name":"Art and Archaeology of the Ancient Near East","description":"Examines various aspects of material culture, including the rise of monumentality and urbanism; media such as writing and figurative arts; and the history and politics of archaeological research in the area of the Fertile Crescent, Turkey, and Iran. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 325, 361L (Topic: Art/Archeology of the Ancient Near East), Middle Eastern Studies 320 (Topic: Art/Archeology of the Ancient Near East), 320 (Topic 4: Survey of Ancient Near Eastern Art).","upper":true},{"key":"ARH 326J","name":"The Parthenon Through the Ages","description":"Examines why the Parthenon is of relevance today for a global audience. Subjects include the postantique lives of this unique monument as a Christian cathedral and pilgrimage site, a mosque, a ruin, and an archaeological icon; the various debates about its restoration and preservation; and the problem of cultural ownership. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 326J, 362 (Topic: Parthenon through the Ages), Classical Civilization 340 (Topic: Parthenon through the Ages).","upper":true},{"key":"ARH 326K","name":"Myth and Images in the Greek and Roman Mediterranean","description":"Examines various methods of interpretation, such as archaeological and art historical analysis of mythical Greek and Roman narratives as they appear in visual arts of antiquity. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 326K, 362 (Topic: Myth in Images in Classical Antiquity), Classical Civilization 340 (Topic: Myth in Images in Classical Antiquity).","upper":true},{"key":"ARH 326L","name":"Visual Cultures of the Mediterranean Islands","description":"Analysis of material and visual culture and the divergent histories of archaeology and art history in Cyprus, Crete, and Sicily. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 326M","name":"Art and Archaeology of Greek Sanctuaries","description":"Examines the archaeology of Olympia, Delphi, Dodona, Delos, and Samos, their global relevance today, and the history of archaeological research. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 326M, 362 (Topic: Art and Archaeology of Greek Sanctuaries), Classical Civilization 340 (Topic: Art and Archaeology of Greek Sanctuaries).","upper":true},{"key":"ARH 326N","name":"Hellenistic Art and Architecture","description":"Three lecture hours a week for one semester. Art of the Hellenistic period, from the reign of Alexander the Great to the beginning of the Roman Empire, ca. 336 to 31 BCE. Art History 326N and 327M may not both be counted.","upper":true},{"key":"ARH 327N","name":"Art and Politics in Imperial Rome","description":"Same as Classical Civilization 340 (Topic 2: Roman Art). Public art of the Roman Empire from Augustus to late antiquity, ca. 31 BC to AD 350. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"ARH 327P","name":"Roman Imperial Architecture","description":"Republican and imperial Roman architecture. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 327R","name":"Art in the Lives of Ordinary Romans","description":"Art and architecture from the archaeological sites of Pompeii, Herculaneum, and Ostia as indices of Roman culture, 100 BC to AD 250. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 327S","name":"Art and Politics in Republican Rome","description":"The art and architecture of republican Rome, ca. 500-44 BCE, when the city established dominance in the Mediterranean and developed an artistic tradition that would flourish into the Empire. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 327S, 362 (Topic: Art and Politics in Republican Rome), Classical Civilization 340 (Topic: Art and Politics in Republican Rome), European Studies 347 (Topic: Art and Politics in Republican Rome).","upper":true},{"key":"ARH 327T","name":"Art in the Age of Hadrian","description":"Examines art in Rome under the reign of emperor Hadrian (117-138), who inherited the empire at its greatest geographical extent. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 328K","name":"Arts of Islam 1500-Present","description":"Same as Religious Studies 358 (Topic 18). Later Islamic art and architecture, beginning with the world empires of the Ottomans, Safavids, and Mughals, and extending into the modern and contemporary periods. Subjects include the social and historical context of Islamic art in these periods and its unique visual culture. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 328K, 363 (Topic: Arts of Islam, 1500-1800), 363 (Topic: Arts of Islam: 1500-Present), Islamic Studies 372 (Topic: Arts of Islam, 1500-1800), 373 (Topic: Arts of Islam: 1500-Present), Middle Eastern Languages and Cultures 321 (Arts of Islam: 1500-Present), Middle Eastern Studies 321K (Topic: Arts of Islam, 1500-1800), 342 (Topic: Arts of Islam: 1500-Present), Religious Studies 358 (Topic 18).","upper":true},{"key":"ARH 329J","name":"Byzantine Art","description":"Same as Religious Studies 357 (Topic 2: Byzantine Art). Examination of the medieval art and architecture of the eastern Roman empire, including related traditions (Coptic, Armenian, Georgian, Crusader, Norman). Three lecture hours a week for one semester.","upper":true},{"key":"ARH 329K","name":"Early Medieval Art","description":"Architecture, sculpture, painting, and metalwork in western Europe from the third to the eleventh century. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 329N","name":"Art and Architecture of Late Antiquity","description":"Examination of early Christian and late Roman art and architecture, including related traditions, such as Jewish, Coptic, Armenian, Georgian, Persian,and Syriac. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 329N, 362R (Topic: Art and Architecture of Late Antiquity), Classical Civilization 340 (Topic: Art and Architecture of Late Antiquity). Prerequisite:","upper":true},{"key":"ARH 329P","name":"Medieval Italy","description":"Architecture, sculpture, painting, and metalwork in the Italian peninsula from the third to the fourteenth century, with a special focus on Rome, Venice, and Palermo. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 329R","name":"Romanesque Art and Architecture","description":"Form and function of religious art in twelfth-century Europe. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 330G","name":"Art at Court: The Gothic Period","description":"Changing manifestations of Gothic art and architecture at selected court centers, 1140 to 1400. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 330J","name":"Gothic Cathedral: Amiens","description":"Same as Religious Studies 357 (Topic 14). An examination of the cathedral at Amiens, its meaning, structure, political and financial contexts, and sculptural programs, as well as its influence on other buildings in France and Germany. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 330J, 374 (Topic: Gothic Cathedral: Amiens), European Studies 347 (Topic: Gothic Cathedral: Amiens), Religious Studies 357 (Topic: Gothic Cathedral: Amiens), 357 (Topic 14).","upper":true},{"key":"ARH 331J","name":"Art and Experience in Central Italy","description":"Restricted to students admitted to the Learning Tuscany program. Art and architecture of central Italy. The equivalent of three lecture hours a week for one semester. Taught in Castiglion Fiorentino, Italy. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 331K","name":"Early Italian Renaissance Art to 1470","description":"This course traces the beginnings of the \"rebirth\" (renaissance) of the visual arts, from the end of the Middle Ages to the heyday of the Medici. Works of art are analyzed both in formal terms and in relation to contemporary society, religion, philosophy, economics, statecraft, gender, and other significant issues. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 331L","name":"High Renaissance Art","description":"Analyzes the key artistic works of the high Renaissance as part of an evolving language of style and form and in relation to the intellectual, social, and political context of the period. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 331M","name":"Mannerist and Early Baroque Art","description":"The art of western Europe from about 1520 to 1590. Emphasis on art in Italy, but developments in the northern countries are also considered. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 331P","name":"Art and the City in Renaissance Italy","description":"Art, architecture, and emerging civic identity in Florence, Siena, Venice, and other Italian Renaissance city-states. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 331P, 364 (Topic: Art and the City in Renaissance Italy), Core Texts and Ideas 375 (Topic: Art and the City in Renaissance Italy), European Studies 347 (Topic: Art and the City in Renaissance Italy), Italian Civilization 349 (Topic: Art and the City in Renaissance Italy), Western Civilization 320 (Topic: Art and the City in Renaissance Italy).","upper":true},{"key":"ARH 331Q","name":"Art in Medici Florence","description":"Explores the social and cultural fabric of Florence before and after the rise to power of the Medici family beginning in the early fifteenth century. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 333K","name":"Italian Baroque Art","description":"The art of Italy in the seventeenth and eighteenth centuries; includes the sixteenth-century sources from which Roman baroque developed. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 333L","name":"The Age of Rembrandt and Rubens: Northern Baroque Art","description":"Same as Religious Studies 357 (Topic 11). Northern European art in the seventeenth century, stressing the Netherlands and Flanders. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 333L, European Studies 347 (Topic: The Age of Rembrandt and Rubens: Northern Baroque Art), Religious Studies 357 (Topic: The Age of Rembrandt and Rubens: Northern Baroque Art), 357 (Topic 11).","upper":true},{"key":"ARH 334","name":"Eighteenth-Century European Art","description":"European painting, sculpture, and architecture as social and political events from the age of absolutism to the French Revolution. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 335H","name":"Buddhist Traditions and Nineteenth-Century Art","description":"Examines the extent to which Buddhism and Buddhist art influenced artists and Western culture in the nineteenth century, especially in the development of modernism. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 335J","name":"Nineteenth-Century Art","description":"Examines European art and themes in art during the nineteenth century. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 337K","name":"Twentieth-Century European Art to 1940","description":"Major movements in the development of modern European painting and sculpture. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 338L","name":"Art since 1930: Modernism and Mass Modernity","description":"Avant-garde activity, primarily painting, photography, and film, in the United States and Europe from 1930 to 1970. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 338M","name":"Art and Culture: 1968 and After","description":"Artistic and critical activity in the United States and Europe from 1968 to the present. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 338N","name":"Sculpture as Model in the Twentieth Century","description":"Examines the inherent problems in making and interpreting sculpture in the twentieth century in the United States and Europe. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 339J","name":"American Art: Colonial Era to the Civil War","description":"Painting, sculpture, and architecture from the early seventeenth century to 1860. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 339K","name":"American Art: Civil War to the Armory Show","description":"Painting, sculpture, and architecture from 1860 to 1913. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 339L","name":"Twentieth-Century American Art to the 1950s","description":"Art in the United States from the Armory Show through abstract expressionism. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 339N","name":"Painting in America to 1860","description":"Same as American Studies 325 (Topic 2). Painting in British colonial North America and the United States prior to the Civil War. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 325 (Topic 2), Art History 339N, 374 (Topic 1).","upper":true},{"key":"ARH 339Q","name":"Modernism in American Design and Architecture","description":"Same as American Studies 330 and Urban Studies 352 (Topic 5). A historical survey of artifacts, buildings, and urban environments, focusing on responses to machine-age civilization. Prerequisite: Upper-division standing.","upper":true},{"key":"ARH 340L","name":"History of Photography","description":"The history of photography, including major historic processes, influential photographers, critical debates, and the significant social, political, and economic circumstances that shaped the development of the medium and the diverse works that were created since its origins in the nineteenth century. Three lecture hours a week for one semester. Art History 340L and 366N (Topic: History of Photography) may not both be counted.","upper":true},{"key":"ARH 341J","name":"Nineteenth-Century Latin American Art","description":"Art of the nineteenth century in Latin America, including Argentina, Brazil, Colombia, Chile, Mexico, Paraguay, Peru, Uruguay, Venezuela, and the Caribbean. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 341J, 361 (Topic: Reframing the Nation: Nineteenth-Century Latin American Art), Latin American Studies 327 (Topic: Reframing the Nation: Nineteenth-Century Latin American Art).","upper":true},{"key":"ARH 341K","name":"Modern Art of Mexico","description":"Same as Latin American Studies 327 (Topic 2: Modern Art of Mexico). Mexican visual culture from the late nineteenth century through 1968. Emphasis on the emergence of modernist avant-gardes and popular entertainment, and their ambivalent relationship to state, church, and market. Also explores how self-consciously negotiating the tension between native and international influences, artists, critics, and curators contributes to notions of Lo Mexicano, or \"Mexicanness.\"","upper":true},{"key":"ARH 341L","name":"Chicano Art Histories and Futures","description":"Same as Latin American Studies 327 (Topic 1: Modern Latin American Art). Mexican American art since the 1960s, with an emphasis on the visual production and exhibition of identity inside and outside the Chicano civil rights movement and the politics of U.S. multiculturalism. An introduction to a broad range of art history written to date--including recent feminist and queer interventions--as a means of envisioning a supposed \"post-Chicano\" or \"post-racial\" moment. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 341M","name":"Contemporary Mexican Art","description":"Survey of visual culture beginning in the 1950s and 1960s, with a focus on key artists, exhibition spaces, and critical debates from the last thirty years in Mexico in light of international aesthetic currents and shifting political and economic conditions. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 341N","name":"Other Modernities: Latin American Art","description":"Development and sources of twentieth-century art in the Caribbean and Central and South America. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 341N, 361 (Topic: Other Modernities: Latin American Art), Latin American Studies 327 (Topic: Other Modernities: Latin American Art), Mexican American Studies 374 (Topic: Other Modernities: Latin American Art).","upper":true},{"key":"ARH 341P","name":"Contemporary Latin American Art","description":"Development and sources of art in the Caribbean and Central and South America from the 1960s to the present. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 341P, 361 (Topic: Contemporary Latin American Art), Latin American Studies 327 (Topic: Contemporary Latin American Art).","upper":true},{"key":"ARH 341Q","name":"Women in Latin American Art","description":"Development and sources of Latin American Women Artists considering feminist, gender and queer theories Three lecture hours a week for one semester. Only one of the following may be counted: Art History 341Q, 361 (Topic: From Modern to Conceptual: Women Artists in Latin America), Women's and Gender Studies 340 (Topic: From Modern to Conceptual: Women Artists in Latin America).","upper":true},{"key":"ARH 342J","name":"Introduction to Women's and Gender Studies in the Fine Arts","description":"An introduction to women's studies and gender studies in relation to visual, theatrical, and musical culture in the United States and Europe. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 342J, 359 (Topic: Intro to Women's and Gender Studies in the Fine Arts), Fine Arts 350 (Topic: Intro to Women's and Gender Studies in the Fine Arts), Women's and Gender Studies 345 (Topic: Intro to Women's and Gender Studies in the Fine Arts).","upper":true},{"key":"ARH 344J","name":"Twentieth-Century African American Art","description":"Same as African and African Diaspora Studies 374F (Topic 19). A survey of visual art produced by people of African descent in the United States with an emphasis on the twentieth century and its sociohistorical framework. Changes in modes of expression, formal concerns, pictorial themes, and the impact of the Black Arts movement, feminism, and Afrocentrism on art are explored, as well as the relationship of the work of black artists to art from West and Central Africa and the visual traditions of European and Euro-American artists. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 372E (Topic: Twentieth-Century African American Art), 374F (Topic: 20th-Century African American Art), 374F (Topic 19), Art History 344J, 366N (Topic: 20th-Century African American Art).","upper":true},{"key":"ARH 345J","name":"Contemporary Artists of the African Diaspora","description":"Same as African and African Diaspora Studies 374F (Topic 15). Examines a wide range of artists, practicing in different parts of the world, who are part of the African diaspora via such factors as the Atlantic slave trade and various patterns of international migration. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 374F (Topic: Contemporary Artists of the African Diaspora), 374F (Topic 15), Art History 345J, 373D (Topic: Contemporary Artists of the African Diaspora), 374 (Topic: Contemporary Artists of the African Diaspora).","upper":true},{"key":"ARH 345K","name":"Contemporary British Artists of the African Diaspora","description":"Same as African and African Diaspora Studies 374F (Topic 14). A look at a wide range of artists, practicing in Britain, who are part of the African diaspora via such factors as the Atlantic slave trade and various patterns of international migration. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 374F (Topic: Contemporary British Artists of the African Diaspora), 374F (Topic 14), Art History 345K, 374 (Topic: Contemporary British Artists of the African Diaspora).","upper":true},{"key":"ARH 345L","name":"Diaspora Visions","description":"Same as African and African Diaspora Studies 374F (Topic 13) and Women's and Gender Studies 340 (Topic 48). An exploration of border crossing by cultures and groups including Yorubas, Jews, Armenians, Tibetans, Hamish, Pakistanis, and Indians and the production of images by immigrants, exiles, and nomads in alien lands. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 374F (Topic: Diaspora Vision), 374F (Topic 13), Art History 345L, 373D (Topic: Diaspora Visions), 374 (Topic: Diaspora Vision), Women's and Gender Studies 340 (Topic: Diaspora Vision), 340 (Topic 48).","upper":true},{"key":"ARH 345M","name":"Visual Arts of the Caribbean","description":"Same as African and African Diaspora Studies 374F (Topic 12). A look at a wide range of artists from the countries of the Caribbean, including examples of cinema and reggae music packaging. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 372G (Topic: Visual Arts of the Caribbean), 374F (Topic: Visual Arts of the Caribbean), 374F (Topic 12), Art History 345M, 373D (Topic: Visual Arts of the Caribbean), 374 (Topic: Visual Arts of the Caribbean).","upper":true},{"key":"ARH 346K","name":"Introduction to African Art","description":"Same as African and African Diaspora Studies 374F (Topic 11). Investigates the lives and works of several artists who have made substantial contributions to the definition, history, and interpretation of the visual arts. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 374F (Topic: Introduction to African Art), 374F (Topic 11), Art History 346K, 373C (Topic: Introduction to African Art), 374 (Topic: Introduction to African Art), Women's and Gender Studies 340 (Topic: Introduction to African Art).","upper":true},{"key":"ARH 346L","name":"Africana Women's Art","description":"Same as African and African Diaspora Studies 374F (Topic 9) and Women's and Gender Studies 340 (Topic 46). Analysis of the diverse modes of presentation, mediums, definitions, and influences of Africana women artists in the diaspora. Designed to use critical theory and art history found in oral and written literatures, music, films, and other formal and informal documents. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 374F (Topic: Africana Women's Art), 374F (Topic 9), Art History 346L, 373C (Topic: Africana Women's Art), Women's and Gender Studies 340 (Topic: Africana Women's Art), 340 (Topic 46). Prerequisite: Upper-division standing.","upper":true},{"key":"ARH 346M","name":"Visual Cultures of Africa","description":"Same as African and African Diaspora Studies 374F (Topic 10). Painting, textiles, ceramics, sculpture, performance, mixed media, photography, films, and the aesthetic ideas behind the production of African visual cultures from the perspectives of rituals, rites of passage, celebrations, initiations, documentations, and expressions. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 374F (Topic: Visual Cultures of Africa), 374F (Topic 10), Art History 346M, 373C (Topic: Visual Cultures of Africa).","upper":true},{"key":"ARH 347J","name":"Preclassic Mesoamerican Art and Civilization","description":"Introduction to the origins and earliest developments in Mesoamerican art, architecture, and civilization, with emphasis on the social context of art and visual culture in preclassic Mesoamerica. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 347K","name":"Art and Archaeology of Ancient Peru","description":"Same as Latin American Studies 327 (Topic 6: Art and Archaeology of Ancient Peru). The growth of civilization in South America from the earliest decorated textiles, pottery, and ceremonial buildings to the imperial Inca style. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 347L","name":"Mesoamerican Art and Culture","description":"Same as Latin American Studies 327 (Topic 3: Mesoamerican Art). Mesoamerican art, architecture, and its archaeological context, with emphasis on the social function of art and visual culture in ancient Mesoamerica up to the time of European contact. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 347M","name":"Maya Art and Architecture","description":"Same as Latin American Studies 327 (Topic 5: Form and Meaning in Classic Maya Art). Introduction to the artistic traditions of the ancient Maya, tracing their development up to the time of European contact. Students will examine various important themes of Maya culture including history, ritual, and cosmology as revealed in sculpture, hieroglyphs, painting, and architectural design.","upper":true},{"key":"ARH 347N","name":"Aztec Art and Civilization","description":"An introduction to the art, symbolism, and visual culture of the ancient Aztecs. Subjects include the representations of history and mythology in architecture, stone monuments, and pictorial manuscripts. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 347N, 370 (Topic: Aztec Art and Civilization), Latin American Studies 327 (Topic: Aztec Art and Civilization).","upper":true},{"key":"ARH 347P","name":"Mesoamerican Writing Systems","description":"Examines the scripts of ancient Mesoamerica, focusing mostly on Maya and Aztec hieroglyphic writing. Subjects include methods of decipherment, the visual encoding of language in art and script, and the cultures of literacy in precolumbian Mesoamerica. Three lecture hours a week for one semester.","upper":true},{"key":"ARH 348M","name":"The Taj Mahal and the Diversity of Indian Art","description":"Same as Religious Studies 341 (Topic 9). Examination of the period when Islamic dynasties controlled much of the subcontinent and how a unique mix of forms and cultural practices shaped the development of monuments such as the Taj Mahal. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 348M, 372 (Topic: The Taj Mahal and the Diversity of Indian Art), Asian Studies 372 (Topic: The Taj Mahal and the Diversity of Indian Art), Religious Studies 341 (Topic 9). Prerequisite: Upper-division standing.","upper":true},{"key":"ARH 348N","name":"Buddhist Art","description":"Same as Asian Studies 372 (Topic 24) and Religious Studies 341 (Topic 8). Explores the development of Buddhist art in South Asia, the land of its origin as well as its spread elsewhere. Focus on the question of \"what is\" Buddhist art. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 348N, 372 (Topic: Buddhist Art), Asian Studies 372 (Topic 24), Religious Studies 341 (Topic 8).","upper":true},{"key":"ARH 348P","name":"Art in the Himalayas","description":"Examines developments in various Himalayan regions, such as Tibet and Nepal, by focusing on certain subjects and styles in order to comprehend the roles of art in shaping culture and society. Three semester hours a week for one semester.","upper":true},{"key":"ARH 349K","name":"Traditional Chinese Art and Culture","description":"Examines Chinese art and culture from prehistory to the eighteenth century. Subjects include Chinese painting, calligraphy, sculpture, and architecture in their historical setting. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 349K, 372 (Topic: Traditional Chinese Art and Culture), 374 (Topic: Traditional Chinese Art and Culture), Asian Studies 372 (Topic: Traditional Chinese Art and Culture).","upper":true},{"key":"ARH 349L","name":"Contemporary Chinese Art","description":"Examines Chinese art and visual culture from the early twentieth century to the present. Analyzes complex issues involving modern and contemporary art scenes in China through artworks, artists' lives, and sociopolitical changes in China during this period. Three lecture hours a week for one semester. Only one of the following may be counted: Art History 349L, 372 (Topic: Contemporary Chinese Art), Asian Studies 372 (Topic: Contemporary Chinese Art).","upper":true},{"key":"ARH 359","name":"Topics in Feminism and Gender","description":"An introduction to feminist and gender theories in relation to issues concerning visual representation. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 360L","name":"Topics in the History of Photography","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 361","name":"Topics in Latino and Chicano Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 361L","name":"Topics in Ancient Near Eastern Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 362","name":"Topics in Greek and Roman Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 362R","name":"Topics in the Art of Late Antiquity","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 363","name":"Topics in Medieval Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 364","name":"Topics in Renaissance Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 365","name":"Topics in Baroque Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 366J","name":"Topics in Nineteenth-Century Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 366N","name":"Topics in Twentieth-Century Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 366P","name":"Topics in Modernism","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 367","name":"Topics in the Art of North America","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 370","name":"Topics in Pre-Columbian Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 370J","name":"Study in Guatemala","description":"Art and architecture of Guatemala. The equivalent of three lecture hours a week for one semester. Taught in Guatemala.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 372","name":"Topics in the Art of Asia","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 373C","name":"Topics in Africana Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 373D","name":"Topics in Diaspora Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 373E","name":"Topics in African American Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 374","name":"Special Topics in the History of Art","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"ARH 375","name":"Art Historical Methods","description":"Restricted to art history majors. Art historical investigation; practical research techniques. Three lecture hours a week for one semester. Prerequisite: Upper-division standing in art history and consent of the departmental undergraduate adviser.","upper":true},{"key":"ARH 376","name":"Reading Tutorial in Art History Problems","description":"Individual projects to be completed under faculty supervision. Independent study.  May be repeated for credit. Prerequisite: For majors in the Department of Art and Art History, six semester hours of upper-division art history, a grade point average of at least 3.00, and consent of instructor and the chair of the department; for others, a grade point average of at least 3.00 and consent of instructor and the chair of the department.","upper":true},{"key":"ARH 379H","name":"Thesis Course for Departmental Honors","description":"Individual conference course in which student researches and writes a thesis. Independent study. Prerequisite: Admission to the Honors Program in Art History and approval of the honors adviser.","upper":true}]