[{"key":"DES 308","name":"Introduction to Design Studies","description":"A survey of the discipline of design, from 1850 to the present, that examines the broader social context and traces the design process from concept through development and on to production, consumption, use, and in some cases, disposal. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Fine Arts degree in design.","upper":false},{"key":"DES 310","name":"Introduction to Design","description":"Intensive study of the discipline of design and its theories, methods, history, and economic and societal factors. Eight laboratory hours a week for one semester. Offered in the fall semester only. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each, and written consent of the design faculty.","upper":false},{"key":"DES 311J","name":"Design Technologies I","description":"Study of design technologies and their effect on design methods through a focus on tools and lens media. Eight laboratory hours a week for one semester. Offered in the fall semester only. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each, and written consent of the design faculty.","upper":false},{"key":"DES 311K","name":"Design Technologies II","description":"Introduction to the microcomputer as an integrator of visual information; its applications to organizational systems in the design process. Eight laboratory hours a week for one semester. Offered in the spring semester only. Prerequisite: Design 310 and 311J with a grade of at least C in each.","upper":false},{"key":"DES 312","name":"Visual Syntax in Communication","description":"Exploration of the fundamental visual elements and their organization through a study of typography and human perception. Eight laboratory hours a week for one semester. Offered in the spring semester only. Prerequisite: Design 310 and 311J with a grade of at least C in each.","upper":false},{"key":"DES 313","name":"Design History Laboratory","description":"Critical investigation of historical issues, with emphasis on the dynamic relationship between the modern movement and contemporary design. Three lecture hours and five laboratory hours a week for one semester. Offered in the spring semester only. Prerequisite: Design 310 and 311J with a grade of at least C in each.","upper":false},{"key":"DES 320","name":"Design Theory and Method","description":"Critical study of design methodologies and theories. Eight laboratory hours a week for one semester. Offered in the fall semester only. Prerequisite: Design 311K, 312, and 313 with a grade of at least C in each, and written consent of the design faculty.","upper":true},{"key":"DES 321","name":"Images in Communication","description":"Development of coherent visual statements constructed of images generated by multiple media. Eight laboratory hours a week for one semester. Offered in the fall semester only. Prerequisite: Design 311K, 312, and 313 with a grade of at least C in each, and written consent of the design faculty.","upper":true},{"key":"DES 322","name":"Design and the Social Environment","description":"Communication projects selected from the public sector. Eight laboratory hours a week for one semester. Offered in the fall semester only. Prerequisite: Design 311K, 312, and 313 with a grade of at least C in each, and written consent of the design faculty.","upper":true},{"key":"DES 340","name":"Design Systems","description":"Development of flexible, integrated visual systems. Eight laboratory hours a week for one semester. Offered in the spring semester only. Prerequisite: Design 320, 321, and 322 with a grade of at least C in each.","upper":true},{"key":"DES 341","name":"Advanced Issues in Visual Syntax","description":"Exploration of linguistic relationships involved in the development of typographic messages. Eight laboratory hours a week for one semester. Offered in the spring semester only. Prerequisite: Design 320, 321, and 322 with a grade of at least C in each.","upper":true},{"key":"DES 342","name":"Design and Persuasion","description":"Investigation of historical models; the role of words, context, and audience; and the effect of media. Eight laboratory hours a week for one semester. Offered in the spring semester only. Prerequisite: Design 320, 321, and 322 with a grade of at least C in each.","upper":true},{"key":"DES 350","name":"Special Design Topics","description":"A critical investigation of historical and contemporary issues in design, focusing on key theoretical and methodological developments, and assessing the social and environmental consequences of the design act. Eight laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For design majors, the following courses with a grade of at least C in each: Design 320, 321, and 322; for studio art majors, the following courses with a grade of at least C in each: Studio Art 303K, 303L, 304K, 304L; for others, upper-division standing.","upper":true},{"key":"DES 351","name":"Design Perspectives","description":"Students create advanced design projects and present them for critique by visiting critics. Eight laboratory hours a week for one semester. Offered in the fall semester only. Prerequisite: Design 340, 341, and 342 with a grade of at least C in each, and written consent of the design faculty.","upper":true},{"key":"DES 354","name":"Design Issues","description":"A critical investigation of historical and contemporary issues in design, focusing on key theoretical and methodological developments, and assessing the social and environmental consequences of the design act. Three lecture hours a week for one semester. May not be counted toward a degree in the Department of Art and Art History. Prerequisite: For design majors, Design 310, 311J, 311K, 312, and 313 with a grade of at least C in each; for studio art majors, Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each; for others, upper-division standing.","upper":true},{"key":"DES 370","name":"Senior Project in Design","description":"Planning, execution, and presentation of a project approved by the design faculty. Eight laboratory hours a week for one semester. Offered in the spring semester only. With consent of the design faculty, may be repeated for credit. Prerequisite: Design 350 and 351 with a grade of at least C in each, and written consent of the design faculty.","upper":true},{"key":"DES 371","name":"Design Practicum","description":"Practical experience through an internship; lectures on professional ethics and responsibilities. One lecture hour and ten laboratory hours a week for one semester. Offered in the spring semester only. With consent of the design faculty, may be repeated for credit. Prerequisite: Design 350 and 351 with a grade of at least C in each.","upper":true},{"key":"DES 376","name":"Independent Study: Design","description":"Individual projects to be completed under faculty supervision. The equivalent of eight laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Fifteen semester hours of upper-division coursework in design, a grade point average in upper-division design of at least 3.00, and consent of the chair of the department.","upper":true}]