[{"key":"ART 303K (TCCN: ARTS 1316)","name":"Drawing Foundations","description":"Restricted to art history, design, studio art, and visual art studies majors. Drawing concepts and skills in various media. Eight laboratory hours a week for one semester. May be taken for credit only once.","upper":false},{"key":"ART 303L","name":"Digital Foundations","description":"Restricted to design, studio art, and visual art studies majors. Introduction to digital, multimedia, and other time-based art. Eight laboratory hours a week for one semester. May be taken for credit only once.","upper":false},{"key":"ART 304K (TCCN: ARTS 1311)","name":"Two-Dimensional Foundations","description":"Restricted to design, studio art, and visual art studies majors. A basic course in the visual dynamics of two-dimensional art forms. Eight laboratory hours a week for one semester. May be taken for credit only once.","upper":false},{"key":"ART 304L (TCCN: ARTS 1312)","name":"Three-Dimensional Foundations","description":"Restricted to design, studio art, and visual art studies majors. A basic course in three-dimensional form and space. Eight laboratory hours a week for one semester. May be taken for credit only once.","upper":false},{"key":"ART 311K (TCCN: ARTS 2316)","name":"Painting I","description":"Restricted to design, studio art, and visual art studies majors. Introduction to painting techniques, composition, and exploration of personal expression. Eight laboratory hours a week for one semester. May be taken for credit only once. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 313K (TCCN: ARTS 2326)","name":"Beginning Sculpture","description":"Restricted to design, studio art, and visual art studies majors. Introduction to the processes involved in the production of object-oriented sculpture using direct methods of hot and cold construction. Eight laboratory hours a week for one semester. May be taken for credit only once. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 313M","name":"Topics in Three-Dimensional Art","description":"Restricted to design, studio art, and visual art studies majors. Study of specific techniques or problems. Eight laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 315K (TCCN: ARTS 1317)","name":"Beginning Drawing","description":"Restricted to design, studio art, and visual art studies majors. Exploration of various methods, subjects, and expressive possibilities in drawing. Eight laboratory hours a week for one semester. May be taken for credit only once. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 316K (TCCN: ARTS 2323)","name":"Beginning Life Drawing","description":"Restricted to design, studio art, and visual art studies majors. Problems in drawing and construction of the human figure in selected media. Eight laboratory hours a week for one semester. May be taken for credit only once. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 316T","name":"Introduction to Transmedia","description":"Restricted to design, studio art, and visual art studies majors. Introduction to the theory and practice of time-based art, including digital time-art, performance, and video art. Two lecture hours and six laboratory hours a week for one semester. May be taken for credit only once. Studio Art 316T and 316V may not both be counted. Studio Art 316T and 317C may not both be counted. Studio Art 316T and 318C may not both be counted. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 316V","name":"Transmedia: Video Art I","description":"Restricted to design, studio art, and visual art studies majors. Introduction to the basics of video art production, narrative and non-narrative video structural forms, including history, theory, camera techniques, montage, and digital editing. Two lecture hours and six laboratory hours a week for one semester. May be taken for credit only once. Studio Art 316T and 316V may not both be counted. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 317C","name":"Transmedia: Performance Art I","description":"Restricted to design, studio art, and visual art studies majors. Introduction to the history, theory, and practice of performance art and its application in a variety of contexts, including theatrical, gallery, and the workaday world. Two lecture hours and six laboratory hours a week for one semester. May be taken for credit only once. Studio Art 316T and 317C may not both be counted. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 317K (TCCN: ARTS 2356)","name":"Beginning Photography","description":"Restricted to design, studio art, and visual art studies majors. An introduction to still photography, including basic technical skills and concepts. Eight laboratory hours a week for one semester. May be taken for credit only once. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 318C","name":"Transmedia: Digital Time-Art I","description":"Restricted to design, studio art, and visual art studies majors. Introduction to time-based art, with emphasis on the exploration of digital technologies, including motion graphics, video, animation, and sound. Two lecture hours and six laboratory hours a week for one semester. May be taken for credit only once. Studio Art 316T and 318C may not both be counted. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 319G","name":"Beginning Printmaking: Serigraphy","description":"Restricted to design, studio art, and visual art studies majors. Fundamental instruction in the theories, techniques, and practice of serigraphy. Eight laboratory hours a week for one semester. May be taken for credit only once. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 319K","name":"Beginning Printmaking: Intaglio","description":"Restricted to design, studio art, and visual art studies majors. Introduction to the art of printmaking, primarily intaglio techniques such as etching, soft ground, aquatint, and assemblage. Eight laboratory hours a week for one semester. May be taken for credit only once. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 319M","name":"Beginning Printmaking: Lithography","description":"Restricted to design, studio art, and visual art studies majors. Fundamental instruction in the theories, techniques, and shop practices of lithography. Eight laboratory hours a week for one semester. May be taken for credit only once. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 319T","name":"Topics in Studio Art: Laboratory","description":"Restricted to design, studio art, and visual art studies majors. Intensive study of various disciplines of studio art. Eight laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":false},{"key":"ART 320K","name":"Topics in Studio Art","description":"Open to all students.  Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary.","upper":true},{"key":"ART 320L","name":"Topics in Studio Art","description":"Open to all students. Continuation of Studio Art 320K. Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and Studio Art 320K with a grade of at least C.","upper":true},{"key":"ART 320N","name":"Topics in Design","description":"Open to all students.  Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary.","upper":true},{"key":"ART 320P","name":"Topics in Drawing","description":"Open to all students.  Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary.","upper":true},{"key":"ART 320R","name":"Topics in Mixed Media","description":"Open to all students.  Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary.","upper":true},{"key":"ART 320S","name":"Topics in Painting","description":"Open to all students.  Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary.","upper":true},{"key":"ART 320T","name":"Topics in Photography","description":"Open to all students.  Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary.","upper":true},{"key":"ART 320U","name":"Topics in Printmaking","description":"Open to all students.  Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary.","upper":true},{"key":"ART 320V","name":"Topics in Sculpture","description":"Open to all students.  Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary.","upper":true},{"key":"ART 320W","name":"Topics in Transmedia","description":"Open to all students.  Eight laboratory hours a week for one semester. May not be counted toward a degree in art and art history. May be repeated for credit when the topics vary.","upper":true},{"key":"ART 321K","name":"Painting II","description":"Restricted to design, studio art, and visual art studies majors. Problems in composition and exploration of personal expression. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 311K with a grade of at least C.","upper":true},{"key":"ART 321M","name":"Painting II: Figure Painting","description":"Restricted to design, studio art, and visual art studies majors. Problems in composition and exploration of personal expression with the life model. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 311K with a grade of at least C.","upper":true},{"key":"ART 322K","name":"Intermediate Drawing","description":"Restricted to design, studio art, and visual art studies majors. Continuation of Studio Art 315K. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 315K with a grade of at least C.","upper":true},{"key":"ART 323K","name":"Intermediate Sculpture","description":"Restricted to design, studio art, and visual art studies majors. Exploration of the concepts and processes involved in the production of object-oriented sculpture, with emphasis on indirect methods of mold-making and casting. Encourages individual direction. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 313K with a grade of at least C.","upper":true},{"key":"ART 323M","name":"Advanced Topics in Three-Dimensional Art","description":"Restricted to design, studio art, and visual art studies majors. Study of specific techniques or problems. Eight laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each; and twelve additional semester hours of studio art coursework with a grade of at least C in each course.","upper":true},{"key":"ART 323P","name":"Issues in Sculpture","description":"Restricted to design, studio art, and visual art studies majors. Topics related to the field of sculpture, from issue-based to media-based studies. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 313K with a grade of at least C.","upper":true},{"key":"ART 323S","name":"Installation Sculpture","description":"Restricted to design, studio art, and visual art studies majors. Exploration of the theories and methods involved in the production of installation sculpture through the investigation of form and space and of their function in transforming environmental, architectural, or invented sites. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 313K with a grade of at least C.","upper":true},{"key":"ART 325G","name":"Intermediate Printmaking: Serigraphy","description":"Restricted to design, studio art, and visual art studies majors. Practice in the theories and techniques of multicolor serigraphy and photoserigraphy. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 319G with a grade of at least C.","upper":true},{"key":"ART 325K","name":"Intermediate Printmaking: Intaglio","description":"Restricted to design, studio art, and visual art studies majors. Instruction in the theories and techniques of intaglio printmaking, color, assemblage, stencil, viscosity, collography, photo process, and relief. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 319K with a grade of at least C.","upper":true},{"key":"ART 325M","name":"Intermediate Printmaking: Lithography","description":"Restricted to design, studio art, and visual art studies majors. Instruction in the theories and techniques of metal plate, multicolor, and stone lithography and photolithography. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 319M with a grade of at least C.","upper":true},{"key":"ART 334K","name":"Digital Photography","description":"Restricted to design, studio art, and visual art studies majors. Introduction to digital image making in the context of creating art, including digital technologies and a historical overview of traditional and digital photographic practices. Eight laboratory hours a week for one semester. Prerequisite: Studio Art 317K with a grade of at least C.","upper":true},{"key":"ART 335K","name":"Intermediate Photography","description":"Restricted to design, studio art, and visual art studies majors. Practice in still photography, including materials and processes. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 317K and 334K with a grade of at least C in each.","upper":true},{"key":"ART 336K","name":"Color Photography","description":"Restricted to design, studio art, and visual art studies majors. Instruction in basic principles, materials, and techniques of color photography as an art form. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 317K with a grade of at least C.","upper":true},{"key":"ART 336V","name":"Transmedia: Video Art II","description":"Restricted to design, studio art, and visual art studies majors. Projects in video art and video installation art. Surveys contemporary video art, stylistic modes, ideology, and the history of the artist's video and its precedents in the avant-garde and structuralist filmmaking. Two lecture hours and six laboratory hours a week for one semester. May be repeated twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 316T or 316V with a grade of at least C.","upper":true},{"key":"ART 337C","name":"Transmedia: Performance Art II","description":"Restricted to design, studio art, and visual art studies majors. Projects in performance art with a concentration on the realization of more fully developed solo and collaborative projects. Two lecture hours and six laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 316T or 317C with a grade of at least C.","upper":true},{"key":"ART 338C","name":"Transmedia: Digital Time-Art II","description":"Restricted to design, studio art, and visual art studies majors. Projects in time-based art, with emphasis on the exploration of digital technologies, including motion graphics, video, animation, and sound. Two lecture hours and six laboratory hours a week for one semester. May be repeated twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 316T or 318C with a grade of at least C.","upper":true},{"key":"ART 341K","name":"Painting III","description":"Restricted to design, studio art, and visual art studies majors. Continuation of Studio Art 321K. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 321K or 321M with a grade of at least C.","upper":true},{"key":"ART 341M","name":"Painting III: Figure Painting","description":"Restricted to design, studio art, and visual art studies majors. Continuation of Studio Art 321M. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 321M with a grade of at least C.","upper":true},{"key":"ART 346K","name":"Intermediate Life Drawing","description":"Restricted to design, studio art, and visual art studies majors. Advanced problems in drawing and construction of the human figure. Eight laboratory hours a week for one semester. May be taken twice for credit, but not with the same instructor in the same semester. Prerequisite: Studio Art 316K with a grade of at least C.","upper":true},{"key":"ART 354C","name":"Computer Art Media","description":"Restricted to design, studio art, and visual art studies majors. Principles, techniques, and practices of digital arts for studio artists. Two lecture hours and six laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":true},{"key":"ART 355","name":"Studio Projects","description":"Restricted to design, studio art, and visual art studies majors. Study of specific techniques or problems. Eight laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each; and twelve additional semester hours of coursework in studio art with a grade of at least C in each course.","upper":true},{"key":"ART 356K","name":"Advanced Color Photography","description":"Restricted to design, studio art, and visual art studies majors. Continuation of Studio Art 336K. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 336K with a grade of at least C.","upper":true},{"key":"ART 356V","name":"Transmedia: Video Art III","description":"Restricted to design, studio art, and visual art studies majors. Advanced study of video art and video installation art. Two lecture hours and six laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 336V with a grade of at least C.","upper":true},{"key":"ART 357C","name":"Transmedia: Performance Art III","description":"Restricted to design, studio art, and visual art studies majors. Advanced study of performance art with a concentration on the realization of more fully developed solo and collaborative projects. Two lecture hours and six laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 337C with a grade of at least C.","upper":true},{"key":"ART 358C","name":"Transmedia: Digital Time-Art III","description":"Restricted to design, studio art, and visual art studies majors. Advanced study of time-based art, with emphasis on the exploration of digital technologies, including motion graphics, video, animation, and sound. Two lecture hours and six laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 338C with a grade of at least C.","upper":true},{"key":"ART 359K","name":"Advanced Digital Photography","description":"Restricted to design, studio art, and visual art studies majors. Advanced study of digital image making in the context of creating art, including digital technologies and the historical developments of wet processes in black and white, color, and digital photography. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 334K with a grade of at least C.","upper":true},{"key":"ART 361J","name":"Painting IV: Figure Painting","description":"Restricted to design, studio art, and visual art studies majors. Continuation of Studio Art 341M. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 341M with a grade of at least C.","upper":true},{"key":"ART 361K","name":"Painting IV","description":"Restricted to design, studio art, and visual art studies majors. Continuation of Studio Art 341K. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 341K or 341M with a grade of at least C, and consent of painting faculty via application and portfolio review.","upper":true},{"key":"ART 363K","name":"Advanced Sculpture","description":"Restricted to design, studio art, and visual art studies majors. Advanced research in the theory, technology, and methods involved in the production of sculpture, with emphasis on individual direction. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 323K with a grade of at least C.","upper":true},{"key":"ART 363S","name":"Advanced Installation Sculpture","description":"Restricted to design, studio art, and visual art studies majors. Advanced research in the theory, technology, and methods involved in the production of installation sculpture, with emphasis on individual direction. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 323S or 323K with a grade of at least C.","upper":true},{"key":"ART 365G","name":"Advanced Printmaking: Serigraphy","description":"Restricted to design, studio art, and visual art studies majors. Advanced practice in the art of serigraphy, with emphasis on independent research. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 325G with a grade of at least C.","upper":true},{"key":"ART 365K","name":"Advanced Printmaking: Intaglio","description":"Restricted to design, studio art, and visual art studies majors. Advanced practice in the art of printmaking, involving independent research. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 325K with a grade of at least C.","upper":true},{"key":"ART 365M","name":"Advanced Printmaking: Lithography","description":"Restricted to design, studio art, and visual art studies majors. Advanced instruction in the theories and techniques of metal plate, multicolor, and stone lithography and photolithography. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 325M with a grade of at least C.","upper":true},{"key":"ART 366K","name":"Advanced Life Drawing","description":"Restricted to design, studio art, and visual art studies majors. Problems in drawing and construction of the human figure. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 346K with a grade of at least C.","upper":true},{"key":"ART 368N","name":"Advanced Drawing","description":"Restricted to design, studio art, and visual art studies majors. Continuation of Studio Art 322K. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 322K with a grade of at least C.","upper":true},{"key":"ART 370S","name":"Senior Seminar in Art","description":"Restricted to design, studio art, and visual art studies majors. Examines how to articulate and make visible the unique qualities and ambition of studio practice through writing, discourse, and other ways of engaging an audience. Coursework is focused on speaking, writing, and conversation. Prerequisite: Upper-division standing; Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each; and nine additional semester hours of coursework in studio art with a grade of at least C in each course.","upper":true},{"key":"ART 372K","name":"Advanced Photography","description":"Restricted to design, studio art, and visual art studies majors. Advanced practice in still photography. Eight laboratory hours a week for one semester. May be repeated for credit, but (1) may not be taken for credit more than twice in the same semester, and (2) may not be taken for credit more than once with the same instructor in the same semester. Prerequisite: Studio Art 334K and 335K with a grade of at least C in each.","upper":true},{"key":"ART 376","name":"Independent Study: Studio Art","description":"Restricted to design, studio art, and visual art studies majors. Individual projects to be completed under faculty supervision. The equivalent of eight laboratory hours a week for one semester.  May be repeated for credit. Prerequisite: Completion of at least fifteen semester hours of upper-division coursework in studio art, a grade point average of at least 3.00 in upper-division coursework in the major, and consent of the chair of the department.","upper":true},{"key":"ART 379R","name":"Advanced Topics in Studio Art: Seminar","description":"Restricted to design, studio art, and visual art studies majors. Intensive advanced study of issues in the various disciplines of studio art. Three seminar hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing; Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each; and twelve semester hours of upper-division coursework in studio art.","upper":true}]