[{"key":"VAS 221C","name":"Children's Artistic Development I","description":"Theory and content for the development of perceptual, aesthetic, critical, studio, and art-historical skills. Two lecture hours a week for one semester. Prerequisite: Concurrent enrollment in Visual Art Studies 121D.","upper":true},{"key":"VAS 121D","name":"Children's Artistic Development I: Laboratory","description":"Practice in the development of perceptual, aesthetic, critical, studio, and art-historical skills. Four laboratory hours a week for one semester. Prerequisite: Concurrent enrollment in Visual Art Studies 221C.","upper":true},{"key":"VAS 222C","name":"Children's Artistic Development II","description":"Continuation of Visual Art Studies 221C. Advanced theory and content for the development of perceptual, aesthetic, critical, studio, and art-historical skills. Two lecture hours a week for one semester. Prerequisite: Visual Art Studies 221C and 121D with a grade of at least C in each and concurrent enrollment in Visual Art Studies 122D.","upper":true},{"key":"VAS 122D","name":"Children's Artistic Development II: Laboratory","description":"Continuation of Visual Art Studies 121D. Advanced practice in the development of art skills. Four laboratory hours a week for one semester. Prerequisite: Concurrent enrollment in Visual Art Studies 222C.","upper":true},{"key":"VAS 330","name":"Introduction to Visual Art Studies","description":"Restricted to visual art studies majors; nonmajors may contact the department for permission to register. An introduction to visual art studies: philosophy, current trends, instructional methods, evaluation, advocacy, and careers in art education, museum education, and cultural or social educational settings. Three lecture hours a week for one semester. Observation required outside of class hours. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each.","upper":true},{"key":"VAS 241C","name":"Learners and Instructional Sites for Visual Art Studies","description":"Restricted to visual art studies majors; nonmajors may contact the department for permission to register. Instructional procedures, observations, and evaluation of early childhood through grade twelve classroom and community-based art instruction. Two lecture hours a week for one semester. Observation required outside of class hours. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each, and concurrent enrollment in Visual Art Studies 141D.","upper":true},{"key":"VAS 141D","name":"Learners and Instructional Sites for Visual Art Studies: Laboratory","description":"Restricted to visual art studies majors; nonmajors may contact the department for permission to register.  Four laboratory hours a week for one semester. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each, and concurrent enrollment in Visual Art Studies 241C.","upper":true},{"key":"VAS 261C","name":"Criticism and Conversation about Art","description":"Restricted to visual art studies majors; nonmajors may contact the department for permission to register. Individual and professional evaluations of visual imagery, artifacts, and artistic production in a variety of settings. Two lecture hours a week for one semester. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each; Visual Art Studies 330, 241C, and 141D with a grade of at least B in each; and concurrent enrollment in Visual Art Studies 161D.","upper":true},{"key":"VAS 161D","name":"Criticism and Conversation about Art: Laboratory","description":"Restricted to visual art studies majors; nonmajors may contact the department for permission to register.  Four laboratory hours a week for one semester. Prerequisite: Studio Art 303K, 303L, 304K, and 304L with a grade of at least C in each; Visual Art Studies 330, 241C, and 141D with a grade of at least B in each; and concurrent enrollment in Visual Art Studies 261C.","upper":true},{"key":"VAS 271C","name":"Topics in Visual Art Studies","description":"Lectures on selected topics in visual art. Two lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and concurrent enrollment in Visual Art Studies 171D.","upper":true},{"key":"VAS 171D","name":"Topics in Visual Art Studies: Laboratory","description":"Two laboratory hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and concurrent enrollment in Visual Art Studies 271C.","upper":true},{"key":"VAS 376","name":"Independent Study: Visual Art Studies","description":"Individual projects to be completed under faculty supervision. Individual instruction.  May be repeated for credit. Prerequisite: Completion of twelve semester hours of upper-division coursework in the Department of Art and Art History, a grade point average in upper-division coursework in the Department of Art and Art History of at least 3.00, and consent of the chair of the department.","upper":true},{"key":"VAS 379S","name":"Advanced Topics in Visual Art Studies: Lecture","description":"Three class hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: For majors in the Department of Art and Art History, upper-division standing; for others, upper-division standing and consent of instructor.","upper":true}]