[{"key":"R S 302","name":"History of the Religions of Asia","description":"Same as Asian Studies 301R. Eastern religions: an introduction to the basic forms and the historical development of the religious traditions of India, China, and Japan. Three lecture hours a week for one semester.","upper":false},{"key":"R S 305","name":"Introduction to the Philosophy of Religion","description":"Same as Philosophy 305. Primarily for lower-division students. A critical examination of various conceptions of God and of the relationship of the human and the divine. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":false},{"key":"R S 306","name":"Topics in Comparative Religion","description":"Three lecture hours a week for one semester. Additional hours are required for some topics; these topics are identified in the Course Schedule.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"R S 306C","name":"Comparative Religious Ethics","description":"Religious Studies 306 (Topic: Comparative Religious Ethics) and 306C may not both be counted.","upper":false},{"key":"R S 310","name":"Introduction to the Study of Religion","description":"Introduction to scholarly methods in the study of religion. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 301M (Topic 5: Introduction to the Study of Religion), Religious Studies 310, Sociology 313K.","upper":false},{"key":"R S 312","name":"Topics in the Religions of Asia","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"R S 312C","name":"Introduction to Buddhism","description":"Same as Asian Studies 301M (Topic 11: Introduction to Buddhism). A structural and historical overview of Buddhism through the examination of various schools, doctrines, biographical narratives, and contemporary ethical issues. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 301M (Topic 11), Religious Studies 312 (Topic: Introduction to Buddhism), 312C.","upper":false},{"key":"R S 313","name":"Topics in Judaism","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"R S 313C","name":"Introduction to the Old Testament","description":"Same as Core Texts and Ideas 305G, Jewish Studies 311 (Topic 4),  and Middle Eastern Studies 310 (Topic 3). Introduction to the many interpretations of the Hebrew Bible (the Old Testament) and its meaning in the context of its historical and cultural setting in the ancient Near East. Only one of the following may be counted: Core Texts and Ideas 305G, 310 (Topic: Introduction to the Hebrew Bible), Jewish Studies 311 (Topic: Introduction to the Hebrew Bible), 311 (Topic 4), Middle Eastern Studies 310 (Topic: Introduction to the Hebrew Bible), 310 (Topic 3), Religious Studies 313 (Topic: Introduction to the Hebrew Bible), 313C.","upper":false},{"key":"R S 313M","name":"Jewish Civilization: Beginnings to 1492","description":"Same as History 306N (Topic 10: Jewish Civilization: Beginnings to 1492) and Jewish Studies 304M. Introduction to the history, culture, and religion of the Jewish people from around 1000 BC to the end of the medieval period. Subjects may include ancient Israel, late Second Temple sectarianism, the rise of Christianity, rabbinic Judaism, medieval Jewish philosophy, Jewish mysticism, and Hebrew poetry. Three lecture hours a week for one semester. Only one of the following may be counted: History 306N (Topic: Jewish Civilization I), 306N (Topic 10), Jewish Studies 304M, 311 (Topic: Jewish Civilization I), Religious Studies 313 (Topic: Jewish Civilization I), 313M.","upper":false},{"key":"R S 313N","name":"Jewish Civilization: 1492 to the Present","description":"Same as History 306N (Topic 11: Jewish Civilization: 1492 to the Present) and Jewish Studies 304N. Subjects may include trends toward secularization, the emancipation of European Jewry, the emergence of American Jewry, the Holocaust, the establishment of the State of Israel, and the Arab-Israeli conflict. Three lecture hours a week for one semester. Only one of the following may be counted: History 306N (Topic 11), Jewish Studies 304N, 311 (Topic: Jewish Civilization: 1492 to the Present), Religious Studies 313 (Topic: Jewish Civilization: 1492 to the Present), 313N.","upper":false},{"key":"R S 314","name":"Topics in Islam","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"R S 315","name":"Topics in Christian History","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"R S 315N","name":"Introduction to the New Testament","description":"Examines representative examples of the texts found in the Christian New Testament and selected noncanonical writings. Focuses on historical setting and systematic methods of interpretation. Three lecture hours a week for one semester. Only one of the following may be counted: Classical Civilization 304C (Topic: Introduction to the New Testament), Religious Studies 315 (Topic: Introduction to the New Testament), 315N.","upper":false},{"key":"R S 316K","name":"Topics in Religions of the Americas","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"R S 316U","name":"Topics in Religions of the United States","description":"Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":false},{"key":"R S 317","name":"Topics in the Religions of Africa","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":false},{"key":"R S 318","name":"The Rise of Christianity","description":"Same as Classical Civilization 318. Introduction to the origins and development of Christianity. Three lecture hours a week for one semester.","upper":false},{"key":"R S 319","name":"Introduction to Islam","description":"Same as Asian Studies 301M (Topic 15), History 306N (Topic 7),  and Islamic Studies 310. The beliefs, theology, history, and main social and legal institutions of Islam, including the concept of God and society, the role of women, and Islamic government and movements. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 301M (Topic 15), History 306N (Topic 7), Islamic Studies 310, Middle Eastern Studies 310 (Topic 1: Introduction to Islam), Religious Studies 319.","upper":false},{"key":"R S 321","name":"History of Hindu Religious Traditions","description":"Same as Anthropology 324L (Topic 23: History of Hindu Religious Traditions), Asian Studies 340 (Topic 4: History of Hindu Religious Traditions), and History 364G (Topic 1: History of Hindu Religious Traditions). History of major doctrines, practices, and institutions that shaped the development of Hinduism; how religions adapt to social and cultural change and often provide the catalyst for change. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 322","name":"History of Indian Buddhism","description":"Same as Asian Studies 340 (Topic 5: History of Indian Buddhism). The institutional, social, economic, and doctrinal history of Buddhism in India. Three lecture hours a week for one semester. Prerequisite: Upper-division standing or consent of instructor.","upper":true},{"key":"R S 325","name":"Prophet of Islam: His Life and Times","description":"Same as History 364G (Topic 2: Prophet of Islam: His Life and Times) and Islamic Studies 340 (Topic 1: Prophet of Islam: His Life and Times). A detailed study of the prophet Muhammad's life and message, and of the means by which his life was recorded and popularized. Three lecture hours a week for one semester. Only one of the following may be counted: History 364G (Topic 2), Islamic Studies 340 (Topic 1), Middle Eastern Studies 321K (Topic 6: Prophet of Islam: His Life and Times), Religious Studies 325. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 325G","name":"The Qur'an","description":"Same as Comparative Literature 323 (Topic 37), Core Texts and Ideas 375 (Topic 1), Islamic Studies 340 (Topic 2), Middle Eastern Languages and Cultures 321 (Topic 9), Middle Eastern Studies 342 (Topic 16),  and Women's and Gender Studies 340 (Topic 54). The history, language, style, and themes of the Qur'an. Only one of the following may be counted: Arabic 372 (Topic 2: The Qur'an), Comparative Literature 323 (Topic: The Qur'an), 323 (Topic 37), Core Texts and Ideas 375 (Topic: The Qur'an), Core Texts and Ideas 375 (Topic 1), Islamic Studies 340 (Topic 2), Middle Eastern Languages and Cultures 321 (Topic 9), Middle Eastern Studies 320 (Topic 14: The Qur'an), 342 (Topic 16), Religious Studies 325G, Women's and Gender Studies 340 (Topic: The Qur'an), 340 (Topic 54). Prerequisite: Upper-division standing.","upper":true},{"key":"R S 326","name":"History of Religion in America since 1800","description":"Same as History 351P. Introduction to the history of religion in the United States of America from the nineteenth century to the present. Focuses on how diverse peoples imagined and transformed the landscape, interacted with one another at different sites, and moved within and across national borders. Three lecture hours a week for one semester. Partially fulfills legislative requirement for American history. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 335","name":"Jesus in History and Tradition","description":"Same as Classical Civilization 348 (Topic 10: Jesus in History and Tradition). Critical issues, scholarly debates, and historical methods in studying the development of the Christian tradition regarding the figure of Jesus. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 341","name":"Topics in Religions of South Asia","description":"Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 341G","name":"Yoga as Philosophy and Practice","description":"Same as Philosophy 356 (Topic 2).  Three lecture hours a week for one semester. Only one of the following may be counted: Philosophy 356 (Topic: Yoga as Philosophy and Practice), 356 (Topic 2), Religious Studies 341G (Topic: Yoga as Philosophy and Practice), 341G. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 342","name":"Topics in Religions of Central Asia","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 344","name":"The Age of Reformation","description":"Same as History 343. Examines late medieval religion, the rise of Protestant movements, and the Catholic response in their cultural, political, and social contexts. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 345","name":"Islamic Spain and North Africa to 1492","description":"Same as History 375D and Middle Eastern Studies 343 (Topic 4: Islamic Spain and North Africa to 1492). An introduction to the impact of Islam on Spain and North Africa, with emphasis on social, economic, and cultural development. Three lecture hours a week for one semester. Only one of the following may be counted: Ancient History and Classical Civilization 330 (Topic: Islamic Spain and North Africa to 1492), History 375D, Islamic Studies 373 (Topic: Islamic Spain and North Africa to 1492), Middle Eastern Studies 321K (Topic 4: Islamic Spain and North Africa to 1492), 343 (Topic 4), Religious Studies 345, 363 (Topic: Islamic Spain and North Africa to 1492). Prerequisite: Upper-division standing.","upper":true},{"key":"R S 346","name":"Topics in the Religions of the United States","description":"Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 346C","name":"Religion and Visual Culture in the United States","description":"Focuses on artifacts or \"visual culture,\" and considers how religion mediates artifacts and how artifacts mediate religion. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: American Studies 325 (Topic: Religion and Visual Culture in the United States), Religious Studies 346 (Topic: Religion and Visual Culture in the United States), 346C.","upper":true},{"key":"R S 346D","name":"Native American Religion","description":"Examination of religious developments in Native American communities from the precolonial period through the present day. Focus on the changing forms of ritual practice and the relationship between religion and community life. Only one of the following may be counted: American Studies 327 (Topic: Native American Religion), Religious Studies 346 (Topic: Native American Religion), 346D. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 346E","name":"Religion and Film","description":"Survey of representations of religious beliefs, practices, persons, and institutions in popular film. Examination of film as a vehicle to reflect how a shared religious imagination shaped the way Americans understand themselves. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 321 (Topic: Religion and Film), Religious Studies 346 (Topic: Religion and Film), 346E. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 352","name":"Topics in Religions of East Asia","description":"Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 353","name":"Topics in Religion and Culture of the Biblical World","description":"Three lecture hours a week for one semester; additional hours may be required by some topics.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 353D","name":"The Dead Sea Scrolls","description":"Same as Ancient History and Classical Civilization 330 (Topic 1), History 364G (Topic 3), Jewish Studies 364 (Topic 4), Middle Eastern Languages and Cultures 321 (Topic 17),  and Middle Eastern Studies 342 (Topic 23).  Three lecture hours a week for one semester. Only one of the following may be counted: Ancient History and Classical Civilization 330 (Topic: The Dead Sea Scrolls), 330 (Topic 1), History 364G (Topic 3), Jewish Studies 364 (Topic 4), Middle Eastern Languages and Cultures 321 (Topic 17), Middle Eastern Studies 320 (Topic 13), 342 (Topic 23), Religious Studies 353D. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 353E","name":"Beyond the New Testament","description":"Study of early Christian writings that were not included in the Christian Bible. Examines issues such as the effect of narrative, religion and violence, gendered expectations for women and men, the uses of fantasy literature, and religious authority. Emphasis on systematic methods for disciplined interpretation. Only one of the following may be counted: Classical Civilization 348 (Topic: Beyond the New Testament), Religious Studies 353 (Topic: Beyond the New Testament), 353E. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 354D","name":"The Bible and History","description":"Same as Jewish Studies 364 (Topic 3: The Bible and History). The critical uses of biblical and extrabiblical data in the reconstruction of the history of the biblical period. Three lecture hours a week for one semester. Only one of the following may be counted: Ancient History and Classical Civilization 330 (Topic: The Bible and History), History 372P, Jewish Studies 364 (Topic 3), Middle Eastern Studies 320 (Topic 3: The Bible and History), Religious Studies 354D. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 355","name":"The Bible as Literature","description":"Same as English 358J. In-depth literary study of the Bible, with emphasis on the formal features of narrative, hymn, prophecy, apocalypse, gospel, and epistle. Three lecture hours a week for one semester. Some sections are offered on the letter-grade basis only. Prerequisite: Comparative Literature 315, English 603B, 316L (or 316K), 316M (or 316K), 316N (or 316K), or 316P (or 316K), or Tutorial Course 603B.","upper":true},{"key":"R S 355K","name":"The Bible in British and American Literature","description":"Same as English 358K. The reading of biblical masterpieces as literature; consideration of different versions of the Bible and their influence on British and American literature. Three lecture hours a week for one semester. English 358K and Religious Studies 355K may not both be counted. Some sections are offered on the letter-grade basis only. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"R S 357","name":"Topics in the Religions of Europe","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 358","name":"Topics in the Religions of the Middle East","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 358Q","name":"Supervised Research","description":"Individual instruction. Prerequisite: Upper-division standing.","upper":true},{"key":"R S 360","name":"Topics in Religions of Sub-Saharan Africa","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"R S 362","name":"Independent Research in Religious Studies","description":"Faculty-directed research. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"R S 365","name":"Topics in Ancient Religion","description":"Three lecture hours a week for one semester; additional hours may be required by some topics.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 366","name":"Topics in Religions of the Americas","description":"Three lecture hours a week for one semester. Some topics partially fulfill legislative requirement for American history. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 368","name":"Topics in Religions of Latin America","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 373","name":"Topics in Comparative Religion","description":"Three lecture hours a week for one semester. Religious Studies 373 and 375S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"R S 375S","name":"Advanced Seminars in Religious Studies","description":"Discussion and research-based study of topics in religious studies. Includes theoretical approaches to the study of religion. Three lecture hours a week for one semester. Religious Studies 373 and 375S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and at least six semester hours of coursework in religious studies.","upper":true},{"key":"R S 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, followed by research and writing to produce a substantial paper on a specific topic in religious studies, to be completed during the second semester. The equivalent of three lecture hours a week for two semesters. Prerequisite: For 679HA, upper-division standing and admission to the Religious Studies Honors Program; for 679HB, Religious Studies 679HA.","upper":true}]