[{"key":"AFS 100","name":"Leadership Laboratory","description":"Various leadership techniques, including drill and ceremonies, customs and courtesies, and uniform standards. Two laboratory hours a week for one semester.  Offered on the pass/fail basis only.","upper":false},{"key":"AFS 102K","name":"The Foundations of the United States Air Force I","description":"Introductory course exploring the overall roles and missions of the United States Air Force and career fields available in the Air Force. Emphasis on military customs and courtesies, appearance standards, Air Force core values, and written communication. One lecture hour a week for one semester. Offered in the fall semester only. Prerequisite: Concurrent enrollment in Air Force Science 100.","upper":false},{"key":"AFS 102L","name":"The Foundations of the United States Air Force II","description":"Continuation of Air Force Science 102K, with an introduction to American military history and emphasis on personal communication. One lecture hour a week for one semester. Offered in the spring semester only. Prerequisite: Concurrent enrollment in Air Force Science 100.","upper":false},{"key":"AFS 111K","name":"The Evolution of USAF Air and Space Power I","description":"Key historical events and milestones in the development of air power as a primary instrument of United States national security. One lecture hour a week for one semester. Offered in the fall semester only. Prerequisite: Concurrent enrollment in Air Force Science 100.","upper":false},{"key":"AFS 111L","name":"The Evolution of USAF Air and Space Power II","description":"Continuation of Air Force Science 111K. One lecture hour a week for one semester. Offered in the spring semester only. Prerequisite: Concurrent enrollment in Air Force Science 100.","upper":false},{"key":"AFS 120L","name":"Leadership Laboratory","description":"Leadership laboratory course for upper-division students. Further development of leadership skills through leadership positions within the cadet corps. Includes training of freshman and sophomore students as well as a practicum in Air Force unit operation. Two laboratory hours a week for one semester.  Offered on the pass/fail basis only.","upper":true},{"key":"AFS 321","name":"Air Force Leadership Studies I","description":"Study of leadership, management fundamentals, professional knowledge, Air Force personnel and evaluation systems, leadership ethics, and communication skills required of an Air Force junior officer. Case studies are used to examine Air Force leadership and management situations as a means of demonstrating and exercising practical application of the concepts being studied. Three lecture hours a week for one semester. Offered in the fall semester only. Prerequisite: Air Force Science 102K, 102L, 111K, and 111L; concurrent enrollment in Air Force Science 120L; and a four- or five-week field training course or equivalent ROTC or military training.","upper":true},{"key":"AFS 322","name":"Air Force Leadership Studies II","description":"Continuation of Air Force Science 321. Three lecture hours a week for one semester. Offered in the spring semester only. Prerequisite: Air Force Science 321 and concurrent enrollment in Air Force Science 120L.","upper":true},{"key":"AFS 331","name":"National Security Affairs","description":"Evolution of the role of national security in a democratic society, with emphasis on policy formulation, competing values, and organizations. Area studies and the impact of developing nations on United States national security. Three lecture hours a week for one semester. Offered in the fall semester only. Prerequisite: Air Force Science 322 and concurrent enrollment in Air Force Science 120L.","upper":true},{"key":"AFS 332","name":"Current Issues and Preparation for Active Duty","description":"Acculturation to active duty. Includes study of the evolution and jurisdiction of military law, officership, and current Air Force issues. Three lecture hours a week for one semester. Offered in the spring semester only. Prerequisite: Air Force Science 331, and concurrent enrollment in Air Force Science 120L or consent of the department chair.","upper":true}]