[{"key":"CZ 601C","name":"Intensive Czech I","description":"Not open to native or heritage speakers of Czech. Emphasis on developing oral proficiency in Czech using intensive methods of instruction. Six lecture hours a week for one semester. Czech 601C and 506 may not both be counted. Czech 601C and 507 may not both be counted.","upper":false},{"key":"CZ 301K","name":"Introduction to Czech Civilization","description":"Introduction to selected topics in the culture of the Czech and Slavic people. Conducted in English. Three lecture hours a week for one semester. May not be used to fulfill the foreign language requirement for any bachelor's degree. May be repeated for credit when the topics vary.","upper":false},{"key":"CZ 506 (TCCN: CZEC 1511)","name":"First-Year Czech I","description":"Emphasis on four-skills proficiency: listening, speaking, reading, and writing. Five lecture hours a week for one semester. Czech 601C and 506 may not both be counted.","upper":false},{"key":"CZ 507 (TCCN: CZEC 1512)","name":"First-Year Czech II","description":"Emphasis on four-skills proficiency: listening, speaking, reading, and writing. Five lecture hours a week for one semester. Czech 601C and 507 may not both be counted. Prerequisite: Czech 506.","upper":false},{"key":"CZ 611C","name":"Intensive Czech II","description":"Not open to native or heritage speakers of Czech. Continuing intensive development of proficiency in Czech, with a focus on speaking and the reading of authentic texts. Six lecture hours a week for one semester. Czech 611C and 312K, 412K may not both be counted. Czech 611C and 312L, 412L may not both be counted. Prerequisite: Czech 601C or 507.","upper":false},{"key":"CZ 324","name":"Topics in Czech Studies","description":"Study of a selected aspect or aspects of Czech culture: literature, theatre, film, visual arts, folklore. Readings and lectures in English. Three lecture hours a week for one semester. May not be used to fulfill the foreign language requirement for any degree. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"CZ 325","name":"Third-Year Czech I","description":"Oral expression, reading, and composition. Three lecture hours a week for one semester. Prerequisite: Czech 611C or 312L.","upper":true},{"key":"CZ 326","name":"Third-Year Czech II","description":"Continuation of Czech 325: Oral expression, reading, and composition. Three lecture hours a week for one semester. Prerequisite: Czech 325.","upper":true},{"key":"CZ 328","name":"Topics in Advanced Czech","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Czech 312L or 412L. Additional prerequisites may vary with the topic and are given in the Course Schedule.","upper":true},{"key":"CZ 330","name":"Modern Czech Literature","description":"Same as Comparative Literature 323 (Topic 9), European Studies 347 (Topic 9),  and Russian, East European, and Eurasian Studies 325 (Topic 30). A study of Czech literature from the 1860s to the present; course is conducted in English. Three lecture hours a week for one semester. Only one of the following may be counted: Comparative Literature 323 (Topic: Modern Czech Literature), 323 (Topic 9), Czech 330, European Studies 347 (Topic: Modern Czech Literature), 347 (Topic 9), Russian, East European, and Eurasian Studies 325 (Topic: Modern Czech Literature), 325 (Topic 30). Prerequisite: Upper-division standing.","upper":true},{"key":"CZ 379","name":"Conference Course in Czech Language or Literature","description":"Three lecture hours a week for one semester.  May be repeated for credit. Prerequisite: Six semester hours of upper-division coursework in Czech, or upper-division standing and consent of instructor.","upper":true},{"key":"CZ 679H","name":"Honors Tutorial Course","description":"Supervised individual research on a literary honors paper of some length. Conference course for two semesters. Must be taken for special honors in addition to the major requirement. Prerequisite: For 679HA, upper-division standing, a University grade point average of at least 3.00, and a grade point average in Czech of at least 3.50; for 679HB, Czech 679HA.","upper":true}]