[{"key":"POL 601C","name":"Intensive Polish I","description":"Not open to native or heritage speakers of Polish. Emphasis on developing oral proficiency in Polish using intensive methods of instruction. Six lecture hours a week for one semester. Polish 601C and 506 may not both be counted. Polish 601C and 507 may not both be counted.","upper":false},{"key":"POL 506","name":"First-Year Polish I","description":"Emphasis on four-skills proficiency. Five lecture hours a week for one semester. Polish 601C and 506 may not both be counted.","upper":false},{"key":"POL 507","name":"First-Year Polish II","description":"Emphasis on four-skills proficiency. Five lecture hours a week for one semester. Polish 601C and 507 may not both be counted. Prerequisite: Polish 506.","upper":false},{"key":"POL 611C","name":"Intensive Polish II","description":"Not open to native or heritage speakers of Polish. Continuing intensive development of proficiency in Polish, with a focus on speaking and the reading of authentic texts. Six lecture hours a week for one semester. Polish 611C and 312K may not both be counted. Polish 611C and 312L may not both be counted. Prerequisite: Polish 601C or 507.","upper":false},{"key":"POL 312K","name":"Second-Year Polish I","description":"Emphasis on four-skills proficiency. Three lecture hours a week for one semester. Polish 611C and 312K may not both be counted. Prerequisite: Polish 601C or 507.","upper":false},{"key":"POL 312L","name":"Second-Year Polish II","description":"Emphasis on four-skills proficiency. Three lecture hours a week for one semester. Polish 611C and 312L may not both be counted. Prerequisite: Polish 312K.","upper":false},{"key":"POL 321","name":"Introduction to the Polish Language I","description":"Designed to give students a rapid introduction to fundamentals of the language. Three lecture hours a week for one semester. May not be used to fulfill the foreign language requirement for any bachelor's degree.","upper":true},{"key":"POL 322","name":"Introduction to the Polish Language II","description":"Continuation of Polish 321. Three lecture hours a week for one semester. May not be used to fulfill the foreign language requirement for any bachelor's degree. Prerequisite: Polish 321 or consent of instructor.","upper":true},{"key":"POL 324","name":"Topics in Polish Studies","description":"Selected aspects of Polish history or culture. Readings and lectures in English. Three lecture hours a week for one semester. May not be used to fulfill the foreign language requirement for any degree. Some sections offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"POL 325","name":"Third-Year Polish I","description":"Oral expression, reading, and composition. Three lecture hours a week for one semester. Polish 325 and Russian, East European, and Eurasian Studies 325 (Topic: Third-Year Polish I) may not both be counted. Prerequisite: Polish 611C or 312L.","upper":true},{"key":"POL 326","name":"Third-Year Polish II","description":"Continuation of Polish 325: Oral expression, reading, and composition. Three lecture hours a week for one semester. Polish 326 and Russian, East European, and Eurasian Studies 325 (Topic: Third-Year Polish II) may not both be counted. Prerequisite: Polish 325.","upper":true},{"key":"POL 379","name":"Conference Course in Polish Language or Literature","description":"Conference course.  May be repeated for credit. Prerequisite: Six semester hours of upper-division coursework in Polish or consent of instructor.","upper":true}]