[{"key":"RUS 601C","name":"Intensive Russian I","description":"Not open to native or heritage speakers of Russian. Emphasis on developing oral proficiency in Russian using intensive methods of instruction. Six lecture hours a week for one semester. May not be counted by students with credit for Russian 804, 506, 506T, 507, or 507T.","upper":false},{"key":"RUS 506 (TCCN: RUSS 1511)","name":"First-Year Russian I","description":"Emphasis on four-skills proficiency: listening, speaking, reading, and writing. Five lecture hours a week for one semester. Russian 601C and 506 may not both be counted.","upper":false},{"key":"RUS 507 (TCCN: RUSS 1512)","name":"First-Year Russian II","description":"Emphasis on four-skills proficiency: listening, speaking, reading, and writing. Five lecture hours a week for one semester. Russian 601C and 507 may not both be counted. Prerequisite: Russian 506.","upper":false},{"key":"RUS 611C","name":"Intensive Russian II","description":"Not open to native or heritage speakers of Russian. Continuing intensive development of proficiency in Russian, with a focus on speaking and the reading of authentic texts. Six lecture hours a week for one semester. Only one of the following may be counted: Russian 611C, 612, 312K, 412K, 312M, 515S. Only one of the following may be counted: Russian 611C, 612, 312L, 412L. Prerequisite: Russian 601C, 804, 507, or 507T.","upper":false},{"key":"RUS 412K","name":"Second-Year Russian I","description":"Listening, speaking, reading, and writing at the second-year level. Four lecture hours a week for one semester. Russian 611C and 412K may not both be counted. Prerequisite: Russian 601C or 507.","upper":false},{"key":"RUS 412L","name":"Second-Year Russian II","description":"Listening, speaking, reading, and writing at the advanced, second-year level. Four lecture hours a week for one semester. Russian 611C and 412L may not both be counted. Prerequisite: Russian 412K.","upper":false},{"key":"RUS 324","name":"Third-Year Russian I","description":"Oral expression, reading, and composition. Three lecture hours a week for one semester. Prerequisite: Russian 611C or 412L.","upper":true},{"key":"RUS 325","name":"Third-Year Russian II","description":"Oral expression, reading, and composition. Three lecture hours a week for one semester. Prerequisite: Russian 324 or appropriate score on Russian placement examination.","upper":true},{"key":"RUS 326","name":"Topics in Fourth-Year Russian I","description":"A fourth-year course designed to enhance the student's skills in a variety of functional areas. Topics may include advanced oral communication, stylistics, Russian for business, literary translation of legal and business documents, scientific and technical translation. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"RUS 327","name":"Fourth-Year Russian II","description":"Continuation of Russian 326. Three lecture hours a week for one semester. Prerequisite: Russian 326.","upper":true},{"key":"RUS 328C","name":"Russian for Heritage Speakers I","description":"Designed for heritage Russian language speakers who have had little or no formal training in the language. Focuses on reading, writing, grammar, and communication skills for formal and professional situations. Three lecture hours a week for one semester. Russian 326 (Topic: Russian for Russians) and 328C may not both be counted. Prerequisite: Russian 412L, or an appropriate score on the Russian Placement Test and consent of instructor.","upper":true},{"key":"RUS 328D","name":"Russian for Heritage Speakers II","description":"Continuation of Russian 328C. Three lecture hours a week for one semester. Russian 326 (Topic: Russian for Russians) and 328D may not both be counted. Prerequisite: Russian 328C.","upper":true},{"key":"RUS 329","name":"Survey of Original Texts in Russian Literature","description":"Introduction to the reading and analysis of original literary texts representing prose, poetry, and drama, with emphasis on each work's cultural and historical background. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Two years of coursework in Russian, or the equivalent.","upper":true},{"key":"RUS 330","name":"Topics in Russian Culture","description":"Study of a selected aspect or aspects of Russian culture, including theatre, film, visual arts, folklore. Readings and lectures in English. Three lecture hours a week for one semester. May not be used to fulfill the foreign language requirement for any bachelor's degree. Some sections are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"RUS 356","name":"Russian Literature in Translation","description":"A survey of nineteenth- and/or twentieth-century Russian literature. Lectures and readings in English. Three lecture hours a week for one semester. May not be used to fulfill the foreign language requirement for any bachelor's degree. Some sections offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"RUS 360","name":"Study of an Individual Writer","description":"Readings in translation of selected works of one major Russian writer. Conducted in English. Three lecture hours a week for one semester. May not be used to fulfill the foreign language requirement for any bachelor's degree. Some sections offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"RUS 369","name":"Topics in Russian Linguistics","description":"Introduction to selected topics in the structure or history of Russian. Conducted in English. Three lecture hours a week for one semester. May not be used to fulfill the foreign language requirement for any bachelor's degree. Some sections offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"RUS 379","name":"Conference Course in Russian Language or Literature","description":"Conference course.  May be repeated for credit. Prerequisite: Six semester hours of upper-division coursework in Russian or consent of instructor and the chair of the department.","upper":true},{"key":"RUS 679H","name":"Honors Tutorial Course","description":"Supervised individual research on a literary or linguistic problem, which culminates in an honors paper of some length. Conference course for two semesters. Must be taken for special honors in addition to the major requirement. Prerequisite: For 679HA, upper-division standing, a University grade point average of at least 3.00, and a grade point average in Russian of at least 3.50; for 679HB, Russian 679HA.","upper":true}]