[{"key":"MIS 301","name":"Introduction to Information Technology Management","description":"Restricted to students in the McCombs School of Business. Explores how information technology helps to achieve competitive advantage and improve decision making, business processes, operations, and organizational design. Uses a cross-functional perspective to recognize the role of technology across business activities of management, finance, marketing, human resources, and operations. Three lecture hours a week for one semester. Management Information Systems 301 and 301H may not both be counted.","upper":false},{"key":"MIS 301H","name":"Introduction to Information Technology Management: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. Explores how information technology helps to achieve competitive advantage and improve decision making, business processes, operations, and organizational design. Uses a cross-functional perspective to recognize the role of technology across business activities of management, finance, marketing, human resources, and operations. Three lecture hours a week for one semester. Management Information Systems 301 and 301H may not both be counted.","upper":false},{"key":"MIS 302F","name":"Introduction to Information Technology Management","description":"Restricted to nonbusiness students. Explores how information technology helps to achieve competitive advantage and improve decision making, business processes, operations, and organizational design. Uses a cross-functional perspective to recognize the role of technology across business activities of management, finance, marketing, human resources, and operations. Three lecture hours a week for one semester. May not be counted toward the Bachelor of Business Administration degree. Management Information Systems 302F and 311F may not both be counted.","upper":false},{"key":"MIS 304","name":"Introduction to Problem Solving and Programming","description":"Restricted to students in the McCombs School of Business. Programming skills for creating easy-to-maintain systems for business applications. Object-oriented and structured methodologies with Visual Basic. Three lecture hours a week for one semester.  Offered on the letter-grade basis only.","upper":false},{"key":"MIS 310 (TCCN: BCIS 1305)","name":"Introduction to Management Information Systems","description":"Basic computer terminology, hardware and software, communications technology, graphics, systems analysis and design, and issues arising out of the rapidly evolving field of information systems. Students are expected to achieve a working knowledge of personal computer software, including operating system software and environments, as well as spreadsheets, analytical graphics, databases, and presentation software. Hands-on experience with the Internet and use of electronic mail. Three lecture hours a week for one semester.","upper":false},{"key":"MIS 325","name":"Database Management","description":"Restricted to students in the McCombs School of Business. Beginning and intermediate topics in data modeling for relational database management systems. Three lecture hours a week for one semester.  Offered on the letter-grade basis only.","upper":true},{"key":"MIS 333K","name":"Web Application Development","description":"Restricted to students in a business major. Concepts and practices of information systems. Advanced programming techniques used to generate menu-driven applications. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Management Information Systems 304 and 325.","upper":true},{"key":"MIS 353","name":"Internship in Management Information Systems","description":"Restricted to students in a business major. Focuses on students' career goals through academic discussion and evaluations, while placing students in professional internships with public and private enterprises. Internship and discussion hours to be arranged. Only one of the following may be counted toward the Bachelor of Business Administration: Accounting 353J, Business Administration 353, 353H, Finance 353, Management 353, Management Information Systems 353, Marketing 353, Operations Management 353. May not count toward the student's major requirement. Offered on the pass/fail basis only. Prerequisite: Completion of forty-five semester hours of college coursework and consent of the departmental internship coordinator.","upper":true},{"key":"MIS 366P","name":"Management Information Systems Practicum","description":"Restricted to students in a business major. Students apply skills in their major area and focus on additional project management skills through group projects conducted in a professional setting. Students may work with a private or a public enterprise. The equivalent of three lecture hours a week for one semester. Prerequisite: Forty-five semester hours of college coursework and consent of instructor.","upper":true},{"key":"MIS 373","name":"Topics in Management Information Systems","description":"Restricted to students in a business major. Provides in-depth treatment of business data processing concerns such as database management, telecommunications, and development of commercial systems. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Offered on the letter-grade basis only. Prerequisite: Varies with the topic.","upper":true},{"key":"MIS 374","name":"Business System Development","description":"Restricted to students in a McCombs School of Business major. Provides foundation in business system analysis, project management, planning, design, and implementation, using basic business knowledge and computer skills. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Seventy-five semester hours of college coursework, including Management Information Systems 333K.","upper":true},{"key":"MIS 375","name":"Strategic Information Technology Management","description":"Restricted to students with a major in business. Designed to develop an understanding and appreciation for the role of information technology in the context of a firm's strategy. Explores the impact of information technology on the economy and business performance, the emergence of electronic business applications and organizational and market transformation, and the nature of technology-driven business models and strategies. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Upper-division standing.","upper":true}]