[{"key":"SEL 601C","name":"Intensive Slavic and Eurasian Languages I","description":"Emphasis on basic communication skills in Slavic and Eurasian languages: listening, speaking, reading, and writing. Includes introduction to Slavic and Eurasian cultures. Six lecture hours a week for one semester. Slavic and Eurasian Languages 601C and 506 may not both be counted unless the languages vary. Slavic and Eurasian Languages 601C and 507 may not both be counted unless the languages vary. May be repeated for credit when the topics vary.","upper":false},{"key":"SEL 506","name":"First-Year Slavic and Eurasian Languages I","description":"Emphasis on four-skills proficiency: listening, speaking, reading, and writing. Five lecture hours a week for one semester. Slavic and Eurasian Studies 601C and 506 may not both be counted unless the languages vary. May be repeated for credit when the topics vary.","upper":false},{"key":"SEL 507","name":"First-Year Slavic and Eurasian Languages II","description":"Emphasis on four-skills proficiency: listening, speaking, reading, and writing. Five lecture hours a week for one semester. Slavic and Eurasian Languages 601C and 507 may not both be counted unless the languages vary. May be repeated for credit when the topics vary. Prerequisite: Slavic and Eurasian Languages 506 in the same language.","upper":false},{"key":"SEL 611C","name":"Intensive Slavic and Eurasian Languages II","description":"Continuing intensive development of communication abilities in Slavic and Eurasian languages with emphasis on the four basic skills: listening, speaking, reading, and writing. Includes an introduction to Slavic and Eurasian cultures. Six lecture hours a week for one semester. Slavic and Eurasian Languages 611C and 312K may not both be counted unless the languages vary. Slavic and Eurasian Languages 611C and 312L may not both be counted unless the languages vary. May be repeated for credit when the topics vary. Prerequisite: Slavic and Eurasian Languages 601C or 507 in the same language.","upper":false},{"key":"SEL 312K","name":"Second-Year Slavic and Eurasian Languages I","description":"Listening, speaking, reading, and writing at the second-year level. Three lecture hours a week for one semester. Slavic and Eurasian Studies 611C and 312K may not both be counted unless the languages vary. May be repeated for credit when the topics vary. Prerequisite: Slavic and Eurasian Languages 601C or 507 in the same language.","upper":false},{"key":"SEL 312L","name":"Second-Year Slavic and Eurasian Languages II","description":"Listening, speaking, reading, and writing at the advanced, second-year level. Three lecture hours a week for one semester. Slavic and Eurasian Languages 611C and 312L may not both be counted unless the languages vary. May be repeated for credit when the topics vary. Prerequisite: Slavic and Eurasian Languages 312K in the same language.","upper":false}]