[{"key":"FR 301","name":"French for Graduate Students in Other Departments","description":"No auditors permitted. Intensive reading course for graduate students, emphasizing basic grammar and vocabulary with translation practice. Three lecture hours a week for one semester. The symbol CR fulfills the foreign language requirement for the Doctor of Philosophy degree in some departments. May not be used to fulfill the foreign language requirement for any bachelor's degree. Offered on the credit/no credit basis only. Prerequisite: Graduate standing.","upper":false},{"key":"FR 601C","name":"Beginning French","description":"An intensive beginning course with an emphasis on basic skills: listening, speaking, reading, and writing. Six lecture hours a week for one semester. Only one of the following may be counted: French 601C, 604, 506. Only one of the following may be counted: French 601C, 604, 507, 508K.","upper":false},{"key":"FR 604","name":"Accelerated First-Year French","description":"Designed for students of high motivation. A six-hour course comparable to French 506 and 507. Six lecture hours a week for one semester. Only one of the following may be counted: French 601C, 604, 506. Only one of the following may be counted: French 601C, 604, 507, 508K.","upper":false},{"key":"FR 506 (TCCN: FREN 1511)","name":"First-Year French I","description":"Emphasis on basic skills: listening, speaking, reading, and writing. Designed for students with no previous coursework in French. Five lecture hours a week for one semester. Only one of the following may be counted: French 601C, 604, 506.","upper":false},{"key":"FR 507 (TCCN: FREN 1512)","name":"First-Year French II","description":"Five lecture hours a week for one semester. Only one of the following may be counted: French 601C, 604, 507, 508K. Prerequisite: French 506 completed at the University with a grade of at least C.","upper":false},{"key":"FR 508K","name":"Alternate First-Year French II","description":"An accelerated review of material covered in French 506, followed by study of new material covered in French 507. Five lecture hours a week for one semester. Only one of the following may be counted: French 601C, 604, 507, 508K. Prerequisite: Transfer credit or credit by examination for French 506; or credit for French 506 earned at the University more than one calendar year prior to registering, with a grade of at least C.","upper":false},{"key":"FR 611C","name":"Intermediate French","description":"An intensive intermediate course with emphasis on basic skills: listening, speaking, reading, and writing. Does not meet the prerequisite requirements for French 320E or 324L. Six lecture hours a week for one semester. Only one of the following may be counted: French 611C, 612, 312K. French 310L and 611C may not both be counted. French 611C and 612 may not both be counted. French 611C and 312L may not both be counted. Prerequisite: French 601C, 604, 507, or 508K with a grade of at least C.","upper":false},{"key":"FR 612","name":"Accelerated Second-Year French: Four Skills","description":"Designed for students of high motivation. A six-hour course comparable to French 312K and 312L combined. Six lecture hours a week for one semester. Only one of the following may be counted: French 310L, 612, 312L, 312N. Only one of the following may be counted: French 611C, 612, 312K. French 611C and 612 may not both be counted. Prerequisite: French 604, 507, or 508K with a grade of at least C.","upper":false},{"key":"FR 312K (TCCN: FREN 2311)","name":"Second-Year French I: Four Skills","description":"Listening, speaking, reading, and writing at the second-year level. Three lecture hours a week for one semester. Only one of the following may be counted: French 611C, 612, 312K. Prerequisite: French 604, 507, or 508K with a grade of at least C.","upper":false},{"key":"FR 312L (TCCN: FREN 2312)","name":"Second-Year French II: Four Skills","description":"Listening, speaking, reading, and writing at the advanced, second-year level. Three lecture hours a week for one semester. Only one of the following may be counted: French 310L, 612, 312L, 312N. French 611C and 312L may not both be counted. Prerequisite: French 312K with a grade of at least C.","upper":false},{"key":"FR 317C","name":"Enhancing French Skills","description":"Listening, speaking, reading, and writing course designed to provide additional preparation for upper-division French courses. Three lecture hours a week for one semester. Prerequisite: French 611C with a grade of at least C.","upper":false},{"key":"FR 118L","name":"Practice in Spoken French","description":"Designed to be taken concurrently with French 317C. Two lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: French 611C or 312K with a grade of at least C.","upper":false},{"key":"FR 320E","name":"Advanced French I","description":"Designed to develop the listening, speaking, reading, and writing skills needed for the analysis of literary and cultural readings in the French-speaking world. Three lecture hours a week for one semester. Prerequisite: French 612, 312L, (312N), or 317C with a grade of at least C.","upper":true},{"key":"FR 120M","name":"Advanced Practice in Spoken French I","description":"Two lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: French 612, 312L, (312N), or 317C with a grade of at least C.","upper":true},{"key":"FR 120N","name":"Advanced Practice in Spoken French II","description":"Two lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: Completion of at least one upper-division French course, or equivalent proficiency.","upper":true},{"key":"FR 322E","name":"Advanced French II","description":"Continuation of French 320E. Designed to develop the listening, speaking, reading, and writing skills needed to analyze literary and cultural readings in the French-speaking world. Three lecture hours a week for one semester. Prerequisite: French 320E.","upper":true},{"key":"FR 324L","name":"Practical Phonetics","description":"A thorough review of French phonetics, with emphasis on improving production and understanding of spoken French. Three lecture hours a week for one semester. Prerequisite: French 612, 312L, (312N), or 317C with a grade of at least C.","upper":true},{"key":"FR 326K","name":"Introduction to French Literature I: From the Middle Ages through the Eighteenth Century","description":"Introduction to the reading and analysis of representative texts, with some attention to cultural and historical background. Three lecture hours a week for one semester. Prerequisite: French 320E.","upper":true},{"key":"FR 326L","name":"Introduction to French Literature II: From the French Revolution to the Present","description":"Introduction to the reading and analysis of representative texts, with some attention to cultural and historical background. Three lecture hours a week for one semester. Prerequisite: French 320E.","upper":true},{"key":"FR 130D","name":"French across Disciplines","description":"Students read and discuss French language materials related to the subject matter of another designated course. One lecture hour a week for one semester. Prerequisite: Upper-division standing and three semester hours of upper-division coursework in French.","upper":true},{"key":"FR 330K","name":"Studies in French Language and Cultures","description":"Topics with a focus on language or culture. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: French 320E.","upper":true},{"key":"FR 340C","name":"The Arts in France","description":"A survey of the major artistic styles, modes, and currents in painting, architecture, sculpture, the decorative arts, and costume, from the medieval through the contemporary periods. Three lecture hours a week for one semester. Prerequisite: French 320E.","upper":true},{"key":"FR 340P","name":"The Making and Identity of France","description":"The general political history of France, from the nation's inception to its current existence as part of the European Community. Three lecture hours a week for one semester. Prerequisite: French 320E.","upper":true},{"key":"FR 340T","name":"France and the Francophone World Today","description":"An introduction to life in France and francophone regions through the study of contemporary society and culture. Three lecture hours a week for one semester. Only one of the following may be counted: European Studies 340M, French 340T, French Civilization 340M. Prerequisite: French 320E.","upper":true},{"key":"FR 342C","name":"French for Business","description":"Development of the ability to function in French in business-related situations, both orally and in writing. Three lecture hours a week for one semester. Prerequisite: French 320E.","upper":true},{"key":"FR 348","name":"French Drama Workshop","description":"Intensive analysis of one or several plays or short literary texts, with emphasis on diction, delivery of lines, acting and staging; public performance of one play. The equivalent of three lecture hours a week for one semester. Prerequisite: French 320E.","upper":true},{"key":"FR 355","name":"Topics in Medieval and Renaissance French Literature","description":"Study of literary texts from the Middle Ages and the Renaissance. Topics may focus on a specific writer or period, a genre, or a theme. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in French.","upper":true},{"key":"FR 357","name":"Topics in French Literature from the Nineteenth Century to the Present","description":"Study of literary texts since the French revolution. Topics may focus on a specific writer or period, a literary mode or movement, a genre, or a theme. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in French.","upper":true},{"key":"FR 358","name":"Seminar in French and Francophone Studies","description":"Topics in literature or culture, with a focus on study in depth or on synthesis. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in French.","upper":true},{"key":"FR 359","name":"Topics in French Linguistics","description":"Advanced introduction to linguistic analysis of French. Topics may include analysis of contemporary French, introduction to French linguistics, contrastive analysis of French and English, and advanced French grammar. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of upper-division coursework in French.","upper":true},{"key":"FR 364L","name":"Introduction to French Linguistics","description":"Introduction to the syntactic, phonological, morphological, lexical, historical, and applied aspects of French linguistics. Three lecture hours a week for one semester. Prerequisite: Six semester hours of upper-division coursework in French.","upper":true},{"key":"FR 371L","name":"Advanced Written and Oral Composition","description":"Designed to guide students toward smooth and effective written and oral expression; weekly compositions on assigned topics; periodic oral presentations. Three lecture hours a week for one semester. Prerequisite: French 320E and 322E.","upper":true},{"key":"FR 372","name":"Comparative Stylistics","description":"Comparison of contemporary French and English syntax and style; study and practice in the technical difficulties of English-to-French and French-to-English translation. Three lecture hours a week for one semester. Prerequisite: French 320E and 322E.","upper":true},{"key":"FR 379H","name":"Honors Tutorial Course","description":"Supervised individual research on a literary, linguistic, or cultural topic, and writing and defense of a thesis under the direction of a committee of two faculty members. Conference course. Prerequisite: Admission to the French Honors Program.","upper":true}]