[{"key":"F C 320","name":"The French Heritage","description":"Introduction to French civilization: architecture, painting, music, and social and political history. Given in English; requires no knowledge of French. Three lecture hours a week for one semester. May not be counted toward a major or minor in French. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: Upper-division standing.","upper":true},{"key":"F C 339","name":"The Development of the French Film","description":"Films in French, with subtitles in English; lectures in English. Three lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. English 322 (Topic 20: The Development of the French Film) and French Civilization 339 may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"F C 340M","name":"Continuity and Change in Modern France","description":"Same as European Studies 340M. Focuses on various social, political, and cultural crises in France from the revolution of 1789 to the present time. Three lecture hours a week for one semester. Only one of the following may be counted: European Studies 340M, French 340T, French Civilization 340M. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: Upper-division standing.","upper":true},{"key":"F C 345","name":"Studies in the Cultures of French-Speaking Peoples","description":"Lectures and readings in English. Three lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"F C 349","name":"French Literature in Translation","description":"Three lecture hours a week for one semester.   May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true}]