[{"key":"ITL 601C","name":"Beginning Italian","description":"An intensive beginning course with an emphasis on basic skills: listening, speaking, reading, and writing. Six lecture hours a week for one semester. Only one of the following may be counted: Italian 601C, 604, 506. Only one of the following may be counted: Italian 601C, 604, 507.","upper":false},{"key":"ITL 604","name":"Accelerated First-Year Italian","description":"Designed for students of high motivation. A six-hour course comparable to Italian 506 and 507. Six lecture hours a week for one semester. Only one of the following may be counted: Italian 601C, 604, 506. Only one of the following may be counted: Italian 601C, 604, 507.","upper":false},{"key":"ITL 305","name":"Introduction to Italian Language and Culture","description":"An introductory course in Italian language and culture taught in Castiglion-Fiorentino, Italy. Three lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Designed for students studying abroad who wish to receive University credit.","upper":false},{"key":"ITL 506 (TCCN: ITAL 1511)","name":"First-Year Italian I: Language and Culture","description":"Grounding in the basic skills: listening, speaking, reading, and writing; one class hour a week devoted to Italian cultural topics. Five lecture hours a week for one semester. Only one of the following may be counted: Italian 601C, 604, 506.","upper":false},{"key":"ITL 507 (TCCN: ITAL 1512)","name":"First-Year Italian II: Language and Culture","description":"Emphasis on basic skills: listening, speaking, reading, and writing; one class hour a week devoted to Italian cultural topics. Five lecture hours a week for one semester. Only one of the following may be counted: Italian 601C, 604, 507. Prerequisite: Italian 506 with a grade of at least C.","upper":false},{"key":"ITL 611C","name":"Intermediate Italian","description":"An intensive intermediate course with an emphasis on basic skills: listening, speaking, reading, and writing. Does not meet the prerequisite requirements for Italian 328, 326K, or 326L. Six lecture hours a week for one semester. Only one of the following may be counted: Italian 611C, 612, 312K. Only one of the following may be counted: Italian 611C, 612, 312L. Prerequisite: Italian 601C, 604, or 507 with a grade of at least C.","upper":false},{"key":"ITL 612","name":"Accelerated Second-Year Italian","description":"Comparable to Italian 312K and 312L combined. Intensive work in writing, reading, and speaking at the second-year level. Six lecture hours a week for one semester. Only one of the following may be counted: Italian 611C, 612, 312K. Only one of the following may be counted: Italian 611C, 612, 312L. Prerequisite: Italian 604 or 507 with a grade of at least C.","upper":false},{"key":"ITL 312K (TCCN: ITAL 2311)","name":"Second-Year Italian I","description":"Listening, speaking, reading, and writing at the second-year level. Three lecture hours a week for one semester. Only one of the following may be counted: Italian 611C, 612, 312K. Prerequisite: Italian 604 or 507 with a grade of at least C.","upper":false},{"key":"ITL 312L (TCCN: ITAL 2312)","name":"Second-Year Italian II","description":"Listening, speaking, reading, and writing at the advanced second-year level. Three lecture hours a week for one semester. Only one of the following may be counted: Italian 611C, 612, 312L. Prerequisite: Italian 312K with a grade of at least C.","upper":false},{"key":"ITL 317C","name":"Enhancing Italian Skills","description":"Listening, speaking, reading, and writing course designed to provide students who have credit for Italian 611C with additional preparation for upper-division Italian courses. Three lecture hours a week for one semester. Prerequisite: Italian 611C with a grade of at least C.","upper":false},{"key":"ITL 118K","name":"Practice in Spoken Italian I","description":"Designed to be taken concurrently with Italian 312K. Two lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: Italian 604 or 507 with a grade of at least C.","upper":false},{"key":"ITL 118L","name":"Practice in Spoken Italian II","description":"Designed to be taken concurrently with Italian 312L. Two lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: Italian 611C or 312K with a grade of at least C.","upper":false},{"key":"ITL 321","name":"Introduction to Italian Literature","description":"Reading and analysis of literature, literary criticism, textual analysis. Three lecture hours a week for one semester. Italian 321 and 326K may not both be counted. Italian 321 and 326L may not both be counted. Prerequisite: Italian 328 with a grade of at least C.","upper":true},{"key":"ITL 322L","name":"Tradition and Change in Contemporary Italy","description":"An analysis of Italy's trends and of conflicting values in its political, economic, and social development. Three lecture hours a week for one semester. Prerequisite: Three semester hours of upper-division coursework in Italian.","upper":true},{"key":"ITL 326K","name":"Introduction to Italian Literature I: From the Middle Ages to the Eighteenth Century","description":"Introduction to the reading and analysis of representative texts, with some attention to cultural and historical background. Three lecture hours a week for one semester. Italian 321 and 326K may not both be counted. Prerequisite: Credit or registration for Italian 328.","upper":true},{"key":"ITL 326L","name":"Introduction to Italian Literature II: From the Eighteenth Century to the Present","description":"Introduction to the reading and analysis of representative texts, with some attention to cultural and historical background. Three lecture hours a week for one semester. Italian 321 and 326L may not both be counted. Prerequisite: Credit or registration for Italian 328.","upper":true},{"key":"ITL 328","name":"Composition and Conversation","description":"Focuses on idioms, grammar, syntax, and style. Three lecture hours a week for one semester. Prerequisite: Italian 611C, 612, or 312L with a grade of at least C.","upper":true},{"key":"ITL 329","name":"Advanced Composition and Conversation","description":"Advanced work in writing and speech, based on current events and contemporary readings. Three lecture hours a week for one semester. Prerequisite: Italian 328.","upper":true},{"key":"ITL 130D","name":"Italian across Disciplines","description":"Students read and discuss Italian language materials related to the subject matter of another designated course. One lecture hour a week for one semester. Prerequisite: Upper-division standing, three semester hours of upper-division coursework in Italian, and consent of instructor.","upper":true},{"key":"ITL 330K","name":"Studies in Italian Language","description":"Study in specific areas of Italian language. Topics may include history of the Italian language, applied Italian linguistics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Italian 328.","upper":true},{"key":"ITL 331","name":"Topics in Italian Culture","description":"Analysis of Italian culture. Texts include literature, film, popular culture, and other forms. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Italian 328.","upper":true},{"key":"ITL 348","name":"Italian Drama Workshop","description":"Intensive analysis of one or several plays or short literary texts, with emphasis on diction, delivery of lines, and acting and staging. Three lecture hours a week for one semester, with additional rehearsal hours to be arranged. Prerequisite: The following coursework with a grade of at least C in each: Italian 321 and 328, or Italian 326K and 326L.","upper":true},{"key":"ITL 365","name":"Conference Course in Italian Language and Literature","description":"Course content varies according to needs of students; designed to fill in gaps and give students a good overall picture of the development of Italian literature. Conference course. Prerequisite: Upper-division standing and consent of the undergraduate adviser or the chair. Italian majors may take conference courses only in exceptional cases.","upper":true},{"key":"ITL 375","name":"Studies in Italian Literature","description":"Intensive examination of a period or a major writer. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: The following coursework with a grade of at least C in each: Italian 321 and 328, or Italian 326K and 326L.","upper":true},{"key":"ITL 379H","name":"Honors Tutorial Course","description":"Supervised individual research on a literary, linguistic, or cultural topic, and writing and defense of a thesis under the direction of a committee of two faculty members. Conference course. Prerequisite: Admission to the Italian Honors Program.","upper":true}]