[{"key":"PHL 301 (TCCN: PHIL 1301)","name":"Introduction to Philosophy","description":"Primarily for lower-division students. A survey of principal topics and problems in areas such as ethics, theory of knowledge, and philosophy of religion. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. Philosophy 301 and 610QA may not both be counted.","upper":false},{"key":"PHL 301K (TCCN: PHIL 2316)","name":"Ancient Philosophy","description":"Same as Classical Civilization 304C (Topic 6). Primarily for lower-division students. An introduction to the philosophical achievements of the ancient world, concentrating on Plato and Aristotle. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Classical Civilization 304C (Topic: Ancient Philosophy), 304C (Topic 6), Philosophy 301K.","upper":false},{"key":"PHL 301L","name":"Early Modern Philosophy","description":"Primarily for lower-division students. An introduction to the philosophical achievements of the seventeenth and eighteenth centuries, concentrating on such figures as Descartes, Hume, and Kant. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":false},{"key":"PHL 302","name":"World Philosophy","description":"Primarily for lower-division students. Basic issues of philosophy in Western and non-Western traditions, such as the nature of philosophy, its relation to religion and science, the self, knowledge, and virtue. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. Asian Studies 301M (Topic 7: World Philosophy) and Philosophy 302 may not both be counted.","upper":false},{"key":"PHL 302C","name":"Ethics and Enlightenment","description":"Primarily for lower-division students. A study of non-Western ethics, especially in Hindu and Buddhist traditions. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":false},{"key":"PHL 303","name":"Human Nature","description":"Primarily for lower-division students. Theories of human nature, such as those of Plato, Christianity, Marxism, and existentialism. Modern psychological and biological theories are included, as the interplay of nature and nurture in determining human conduct is explored. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":false},{"key":"PHL 303M","name":"Mind and Body","description":"Primarily for lower-division students. Introduction to philosophical issues about the nature of mind and its relation to body: What is mind? Do people have free will? How does psychology relate to neuroscience? Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":false},{"key":"PHL 304","name":"Contemporary Moral Problems","description":"Primarily for lower-division students. Philosophical examination of selected moral problems arising out of contemporary society and culture. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":false},{"key":"PHL 305 (TCCN: PHIL 2321)","name":"Introduction to the Philosophy of Religion","description":"Same as Religious Studies 305. Primarily for lower-division students. A critical examination of various conceptions of God and of the relationship of the human and the divine. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":false},{"key":"PHL 306","name":"Philosophical Thinkers","description":"Primarily for lower-division students. An introduction to major areas of philosophy through the study of selected philosophical thinkers. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"PHL 310","name":"Knowledge and Reality","description":"An introduction to basic issues in epistemology and metaphysics. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. Philosophy 310 and 610QA may not both be counted. Prerequisite: Some sections are restricted to philosophy majors, some to students with a University grade point average of at least 3.00 or consent of instructor; these sections are identified in the Course Schedule.","upper":false},{"key":"PHL 610Q","name":"Problems of Knowledge and Valuation","description":"Restricted to students in the Plan II Honors Program. Methods and aims of selected sciences, arts, and philosophy in the attainment of knowledge and in providing the basis for valuation. Three lecture hours and one discussion hour a week for two semesters. Philosophy 301 and 610QA may not both be counted; Philosophy 310 and 610QA may not both be counted; Philosophy 610QB and 318 may not both be counted. Prerequisite: For 610QA, admission to the Plan II Honors Program; for 610QB, Philosophy 610QA.","upper":false},{"key":"PHL 311","name":"Argument","description":"Argument as a kind of discourse: deductive and inductive arguments; principles of reasoning; fallacies; practical applications. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":false},{"key":"PHL 312 (TCCN: PHIL 2303)","name":"Introduction to Logic","description":"Logical structure of sentences and arguments; elementary symbolic methods; applications. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. May not be counted by students with prior credit for Philosophy 313, 313K, 313Q, or 344K.","upper":false},{"key":"PHL 313","name":"Introductory Symbolic Logic","description":"Introduction to symbolic logic (through first-order predicate logic); interpretations; formal proofs, consistency; some practical applications. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Computer Science 313H, 313K, Philosophy 313, 313K, 313Q.","upper":false},{"key":"PHL 313Q","name":"Logic and Scientific Reasoning","description":"Introduction to formal proofs, semantics, quantifiers, inductive methods, decision theory, and scientific reasoning. Three lecture hours and one laboratory hour a week for one semester. Only one of the following may be counted: Computer Science 313H, 313K, Philosophy 313, 313K, 313Q. Philosophy 313Q and Tutorial Course 310 may not both be counted. Prerequisite: Admission to the Plan II Honors Program.","upper":false},{"key":"PHL 316K","name":"Science and Philosophy","description":"Introduction to scientific method, including discussion of the nature and goals of science. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. May not be counted by students with credit for Philosophy 363.","upper":false},{"key":"PHL 317K","name":"Introduction to the Philosophy of the Arts","description":"Classic issues in the philosophy of art and beauty, illustrated from the fine arts and contemporary media: literature, drama, music, painting, film, and television. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"PHL 318 (TCCN: PHIL 2306)","name":"Introduction to Ethics","description":"Study of basic principles of the moral life, with critical examination of traditional and contemporary theories of the nature of goodness, happiness, duty, and freedom. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. Philosophy 610QB and 318 may not both be counted.","upper":false},{"key":"PHL 318K (TCCN: PHIL 2307)","name":"Introduction to Political Philosophy","description":"Views of major political philosophers on humanity, nature, and society; discussions of contemporary political ideologies. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":false},{"key":"PHL 321K","name":"Theory of Knowledge","description":"Systematic and detailed study of major issues in the theory of knowledge, such as the distinction between knowledge and belief, the criteria of knowledge, the justification of knowledge-claims, and perception. Three lecture hours a week for one semester. Prerequisite: Six semester hours of coursework in philosophy.","upper":true},{"key":"PHL 322","name":"Science and the Modern World","description":"The historical development and impact of scientific ideas through the modern period to the present. Three lecture hours a week for one semester.","upper":true},{"key":"PHL 322K","name":"History of Ethics","description":"Survey of ethical theories from ancient times through the nineteenth century. Three lecture hours a week for one semester.","upper":true},{"key":"PHL 323K","name":"Metaphysics","description":"Problems of substance, change, categories of being, mind, body, space and time, approached either systematically or historically. Three lecture hours a week for one semester. Prerequisite: Six semester hours of coursework in philosophy.","upper":true},{"key":"PHL 323M","name":"Philosophy of Mind","description":"Problems concerning the nature of mind and mental phenomena: the relation between mind and body, knowledge of other minds, the computational model of mind, mental causation, intentionality, and consciousness. Three lecture hours a week for one semester. Prerequisite: Six semester hours of coursework in philosophy.","upper":true},{"key":"PHL 325C","name":"Environmental Ethics","description":"Moral issues concerning the relation of human beings to the environment, including biodiversity, resource depletion, and animal rights. Three lecture hours and one discussion hour a week for one semester.","upper":true},{"key":"PHL 325K","name":"Ethical Theories","description":"Major traditional and contemporary ethical theories discussed and critically examined. Three lecture hours a week for one semester. Prerequisite: Six semester hours of coursework in philosophy.","upper":true},{"key":"PHL 327","name":"Contemporary Philosophy","description":"Currents of contemporary thought; past topics include feminism, philosophy, and science; ideas of the twentieth century; twentieth-century philosophy of mind. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"PHL 328","name":"Nineteenth-Century Philosophy","description":"Major figures in nineteenth-century European philosophy, including Hegel, Schopenhauer, Kierkegaard, Nietzsche, and Mill. Three lecture hours a week for one semester. Prerequisite: Three semester hours of coursework in philosophy.","upper":true},{"key":"PHL 329K","name":"History of Ancient Philosophy","description":"Same as Classical Civilization 348 (Topic 4: History of Ancient Philosophy). Development of Western philosophy from the pre-Socratics to the early Christian era; emphasis on Plato and Aristotle. Three lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Classical Civilization 342 (Topic: History of Ancient Philosophy), 348 (Topic 4), Philosophy 329K. Prerequisite: Six semester hours of coursework in philosophy.","upper":true},{"key":"PHL 329L","name":"Early Modern Philosophy: Descartes to Kant","description":"Three lecture hours and one discussion hour a week for one semester. Prerequisite: Six semester hours of coursework in philosophy.","upper":true},{"key":"PHL 329M","name":"Philosophical Classics","description":"Intensive study of one or two important philosophers or philosophical works from the eighteenth century or earlier. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Three semester hours of coursework in philosophy.","upper":true},{"key":"PHL 329U","name":"Perspectives on Science and Mathematics","description":"An examination of five notable episodes in the history of science: Galileo's conflict with the Catholic Church, Isaac Newton's formulation of the laws of motion, Charles Darwin's proposal of the theory of evolution by natural selection, the development of the atomic bomb, and the discovery of the double helix structure of DNA. Three lecture hours a week for one semester. Only one of the following may be counted: History 329U, 366N (Topic: Perspectives on Science and Mathematics), Philosophy 329U. Prerequisite: Upper-division standing and consent of instructor.","upper":true},{"key":"PHL 330K","name":"Ancient Philosophy after Aristotle","description":"Same as Classical Civilization 330K. Epicureans, Stoics, Skeptics, Plotinus and the Neoplatonist tradition. No knowledge of Greek is required. Three class hours a week for one semester. Prerequisite: Six semester hours of coursework in philosophy.","upper":true},{"key":"PHL 332","name":"Philosophy of Language","description":"Contemporary theories of meaning and linguistic structure, and their relationships to epistemology, metaphysics, and ethics. Three lecture hours a week for one semester. Prerequisite: Six semester hours of coursework in philosophy.","upper":true},{"key":"PHL 334K","name":"Modern Thinkers","description":"Critical study of the philosophical implications of the works of selected modern thinkers; for example, Nietzsche, Sartre, Camus, and Freud. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Three semester hours of coursework in philosophy.","upper":true},{"key":"PHL 342","name":"Political Philosophy","description":"Critical examination of leading theories of the state, including analysis of such concepts as sovereignty, obligation, rights, and freedom. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"PHL 344K","name":"Intermediate Symbolic Logic","description":"Same as Mathematics 344K. A second-semester course in symbolic logic: formal syntax and semantics, basic metatheory (soundness, completeness, compactness, and Loewenheim-Skolem theorems), and further topics in logic. Three lecture hours a week for one semester. Prerequisite: Philosophy 313, 313K, or 313Q.","upper":true},{"key":"PHL 344M","name":"Philosophy of Mathematics","description":"Philosophical issues concerning mathematics and its foundations, such as the correlation of mathematics to logic, mathematical truth, and mathematical knowledge. Three lecture hours a week for one semester.","upper":true},{"key":"PHL 346","name":"Aesthetics","description":"Study of selected topics in the philosophy of art; may be restricted to one or several specific art forms or media: literature, painting, music, film, television, or theatre. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"PHL 346K","name":"Aesthetics","description":"The nature and purpose of art and the aesthetic experience. Key theories of aesthetics, both in the history of Western aesthetics and in Eastern traditions. Three lecture hours a week for one semester. Philosophy 346 and 346K may not both be counted.","upper":true},{"key":"PHL 347","name":"Philosophy of Law","description":"The significance and function of law in political and ethical contexts; comparison of common and statutory to scientific and moral law; readings from among Plato, Kant, Hegel, Bentham, Austin, Hart, Dworkin, Feinberg, and others. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.","upper":true},{"key":"PHL 348","name":"Asian Philosophy","description":"Comparative and historical studies in the philosophical and religious traditions of the East, with emphasis on India and China. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"PHL 349","name":"History of Medieval and Renaissance Philosophy","description":"Philosophical thought from Augustine through Cusanus and Vico, with emphasis on its cultural bearing. Three lecture hours a week for one semester. Prerequisite: Three semester hours of coursework in philosophy.","upper":true},{"key":"PHL 354","name":"Philosophy in Context","description":"Philosophical texts and arguments in a broad intellectual and cultural context, or other texts studied for their philosophical content. Typical topics include Locke and the Glorious Revolution; materialism and modern science; Thucydides on power and justice. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"PHL 356","name":"Philosophy of Religion","description":"Meaning and function of religion; religious belief and its validity; religious values in the modern world. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester.  May be repeated for credit when the topics vary.","upper":true},{"key":"PHL 358","name":"Philosophical Logic","description":"Issues in philosophical logic and its applications, such as theories of meaning, logical paradoxes, epistemic logic, deontic logic, modal logic, existence, and identity. Three lecture hours a week for one semester. Prerequisite: Philosophy 313, 313K, or 313Q.","upper":true},{"key":"PHL 361K","name":"Philosophy in Literature","description":"Formulation, analysis, and criticism of philosophical ideas in selected literary works. Three lecture hours a week for one semester.","upper":true},{"key":"PHL 363","name":"Scientific Method","description":"History, exposition, and analysis of such fundamental concepts in the natural and social sciences as explanation, prediction, discovery, confirmation, laws, hypotheses, theories. Three lecture hours a week for one semester.","upper":true},{"key":"PHL 363L","name":"Topics in Philosophy of Science","description":"Past topics include philosophy of biology; scientific hypotheses and evidence; philosophical consequences of quantum mechanics. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Additional hours may be required for some topics.  May be repeated for credit when the topics vary.","upper":true},{"key":"PHL 365","name":"Selected Problems in Philosophy","description":"Past topics include Jewish ethics; change, truth, and justice. The equivalent of three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"PHL 366K","name":"Existentialism","description":"Existentialism and its relationship to literature, psychoanalysis, and Marxism. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. Philosophy 366K and Religious Studies 356E may not both be counted.","upper":true},{"key":"PHL 371H","name":"Philosophy Honors","description":"Close study of major works of philosophy. Three lecture hours and one discussion hour a week for one semester.  May be repeated for credit. Prerequisite: Six semester hours of coursework in philosophy and a University grade point average of at least 3.50.","upper":true},{"key":"PHL 375M","name":"Major Seminar","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Nine semester hours of coursework in philosophy.","upper":true},{"key":"PHL 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, followed by research and writing to produce a substantial paper on a special topic in philosophy, to be completed during the second semester. Conference course for two semesters. Prerequisite: For 679HA, admission to the Philosophy Honors Program; for 679HB, Philosophy 679HA.","upper":true},{"key":"PHL 379K","name":"Conference Course","description":"Intensive tutorial study of selected problems in philosophy. Conference course.  May be repeated for credit. Prerequisite: Nine semester hours of upper-division coursework in philosophy and consent of instructor and the undergraduate adviser in philosophy.","upper":true}]