[{"key":"N S 000","name":"Drill","description":"Three laboratory hours a week for one semester.","upper":false},{"key":"N S 302","name":"Introduction to Naval Science","description":"A general introduction to sea power and the naval service, including the mission, organization, regulations, warfare components, and personnel programs. Three lecture hours a week for one semester.","upper":false},{"key":"N S 603","name":"Naval Ships Systems I and II","description":"Introduction to types, structures, and purposes of naval ships and weapons systems. Three lecture hours a week for two semesters.","upper":false},{"key":"N S 312","name":"Sea Power and Maritime Affairs","description":"A consideration of the influence of sea power, naval history, and maritime affairs on current events and national policy. Three lecture hours a week for one semester. Prerequisite: Consent of instructor.","upper":false},{"key":"N S 326","name":"Evolution of Warfare","description":"Explores the forms of warfare employed by great leaders in history as they relate to the evolution of warfare. Three lecture hours a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"N S 329","name":"Navigation and Naval Operations I","description":"An introduction to piloting, a survey of navigational aids, and a study of the Rules of the Nautical Road. Three lecture hours a week for one semester.","upper":true},{"key":"N S 330","name":"Leadership and Ethics","description":"Principles of leadership and ethics reinforced through seminar discussion and case studies. Discussion of the duties and responsibilities of a naval officer. Three lecture hours a week for one semester. Prerequisite: Naval Science 335 and consent of instructor.","upper":true},{"key":"N S 335","name":"Leadership and Management","description":"Study of leadership and management theory in organizations, with emphasis on examining the leadership process in the context of the dynamic interaction of the leader, the followers, and the situation. Three lecture hours a week for one semester. Prerequisite: Consent of instructor.","upper":true},{"key":"N S 362","name":"Amphibious Warfare","description":"Defines the concept of amphibious warfare, explores its doctrinal origins, and traces its evolution as an element of naval policy during the twentieth century. Three lecture hours a week for one semester.","upper":true},{"key":"N S 369","name":"Navigation and Naval Operations II","description":"Study of the celestial sphere and nautical astronomy to determine positions on the earth by mathematical analysis, and an introduction to relative motion and the maneuvering board. Three lecture hours a week for one semester.","upper":true}]