[{"key":"GOV 105","name":"Texas Government","description":"A brief survey of the organization and process of Texas government. Topics include the Constitution, political parties, interest groups, elections, branches of government, taxing and spending. The equivalent of one lecture hour a week for one semester.","upper":false},{"key":"GOV 310L (TCCN: GOVT 2301)","name":"American Government","description":"A basic survey of American government, including fundamental political institutions, federal, state, and local; special attention to the United States and Texas Constitutions. Part of a six-semester-hour integrated sequence, the second half of which is Government 312L. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Fulfills first half of legislative requirement for government. Prerequisite: Twelve semester hours of college coursework and a passing score on the reading section of the Texas Higher Education Assessment (THEA) test (or an appropriate assessment test).","upper":false},{"key":"GOV 312L (TCCN: GOVT 2302)","name":"Issues and Policies in American Government","description":"Analysis of varying topics concerned with American political institutions and policies, including the United States Constitution. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Fulfills second half of legislative requirement for government. May be taken for credit only once. Offered on the letter-grade basis only. Prerequisite: Twenty-four semester hours of college coursework, including Government 310L, and a passing score on the reading section of the Texas Higher Education Assessment (THEA) test (or an appropriate assessment test).","upper":false},{"key":"GOV 312P","name":"Constitutional Principles: Core Texts","description":"Close readings from primary texts that have shaped or that reflect deeply upon American democracy, including the Declaration of Independence, The Federalist Papers, and Tocqueville's Democracy in America. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Fulfills second half of legislative requirement for government. Government 312P and 312R may not both be counted. Offered on the letter-grade basis only. Prerequisite: Twenty-four semester hours of college coursework, including Government 310L, and a passing score on the reading section of the Texas Higher Education Assessment (THEA) test.","upper":false},{"key":"GOV 314","name":"Introductory Topics in Political Science","description":"Introduction to varying topics in government and politics. Three lecture hours a week for one semester. Does not fulfill any part of the legislative requirement for government. May be repeated for credit when the topics vary.","upper":false},{"key":"GOV 320K","name":"United States Constitutional Development: Structures","description":"Primarily for prelaw students and government majors. A survey of the origin and growth of the American constitutional system, with emphasis on political structures and processes. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 320L","name":"Arab-Israeli Politics","description":"Same as Middle Eastern Studies 341 (Topic 5: Arab-Israeli Politics). In-depth study of domestic, regional, and international factors involved in politics in the Middle East, including simulation of diplomatic interaction in the Arab-Israeli conflict. Three lecture hours a week for one semester. Only one of the following may be counted: Government 320L, Middle Eastern Studies 322K (Topic 30: Arab-Israeli Politics), 323K (Topic 1: Arab-Israeli Politics), 341 (Topic 5). Prerequisite: Upper-division standing.","upper":true},{"key":"GOV 320N","name":"United States Constitutional Development: Rights","description":"Primarily for prelaw students and government majors. A survey of the origin and growth of the American constitutional system with an emphasis on the development of civil rights and civil liberties in America. Three lecture hours a week for one semester. Government 320N and 357M (Topic: American Constitutional Development II) may not both be counted. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 321","name":"American State Politics","description":"The states as subsystems of the American political system; state political cultures, social-economic environments, federalism, political participation, interest groups, parties, legislatures, executives, courts, and selected public policies. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 321M","name":"Politics in Japan","description":"Same as Asian Studies 321M. Survey of postwar Japanese politics; the occupation, governmental institutions, interest groups, protest movements, industrial policy, the government-business relationship, and political and economic reform. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 321M, 361 (Topic: Politics in Japan), Government 321M. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 322M","name":"Politics in China","description":"Same as Asian Studies 322M. Survey of twentieth-century China: historical trends; 1911 revolution; Warlord-Nationalist period; Communist revolution; post-1949 issues; new social and political institutions. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 322M, 361 (Topic: Politics in China), Government 322M. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 324J","name":"Governments and Politics of Eastern Europe","description":"Same as European Studies 348 (Topic 1: Governments and Politics of Eastern Europe) and Russian, East European, and Eurasian Studies 335 (Topic 2: Governments and Politics of Eastern Europe).  Three lecture hours a week for one semester. Only one of the following may be counted: European Studies 348 (Topic 1), Government 324J, Russian, East European, and Eurasian Studies 335 (Topic 2). Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 324L","name":"Governments and Politics of Western Europe","description":"Same as European Studies 350. Comparative study of peoples, institutions, parties, interest groups, and bureaucracy in the countries of Western Europe, concentrating on the major political systems of Britain, France, Germany, and Italy. Three lecture hours a week for one semester. European Studies 350 and Government 324L may not both be counted. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 325","name":"Political Parties","description":"Character of the American party system, organization and leadership; pressure politics; the nominating process, campaigns, suffrage, elections, and the expression of public opinion. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 327L","name":"Public Opinion and American Politics","description":"The nature of and major influences on public attitudes, the measurement of public opinion, and the role of public opinion in government. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 328L","name":"Introduction to Latin American Government and Politics","description":"Same as Latin American Studies 337M (Topic 5: Introduction to Latin American Government and Politics). An introductory survey of Latin American political systems: governmental organization, political processes, and current problems. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 330K","name":"The American President","description":"Development of the power and influence of the president; nomination, election, and responsibility; case studies of presidential problems; comparison of president and other executives. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 331L","name":"Law and Society","description":"Designed primarily for prelaw students. The role of law in the context of major social issues; legal research and oral argument. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 335M","name":"Topics in Political Thought","description":"Intensive examination of selected issues in political thought. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 335N","name":"Topics in American State Government and Politics","description":"Analysis of varying topics in the study of American state government and politics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 336M","name":"Governments and Politics of Russia","description":"Issues of nationalism and state-building facing Russia and its neighbors. Evaluation of the post-Soviet experience from the perspectives of both domestic and foreign policy. Three lecture hours a week for one semester. Government 336M and Russian, East European, and Eurasian Studies 335 (Topic 3: Governments and Politics of Russia) may not both be counted. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 337M","name":"Topics in Latin American Government and Politics","description":"In-depth analysis of the governmental process in Latin American countries, and topical treatment of political and administrative patterns across the region. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 338L","name":"East Asian International Relations","description":"Same as Asian Studies 338L. Survey of Russian/Soviet, Japanese, Chinese, and American foreign policies of the twentieth century, emphasizing Pacific-region interests; historical policies; intermittent conflicts, such as China versus Japan, Korean War, Indochina Wars; China's emergence as a nuclear power. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 338L, 361 (Topic: East Asian International Relations), Government 338L. Prerequisite: Upper-division standing and six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 339L","name":"Research Methods in Government","description":"An introduction to research design, data collection and analysis, and the use of the computer and related equipment. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 340M","name":"Readings in Government","description":"Individually guided and supervised readings and research in selected topics in government. Schedule and topic of study determined by student in consultation with instructor. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, six semester hours of lower-division coursework in government, and written consent of instructor and the undergraduate adviser.","upper":true},{"key":"GOV 341M","name":"Decision Theory","description":"An introduction to the basic concepts and models using decision theory in political science, with particular emphasis on utility analysis, game theory, coalition formation, and voting behavior. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 342N","name":"Public Choice","description":"The political-economic models that have developed in this area of social science. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 344","name":"American Foreign Relations","description":"The aims, methods, and accomplishments of United States foreign policy since World War II, by geographic areas and by special problems. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 344L","name":"Introduction to Comparative Politics","description":"Introductory survey of basic concepts, perspectives, approaches, and trends in comparative politics, with emphasis on the formal-legal, group, class, elite, political culture, structural-functional, and systems approaches. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 347K","name":"Governments and Politics of South Asia","description":"Same as Asian Studies 347K. A survey of political developments, governmental organization, and economic and social problems in South Asia. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 347L","name":"Introduction to Political Theory","description":"Study of political theory: what it is; its origins; tradition; political theory today. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 348","name":"Government and the American Economy","description":"Relationship of government to the economic system; past trends and present problems in government policy in the United States. Three lecture hours a week for one semester. Prerequisite: Economics 304L and six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 350K","name":"Statistical Analysis in Political Science","description":"Elementary statistical techniques and their applications to problems in political science. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 351C","name":"The Classical Quest for Justice","description":"Same as Core Texts and Ideas 320. Introduces students to classical political thought through a study of seminal works of antiquity, focusing on those of Plato and Aristotle. Three lecture hours a week for one semester. Only one of the following may be counted: Core Texts and Ideas 320, 335 (Topic: Classical Quest for Justice), Government 335M (Topic: Classical Quest for Justice), 351C, Western Civilization 320 (Topic: Classical Quest for Justice). Prerequisite: Completion of at least thirty semester hours of coursework.","upper":true},{"key":"GOV 351D","name":"The Theoretical Foundations of Modern Politics","description":"Same as Core Texts and Ideas 321. Examines competing foundations of the ongoing development of political and social modernity. Examines a selection of major authors from Machiavelli to Nietzsche. Three lecture hours a week for one semester. Only one of the following may be counted: Core Texts and Ideas 321, 335 (Topic: The Theoretical Foundations of Modern Politics), Government 335M (Topic: The Theoretical Foundations of Modern Politics), 351D, Western Civilization 320 (Topic: The Theoretical Foundations of Modern Politics). Prerequisite: Completion of at least thirty semester hours of coursework.","upper":true},{"key":"GOV 351E","name":"Contemporary Political Theory","description":"Introduces ongoing debates about identity, power, justice, rights, and democracy that are central to the theories of contemporary thinkers from Arendt to Habermas. Three lecture hours a week for one semester. Government 335M (Topic: Contemporary Political Theory) and 351E may not both be counted. Prerequisite: Completion of at least thirty semester hours of coursework.","upper":true},{"key":"GOV 351G","name":"Critics of Modern Liberalism","description":"Same as Core Texts and Ideas 322. Selected critics of the philosophy of the Enlightenment from both the Left and the Right, and from the time of Rousseau to the present. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Core Texts and Ideas 322, Government 335M (Topic: Liberalism and its Critics), 351G. Prerequisite: Upper-division standing.","upper":true},{"key":"GOV 351J","name":"Might and Right among Nations","description":"Same as Core Texts and Ideas 323. Major alternative approaches to the question of the moral character of international relations, as elaborated by some of the greatest political thinkers. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Core Texts and Ideas 323, 335 (Topic: Might and Right among Nations), Government 335M (Topic: Might and Right among Nations), 351J, Western Civilization 320 (Topic: Might and Right among Nations). Prerequisite: Upper-division standing and six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 351L","name":"Morality and Politics","description":"Same as Core Texts and Ideas 325. Interdisciplinary readings from major works exploring issues of ethics and leadership. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Core Texts and Ideas 325, Government 335M (Topic: Morality and Politics), 351L. Prerequisite: Upper-division standing.","upper":true},{"key":"GOV 353D","name":"Darwin and the Politics of Evolution","description":"Same as Core Texts and Ideas 372. A careful reading of Darwin's influential Origin of the Species by Means of Natural Selection, together with an examination of the religious, political, and scientific controversies the book has inspired from its first publication to the present day. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted:  Core Texts and Ideas 370 (Topic: The Politics of Evolution), 372, Government 335M (Topic: The Politics of Evolution), 353D. Prerequisite: Upper-division standing and six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 355M","name":"Topics in Political Science","description":"Emphasis on varying topics in government and politics of contemporary interest and concern. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 355P","name":"Political Sociology","description":"Same as Sociology 320K. A survey of approaches to the study of the state as a social structure; political power and power systems; ideology; political parties and elites. Three lecture hours a week for one semester. Only one of the following may be counted:  Government 355M (Topic: Political Sociology), 355P, Sociology 320K. Prerequisite: Upper-division standing.","upper":true},{"key":"GOV 357L","name":"Judicial Process and Behavior","description":"Introduction to traditional and modern approaches to the study of the judicial process, with emphasis on the nature and origin of judicial decisions and the factors that affect judicial decision making. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 357M","name":"Topics in Public Law","description":"Intensive study of various aspects of law and the legal system. Three lecture hours or two lecture hours and one discussion hour a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 358","name":"Introduction to Public Policy","description":"A survey of American public policy, with emphasis on modern problems and trends. Three lecture hours a week for one semester. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 360N","name":"Topics in International Relations","description":"Special studies stressing the theoretical aspects or the substantive policy problems of international politics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 365L","name":"Studies in Asian Politics","description":"Special studies of political behavior and institutions, problems, or developments in individual countries or in the region. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 365N","name":"Topics in Comparative Politics","description":"Analysis of varying topics in the comparative study of political processes. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"GOV 365P","name":"The Politics of Oil","description":"The national and international political complexities of petroleum; relationship of trends in petroleum economics to international political alignments. Three lecture hours a week for one semester. Government 365P and Middle Eastern Studies 322K (Topic 7: The Politics of Oil) may not both be counted. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 370K","name":"Racial and Ethnic Politics","description":"An examination of the role of racial and ethnic minorities in politics and of the impact of politics on these minorities. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 370L","name":"Topics in American Government and Politics","description":"Analysis of varying topics in the study of American government and politics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 370M","name":"Research on the United States Congress","description":"Independent research on lawmaking in the modern United States Congress. Individual instruction. Prerequisite: Six semester hours of lower-division coursework in government.","upper":true},{"key":"GOV 374N","name":"Political Internship","description":"Students perform research and related activities for an entity directly related to government and politics. Written reports required. The equivalent of three lecture hours a week for one semester. Only six semester hours of an internship course in government may be counted toward a major in government. Prerequisite: Twelve semester hours of coursework in government.","upper":true},{"key":"GOV 679H","name":"Honors Tutorial Course","description":"Lectures and supervised individual research and the writing of a substantial paper on a special topic in the field of government. No grade is awarded until the student has completed the two-semester sequence. Three lecture hours a week for two semesters. Prerequisite: For 679HA, upper-division standing, admission to the Government Honors Program, and written consent of the Government Honors Program adviser; for 679HB, Government 679HA.","upper":true},{"key":"GOV 379S","name":"Honors Seminar","description":"Substantive focus varies each semester. Topics include but are not limited to constitutional interpretation, political thought, the evolution of American politics, and comparative politics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Offered on the letter-grade basis only. Prerequisite: Completion of thirty semester hours of coursework, including at least six hours of government.","upper":true}]