[{"key":"O M 335","name":"Operations Management","description":"Restricted to students in a business major. The operations or production function and the skills required for analyzing and solving related problems. Three lecture hours a week for one semester. Operations Management 335 and 335H may not both be counted. Prerequisite: Credit or registration for Business Administration 324 or 324H and credit or registration for Statistics 309 or 309H.","upper":true},{"key":"O M 335H","name":"Operations Management: Honors","description":"Restricted to students admitted to the McCombs School of Business Honors Program. An investigation of the operations or production function, and the skills required for analyzing and solving related problems. Three lecture hours a week for one semester. Operations Management 335 and 335H may not both be counted. Prerequisite: Business Administration 324 or 324H and Statistics 309 or 309H.","upper":true},{"key":"O M 337","name":"Special Topics in Operations Management","description":"Restricted to students in a business major. Analysis of contemporary management problems. Three lecture hours or two lecture hours and one laboratory/discussion hour a week for one semester. Management 337 and Operations Management 337 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":true},{"key":"O M 353","name":"Internship in Operations Management","description":"Restricted to students in a business major. Focuses on students' career goals through academic discussion and evaluations, while placing students in professional internships with public and private enterprises. Internship and discussion hours to be arranged. Only one of the following may be counted toward the Bachelor of Business Administration: Accounting 353J, Business Administration 353, 353H, Finance 353, Management 353, Management Information Systems 353, Marketing 353, Operations Management 353. Offered on the pass/fail basis only. Prerequisite: Completion of forty-five semester hours of college coursework and consent of the departmental internship coordinator.","upper":true},{"key":"O M 366P","name":"Operations Management Practicum","description":"Restricted to students in a business major. Students apply skills in their major area and focus on additional project management skills through group projects conducted in a professional setting. Students may work with a private or a public enterprise. The equivalent of three lecture hours a week for one semester. Management 366P and Operations Management 366P may not both be counted. Offered on the letter-grade basis only. Prerequisite: Completion of at least forty-five semester hours of college coursework, and credit or registration for Operations Management 335 or 335H.","upper":true},{"key":"O M 367","name":"Strategic Supply Chain Management","description":"Restricted to students in a business major. Management of manufacturing process technology in international competition. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Operations Management 335 or 335H.","upper":true},{"key":"O M 368","name":"Logistics and Inventory Management","description":"Restricted to students in a business major. Analysis of the entire flow of information, materials, and services from suppliers through factories and warehouses to the end customer. Includes logistics, supplier selection, and inventory management, using case studies, optimization, and simulation. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: Operations Management 335 or 335H.","upper":true}]