[{"key":"LAS 301","name":"Key Ideas and Issues in Latin America","description":"Same as History 306N (Topic 3: Key Ideas and Issues in Latin America). Broad introductory course to acquaint students with the main areas of interest in Latin American studies. Three lecture hours a week for one semester.","upper":false},{"key":"LAS 310","name":"General Topics in Latin American Studies","description":"Topics that serve as an introduction to Latin America within the framework of different disciplines. Three lecture hours or two lecture hours and one discussion hour a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"LAS 315","name":"Introductory Topics in Latin American Social Sciences","description":"Three lecture hours or two lecture hours and one discussion hour a week for one semester. Latin American Studies 310 and 315 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic.","upper":false},{"key":"LAS 319","name":"Geography of Latin America","description":"Same as Geography 319. Adaptations to population growth and spatial integration in cultural landscapes of great natural and ethnic diversity; problems of frontiers and cities. Three lecture hours a week for one semester.","upper":false},{"key":"LAS 322","name":"Topics in Latin American Studies","description":"Topics vary each semester to allow curriculum flexibility for faculty members and visiting scholars. Three lecture hours a week for one semester. Additional hours are required for some topics; these topics are identified in the Course Schedule. Latin American Studies 322 and 330 may not both be counted unless the topics vary; Latin American Studies 322 and 370P may not both be counted unless the topics vary; Latin American Studies 322 and 370S may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LAS 324L","name":"Topics in Latin American Anthropology","description":"Topics vary each semester to allow curriculum flexibility for faculty members and visiting scholars. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LAS 325","name":"Topics in Latin American Sociology","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LAS 326","name":"Topics in Latin American Music","description":"Three lecture hours a week for one semester, with one laboratory hour a week if required.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LAS 327","name":"Topics in Latin American Art History","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LAS 330","name":"Topics in Latin American Geography","description":"Three lecture hours a week for one semester. Latin American Studies 322 and 330 may not both be counted unless the topics vary. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LAS 337M","name":"Topics in Latin American Politics","description":"Topics vary each semester to allow curriculum flexibility for faculty members and visiting scholars. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LAS 337N","name":"Afro-Caribbean Politics and Culture in Central America","description":"Same as African and African Diaspora Studies 326, Anthropology 324L (Topic 47),  and Women's and Gender Studies 340 (Topic 38). Exploration of black identity, political systems, and community activism in Central America and the Caribbean. Only one of the following may be counted: African and African Diaspora Studies 326, 374E (Topic: Afro-Caribbean Politics and Culture in Central America), Anthropology 324L (Topic: Afro-Caribbean Politics and Culture in Central America), 324L (Topic: 47), Government 365N (Topic: Afro-Caribbean Politics and Culture in Central America), Latin American Studies 337M (Topic: Afro-Caribbean Politics and Culture in Central America), 337N, Women's and Gender Studies 340 (Topic: Afro-Caribbean Politics and Culture in Central America), 340 (Topic 38). Prerequisite: Upper-division standing.","upper":true},{"key":"LAS 355","name":"Topics in Latin American Economics","description":"Topics vary each semester to allow curriculum flexibility for faculty members and visiting scholars. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LAS 359H","name":"Honors Seminar","description":"An interdisciplinary discussion and writing seminar. Lectures and supervised individual research and writing of a substantial paper on a special topic. Three lecture hours a week for one semester.  May be repeated for credit. Prerequisite: Upper-division standing, and consent of instructor and the Latin American studies honors adviser.","upper":true},{"key":"LAS 366","name":"Topics in Latin American History","description":"Topics vary each semester to allow curriculum flexibility for faculty members and visiting scholars. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing.","upper":true},{"key":"LAS 378","name":"Capstone Course in Latin American Studies","description":"Three lecture hours a week for one semester Prerequisite: Upper-division standing.","upper":true},{"key":"LAS 379","name":"Conference Course in Latin American Studies","description":"Supervised individual study of selected problems in Latin American studies. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing and consent of instructor and the undergraduate adviser in Latin American studies.","upper":true},{"key":"LAS 679H","name":"Honors Tutorial Course","description":"For honors candidates in Latin American studies. Individual reading of selected works for one semester, followed in the second semester by the writing of an honors thesis. Conference course for two semesters. Prerequisite: For Latin American Studies 679HA, Latin American Studies 359H, admission to the Latin American Studies Honors Program, and written consent of the Latin American Studies Honors Program adviser; for 679HB, Latin American Studies 679HA.","upper":true}]