[{"key":"RHE 306 (TCCN: ENGL 1301)","name":"Rhetoric and Writing","description":"An introductory writing course that includes instruction in practical reasoning and the principles of rhetoric. Three lecture hours a week for one semester. Only one of the following may be counted: English 603A, Rhetoric and Writing 306, 306Q, Tutorial Course 603A. Prerequisite: A passing score on the writing section of the Texas Higher Education Assessment (THEA) test (or an appropriate assessment test).","upper":false},{"key":"RHE 306Q","name":"Rhetoric and Writing for Nonnative Speakers of English","description":"Enrollment limited to nonnative speakers of English. An introductory writing course that includes instruction in practical reasoning and the principles of rhetoric, as well as grammar and mechanics of standard American English. Five lecture hours a week for one semester. Only one of the following may be counted: English 603A, Rhetoric and Writing 306, 306Q, Tutorial Course 603A. Prerequisite: Students must present their scores on the Test of English as a Foreign Language (TOEFL) to the Rhetoric and Writing Office prior to registering.","upper":false},{"key":"RHE 309S","name":"Critical Reading and Persuasive Writing","description":"A writing course designed to teach advanced rhetorical analysis and advocacy on public issues. Three lecture hours a week for one semester. Prerequisite: Rhetoric and Writing 306 or 306Q.","upper":false},{"key":"RHE 310","name":"Intermediate Expository Writing","description":"An intensive writing workshop, focusing on style and readability. Three lecture hours a week for one semester. Prerequisite: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"RHE 312","name":"Writing in Digital Environments","description":"A writing course focused on using, interpreting, and analyzing traditional and emerging technologies. Taught using networked computers. Three lecture hours a week for one semester. Prerequisite: Rhetoric and Writing 306.","upper":false},{"key":"RHE 315","name":"Introduction to Visual Rhetoric","description":"A writing course designed to teach students to analyze and produce visual and nonverbal forms of rhetoric. Three lecture hours a week for one semester. Prerequisite: Rhetoric and Writing 306.","upper":false},{"key":"RHE 317 (TCCN: ENGL 2311)","name":"Technical Writing","description":"Reading and writing in professional and technological environments. Three lecture hours a week for one semester. Prerequisite: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":false},{"key":"RHE 321","name":"Principles of Rhetoric","description":"Examines major terms, issues, and approaches in the theory and practice of rhetoric and writing. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":true},{"key":"RHE 325M","name":"Advanced Writing","description":"An advanced course designed to improve and refine writing. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":true},{"key":"RHE 328","name":"Topics in Professional and Technical Writing for Liberal Arts Majors","description":"Restricted to liberal arts majors. A professional and technical writing course exploring topics such as writing for nonprofit organizations, writing for government, and writing for industry. Designed for students in nontechnical fields. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, and one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":true},{"key":"RHE 330C","name":"Advanced Studies in Digital Rhetoric","description":"An advanced course that examines the role of information technologies in communication. Taught using networked computers. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":true},{"key":"RHE 330D","name":"History of Rhetoric","description":"An advanced survey of figures and movements in the history of rhetoric, from classical to contemporary. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":true},{"key":"RHE 330E","name":"Rhetorical Theory and Analysis","description":"An advanced examination of rhetorical theories and their applications. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":true},{"key":"RHE 360M","name":"Rhetoric and Writing for Teachers of English","description":"Designed for students seeking a secondary school teaching certificate or those in the UTeach-Liberal Arts program. An advanced course that examines theories of writing and writing pedagogy. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":true},{"key":"RHE 366","name":"Internship in Rhetoric and Writing","description":"Research and staff experience working in an appropriate nonprofit, public-, or private-sector entity. Ten to twelve hours a week for one semester. May be repeated once for credit when the internships vary. Offered on the pass/fail basis only. Prerequisite: Upper-division standing, twelve semester hours of coursework in rhetoric and writing, and consent of instructor.","upper":true},{"key":"RHE 367R","name":"Conference Course in Rhetoric and Writing","description":"Supervised work on specific projects in rhetoric and writing. Three conference hours a week for one semester.  May be repeated for credit. Prerequisite: Upper-division standing; one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A; and approval of written application by the supervising instructor.","upper":true},{"key":"RHE 368C","name":"Writing Center Internship","description":"Intensive reading, writing, and discussion in writing center theory and philosophy, tutoring methods, and writing pedagogy, as well as a review of standard American English usage and mechanics; followed by a supervised apprenticeship as a peer consultant in the Undergraduate Writing Center. Two lecture hours and two apprenticeship hours a week for one semester. Prerequisite: Upper-division standing; one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A; and approval of written application by instructor.","upper":true},{"key":"RHE 368E","name":"Editing for Publication","description":"Advanced instruction in revising and editing for publication. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":true},{"key":"RHE 375","name":"Capstone Seminars in Rhetoric","description":"Allows the student to integrate the knowledge gained in rhetoric and writing through a major independent project. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing, and Rhetoric and Writing 321, 330C, 330D, and 330E.","upper":true},{"key":"RHE 379C","name":"Advanced Topics in Rhetoric and Writing","description":"An advanced course focused on specific theories or practices of rhetoric and writing. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing and one of the following: English 603A, Rhetoric and Writing 306, 306Q, or Tutorial Course 603A.","upper":true},{"key":"RHE 679H","name":"Honors Tutorial Course","description":"Research and development of a thesis/project topic and proposal followed by the writing and defense of an honors thesis or development and defense of an honors project. The equivalent of three lectures hours a week for two semesters. Prerequisite: For 679HA, upper-division standing, completion of at least six hours of upper-division rhetoric and writing courses, admission to the Rhetoric and Writing Honors Program, and consent of the honors adviser; for 679HB, credit for 679HA.","upper":true}]