[{"key":"ASL 601C","name":"Accelerated First-Year American Sign Language","description":"Introduction to American Sign Language and its vocabulary and sentence structure. A six-hour course comparable to American Sign Language 506 and 507. Six lecture hours a week for one semester. Only one of the following may be counted: American Sign Language 601C, 601D, 506. American Sign Language 601C and 507 may not both be counted. Offered on the letter-grade basis only.","upper":false},{"key":"ASL 601D","name":"American Sign Language I: Beginning","description":"This course focuses on the development of beginner-level comprehension and production skills in American Sign Language.  Students learn how to attend to visual language and use their hands and body for producing ASL constructions.  Elementary vocabulary and grammar is covered, along with information about Deaf culture. Six lecture hours a week for one semester. Only one of the following may be counted: American Sign Language 601C, 601D, 506.  American Sign Language 601D and 507 may not both be counted. Offered on the letter-grade basis only.","upper":false},{"key":"ASL 506 (TCCN: SGNL 1501)","name":"First-Year American Sign Language I","description":"Introduction to American Sign Language. Five lecture hours a week for one semester. Only one of the following may be counted: American Sign Language 601C, 601D, 506. Offered on the letter-grade basis only.","upper":false},{"key":"ASL 507 (TCCN: SGNL 1502)","name":"First-Year American Sign Language II","description":"American Sign Language vocabulary and basic sentence structure. Five lecture hours a week for one semester. Only one of the following may be counted: American Sign Language 601C, 601D, 507. Offered on the letter-grade basis only. Prerequisite: American Sign Language 506 with a grade of at least C.","upper":false},{"key":"ASL 610D","name":"American Sign Language II: Beginning","description":"Focuses on the development of intermediate-level proficiency in ASL. An introduction to more complex grammatical constructions with the goal of engaging in conversations in ASL on a variety of topics.  Examines the historical aspects of the Deaf community and related themes. Six lecture hours a week for one semester. Only one of the following may be counted: American Sign Language 610D, 611C, 312K. American Sign Language 507 and 610D may not both be counted. Offered on the letter-grade basis only. Prerequisite: American Sign Language 601D or 507 with a grade of at least C.","upper":false},{"key":"ASL 611C","name":"Accelerated Second-Year American Sign Language","description":"Focuses on developing conversational skills in American Sign Language and introduces American Sign Language literature and folklore. Six lecture hours a week for one semester. Only one of the following may be counted: American Sign Language 611C, 311D, 312K. American Sign Language 611C and 312L may not both be counted. Offered on the letter-grade basis only. Prerequisite: American Sign Language 601C, 507, or 610D with a grade of at least C.","upper":false},{"key":"ASL 311D","name":"American Sign Language III: Intermediate","description":"Focuses on maintaining and building upon a student's intermediate ASL skills.  Grammar coverage includes complex constructions that involve the signing space, and vocabulary building includes comparisons between English words and ASL signs in order for the learner to make appropriate vocabulary choices in their ASL production.  Complex questions facing the contemporary Deaf community are discussed. Three lecture hours a week for one semester. American Sign Language 311D and 312L may not both be counted. American Sign Language 611C and 311D may not both be counted. Offered on the letter-grade basis only. Prerequisite: American Sign Language 601C, 610D, or 312K with a grade of at least C.","upper":false},{"key":"ASL 312K (TCCN: SGNL 2301)","name":"Second-Year American Sign Language I","description":"Development of conversational skills in American Sign Language. Three lecture hours a week for one semester. American Sign Language 611C and 312K may not both be counted. American Sign Language 610D and 312K may not both be counted. Offered on the letter-grade basis only. Prerequisite: American Sign Language 601C or 507 with a grade of at least C.","upper":false},{"key":"ASL 312L (TCCN: SGNL 2302)","name":"Second-Year American Sign Language II","description":"Further development of conversational skills in American Sign Language; introduction to American Sign Language literature and folklore. Three lecture hours a week for one semester. American Sign Language 611C and 312L may not both be counted. American Sign Language 311D and 312L may not both be counted Offered on the letter-grade basis only. Prerequisite: American Sign Language 312K with a grade of at least C.","upper":false},{"key":"ASL 320","name":"Advanced American Sign Language Conversation","description":"Advanced development of conversational skills in American Sign Language, with a focus on sophisticated linguistic structures and important issues in deaf studies. Three lecture hours a week for one semester.  Offered on the letter-grade basis only. Prerequisite: American Sign Language 611C or 312L with a grade of at least C-.","upper":true},{"key":"ASL 326","name":"Sign Languages and Signing Communities","description":"Same as Linguistics 350 (Topic 3: Sign Languages and Signing Communities). Examines the grammar of signed languages, their use in signing communities, and the acquisition of signed languages as first languages. No knowledge of American Sign Language is required. Three lecture hours a week for one semester. May not be counted toward fulfillment of the foreign language requirement for any bachelor's degree. Prerequisite: Upper-division standing.","upper":true},{"key":"ASL 336","name":"Introduction to Sign Interpreting","description":"Introduction to sign interpreting from American Sign Language into English and from English into American Sign Language. Topics include the ethics of interpreting and the problems that arise in interpreting in different social and professional situations. Three lecture hours a week for one semester. Prerequisite: American Sign Language 611C, or credit or registration for American Sign Language 312L.","upper":true},{"key":"ASL 357","name":"Undergraduate Research","description":"Supervised research experience. Individual instruction.  May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Upper-division standing and American Sign Language 506 with a grade of at least C-.","upper":true}]