[{"key":"LIN 306","name":"Introduction to the Study of Language","description":"Survey of major areas of linguistics: sound systems, grammatical structures, historical development of languages, language families and linguistic universals, dialect differences and their social significance. Three lecture hours a week for one semester.","upper":false},{"key":"LIN 312","name":"Interdisciplinary Approaches to Language","description":"An interdisciplinary and multidisciplinary introduction to the manifold aspects of language. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary.","upper":false},{"key":"LIN 312C","name":"Culture and Communication","description":"Same as Anthropology 307. An introduction to the study of culture through communication and the theory of signs. Three lecture hours or two lecture hours and one discussion hour a week for one semester. Only one of the following may be counted: Anthropology 307, Linguistics 312 (Topic: Culture and Communication), 312C.","upper":false},{"key":"LIN 312D","name":"Languages around the World","description":"Explores the language families of the world. Considers such questions as: what does it mean for languages to be related, and how do we know that they are related in the first place; why are there only a handful of language families in Europe and Africa while there are scores in South America and New Guinea; What can we say about where a language or language family may have originated; and how much living history is being lost as languages become endangered or extinct when people stop speaking them? Three lecture hours a week for one semester. Linguistics 312 (Topic: Languages Around the World) and 312D may not both be counted.","upper":false},{"key":"LIN 312E","name":"Language of Sign and Gesture","description":"Explores how language, a faculty that arises in the brain, is expressed by the body, both for spoken languages (via the vocal tract) and for signed languages (via the hands and face). Also includes an examination of how language, a special cognitive faculty unique to humans, intersects and overlaps with other communication systems, with a focus on gesture, the nonlinguistic communicative systems used by humans and some nonhuman species.  Three lecture hours a week for one semester. Linguistics 312 (Topic: Language in the Body) and 312E may not both be counted.","upper":false},{"key":"LIN 313","name":"Language and Computers","description":"Natural language processing, including spam filtering, dialogue systems, spelling and grammar correction, forensic linguistics, cryptography, and machine translation. Studies how these systems function, the difficulties in implementing them, and implications of such technologies for society. Three lecture hours a week for one semester. Linguistics 312 (Topic: Language and Computers) and 313 may not both be counted.","upper":false},{"key":"LIN 321L","name":"American English","description":"Same as English 321L. An overview of the historical development of English in the Americas. Attention to regional, social, and ethnic differences, and their implications for public education. Three lecture hours a week for one semester. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"LIN 322","name":"Gypsy Language and Culture","description":"Linguistic introduction to Romani; relationship to languages of India; history from 280 BC; modern dialects and international standard language; history and culture as reflected in the language. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 372 (Topic 13: Gypsy Language and Culture); Linguistics 322; Russian, East European, and Eurasian Studies 325 (Topic 1: Gypsy Language and Culture).","upper":true},{"key":"LIN 323L","name":"English as a World Language","description":"Same as English 323L. An account of the spread of English around the world; national, social, and regional varieties. Three lecture hours a week for one semester. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"LIN 344K","name":"Phonetics: The Production and Perception of Speech Sounds","description":"Articulation and transcription of speech sounds; distinctive feature systems; physiological and acoustical aspects of phonetics; common phonological processes. Three lecture hours a week for one semester.","upper":true},{"key":"LIN 345","name":"Language Change and Language Variation","description":"Three lecture hours a week for one semester. Prerequisite: Linguistics 344K.","upper":true},{"key":"LIN 350","name":"Special Topics in the Study of Language","description":"Nontechnical examination of social, educational, and political problems to which current linguistic knowledge is relevant. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LIN 353C","name":"Introduction to Computational Linguistics","description":"Introduction to key representations and algorithms used in computational linguistics and the main natural language processing applications. Three lecture hours a week for one semester. Linguistics 350 (Topic: Introduction to Computational Linguistics) and 353C may not both be counted.","upper":true},{"key":"LIN 353N","name":"Natural Language Processing","description":"Introduces theoretical and applied topics relating to natural language processing, including machine translation, search, automatic summarization, and dialog systems. Three lecture hours a week for one semester. Only one of the following may be counted: Computer Science 378 (Topic: Natural Language Processing), Linguistics 350 (Topic: Natural Language Processing), 353N.","upper":true},{"key":"LIN 357","name":"Undergraduate Research","description":"Supervised research experience. Individual instruction.  May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Upper-division standing and Linguistics 306 with a grade of at least C-.","upper":true},{"key":"LIN 358Q","name":"Supervised Research","description":"Supervised student-initiated research. Individual instruction.  May be repeated for credit. Offered on the pass/fail basis only. Prerequisite: Upper-division standing and Linguistics 306 with a grade of at least C-.","upper":true},{"key":"LIN 358S","name":"Fundamentals of Speech Science","description":"Same as Communication Sciences and Disorders 358S. Neurophysiological mechanisms underlying the encoding and decoding of speech. Three lecture hours a week for one semester. Only one of the following may be counted: Communication Sciences and Disorders 358S, 396N, Linguistics 358S. Prerequisite: Upper-division standing and a University grade point average of at least 2.25; for Communication Sciences and Disorders majors, Communication Sciences and Disorders 313L and 358 with a grade of at least C in each.","upper":true},{"key":"LIN 360K","name":"Introduction to English Grammar","description":"Introduction to the study of the syntactic structure of modern English from the viewpoint of generative grammar. Three lecture hours a week for one semester. English 360K and Linguistics 360K may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"LIN 364M","name":"History of the English Language","description":"Same as English 364M. Development of sounds, forms, and vocabulary of the English language from its origins to the present. Three lecture hours a week for one semester. Prerequisite: Nine semester hours of coursework in English or rhetoric and writing.","upper":true},{"key":"LIN 372K","name":"Sound Patterns: From Sound to Word","description":"Methods and principles of analyzing the sound systems of languages. Three lecture hours a week for one semester. Prerequisite: Linguistics 344K.","upper":true},{"key":"LIN 372L","name":"Syntax and Semantics: The Structure and Meaning of Utterances","description":"Methods and principles of describing the syntactic systems of languages. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and Linguistics 306.","upper":true},{"key":"LIN 373","name":"Topics in Linguistics and Related Disciplines","description":"Introduction to the study of the areas of linguistics that involve other disciplines, such as sociolinguistics, psycholinguistics, mathematical methods in linguistics. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"LIN 374M","name":"Sociolinguistics","description":"Same as Anthropology 374M. An in-depth treatment of current interests in sociolinguistic research literature. Subjects include language and gender; social, regional, and ethnic dialects of American English; language use in African American communities; language and identity in a pluralistic society; and language, literacy, and education. Three lecture hours a week for one semester. Prerequisite: Anthropology 302 or Linguistics 306.","upper":true},{"key":"LIN 379","name":"Conference Course in Linguistics","description":"Supervised individual study of selected problems in linguistics. Conference course.  May be repeated for credit. Prerequisite: Six semester hours of upper-division coursework in linguistics.","upper":true},{"key":"LIN 679H","name":"Honors Tutorial Course","description":"Supervised individual reading for one semester, followed by research and writing to produce a substantial paper. Conference course for two semesters.  May be repeated for credit. Prerequisite: For 679HA, admission to the Linguistics Honors Program; for 679HB, Linguistics 679HA.","upper":true}]