[{"key":"M S 000","name":"Leadership Laboratory","description":"Open only to students in associated military science courses. Leadership responsibilities for planning, coordination, execution, and evaluation of training and other activities. Self-confidence and team-building leadership skills that can be applied throughout life. One and one-half laboratory hours a week for one semester. Required of all military science students. Prerequisite: Concurrent enrollment in another military science course.","upper":false},{"key":"M S 101","name":"Basic Military Science I-A","description":"Designed to increase self-confidence through team study and activities in basic drill, physical fitness, rappelling, leadership reaction course, first aid, making presentations, and basic marksmanship. Fundamental concepts of leadership in a profession. One one-hour lecture/practice session a week for one semester. Prerequisite: Concurrent enrollment in Military Science 000.","upper":false},{"key":"M S 103","name":"Basic Military Science I-B","description":"Principles of effective leading. Designed to reinforce self-confidence through participation in physically and mentally challenging exercises with upper-division ROTC students. Communication skills that improve individual performance and group interaction. Relationship of organizational ethical values to the effectiveness of a leader. One one-hour lecture/practice session a week for one semester. Prerequisite: Concurrent enrollment in Military Science 000.","upper":false},{"key":"M S 210","name":"Basic Military Science II-A","description":"Ethics-based leadership skills designed to develop individual abilities and contribute to effective team-building. Focus on oral presentations, writing concisely, planning of events, coordination of group efforts, advanced first aid, land navigation, and basic military tactics. Fundamentals of ROTC's Leadership Assessment Program. Two lecture/practice hours a week for one semester, and a weekend field training exercise. Prerequisite: Concurrent enrollment in Military Science 000.","upper":false},{"key":"M S 212","name":"Basic Military Science II-B","description":"Introduction to individual and team aspects of military tactics in small-unit operations. Includes use of radio communications, making safety assessments, movement techniques, planning for team safety/security, and methods of pre-execution checks. Practical exercises with upper-division ROTC students. Techniques for training others as an aspect of continued leadership development. Two lecture/practice hours a week for one semester, and a weekend field training exercise. Prerequisite: Concurrent enrollment in Military Science 000.","upper":false},{"key":"M S 320","name":"Advanced Military Science III-A","description":"Series of practical opportunities to lead small groups, receive personal assessments and encouragement, and lead again in situations of increasing complexity. Use of small-unit defensive tactics and opportunities to plan and conduct training for lower-division students. Three lecture hours a week for one semester. Prerequisite: Concurrent enrollment in Military Science 000 and approval of departmental representative.","upper":true},{"key":"M S 320K","name":"Advanced Military Science III-B","description":"Continued study of methods covered in Military Science 320. Students analyze tasks; prepare written or oral guidance for team members to accomplish tasks; delegate tasks and supervise; plan for and adapt to the unexpected in organizations under stress; examine and apply lessons from leadership case studies; examine the importance of ethical decision making in enhancing team performance. Three lecture/practice hours a week for one semester. Prerequisite: Concurrent enrollment in Military Science 000 and approval of departmental representative.","upper":true},{"key":"M S 375","name":"Leadership and Ethics (IV-A)","description":"Military leadership and professional ethics; post and installation support system; introduction to the military justice system. Three lecture hours a week for one semester. Prerequisite: Concurrent enrollment in Military Science 000 and approval of departmental representative.","upper":true},{"key":"M S 375K","name":"Transition to Lieutenant (IV-B)","description":"Fundamentals of the military justice system; training and logistical management systems; military social functions; role of the second lieutenant. Three lecture hours a week for one semester. Prerequisite: Concurrent enrollment in Military Science 000 and approval of departmental representative.","upper":true},{"key":"M S 379","name":"Advanced Military Science V-A","description":"Advanced study and research on historic and contemporary military subjects and events. Three lecture hours a week for one semester. Prerequisite: Concurrent enrollment in Military Science 000.","upper":true},{"key":"M S 379K","name":"Advanced Military Science V-B","description":"Advanced study and research on historic and contemporary military subjects and events. Three lecture hours a week for one semester. Prerequisite: Concurrent enrollment in Military Science 000.","upper":true}]