[{"key":"T C 302","name":"First-Year Signature Course: Plan II","description":"Restricted to first-year Plan II students. Small-group seminar involving reading, discussion, writing, and oral reporting around a central interdisciplinary topic. Designed to introduce undergraduates to scholarly analysis from an interdisciplinary perspective. Includes an introduction to University resources, such as research facilities, museums, and attendance at University lectures or performances as assigned. Multiple sections may be offered in the fall and spring with various topics and instructors. Three lecture hours a week for one semester. Some sections may require additional meeting times; these are identified in the Course Schedule. Only one of the following may be counted: Tutorial Course 302, Undergraduate Studies 302, 303.","upper":false},{"key":"T C 603","name":"Composition and Reading in World Literature","description":"Reading of masterpieces of world literature and intensive training in writing and in critical analysis of literature. Three lecture hours a week for two semesters. Only one of the following may be counted: English 603A, Rhetoric and Writing 306, 306Q, Tutorial Course 603A; only one of the following may be counted: Comparative Literature 315, English 603B, Tutorial Course 603B. Prerequisite: For 603A, admission to the Plan II Honors Program; for 603B, Tutorial Course 603A.","upper":false},{"key":"T C 310","name":"Modes of Reasoning","description":"Introduction to forms of quantitative reasoning: computer science, game theory, operations research, or statistics and probability. Three lecture hours a week for one semester. Philosophy 313Q and Tutorial Course 310 may not both be counted. Prerequisite: Admission to the Plan II Honors Program.","upper":false},{"key":"T C 325","name":"Topics in the Arts and Sciences","description":"Analysis of various topics within the arts and sciences through reading, research, written reports, and discussion. Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Upper-division standing in the Plan II Honors Program or consent of instructor; additional prerequisites vary with the topic.","upper":true},{"key":"T C 125K","name":"Topics in the Arts and Sciences","description":"Analysis of topics in the arts, sciences, and social sciences through reading, discussion, and lectures. The equivalent of one lecture hour a week for one semester. Some topics are offered on the pass/fail basis only; these are identified in the Course Schedule. May be repeated for credit. Prerequisite: Upper-division standing in the Plan II Honors Program or consent of instructor.","upper":true},{"key":"T C 126","name":"Plan II/Knowledge Is Power Program Charter Schools Partnership","description":"Restricted to students in the Plan II Honors Program. Mentorship of younger students attending an Austin-area Knowledge Is Power Program (KIPP) school. Through mentoring and class meetings, students will be deeply immersed in issues related to education reform, (in)equality of educational opportunity, and in promising strategies, such as those used by KIPP, for addressing such issues. The equivalent of one lecture hour and two hours of service a week for one semester.  May be repeated for credit. Offered on the letter-grade basis only. Prerequisite: Consent of instructor.","upper":true},{"key":"T C 330","name":"Special Topics in Plan II","description":"Restricted to Plan II majors.  Three lecture hours a week for one semester, with additional hours to be arranged.  May be repeated for credit when the topics vary. Prerequisite: Consent of instructor.","upper":true},{"key":"T C 357","name":"The Junior Seminar","description":"Seminar sections of about fifteen students. The subjects vary, but in each the attempt is made through careful reading, discussion, and written work to analyze and compare varied approaches to topics of lasting importance. Three lecture hours a week for one semester. Students must take this course twice with different topics to fulfill degree requirements; with consent of the director of Plan II, a third topic may be taken as an elective. Prerequisite: Upper-division standing in Plan II.","upper":true},{"key":"T C 359T","name":"Essay Course","description":"Directed reading followed by the writing of an essay. Conference course, with additional hours to be arranged. Prerequisite: Two semesters of Tutorial Course 357 and consent of the director.","upper":true},{"key":"T C 660H","name":"Thesis Course: Honors","description":"Directed reading followed by the writing of a substantial essay. Conference course for two semesters, with additional hours to be arranged. Prerequisite: For 660HA, two semesters of Tutorial Course 357 and consent of the director; for 660HB, Tutorial Course 660HA.","upper":true}]