[{"key":"SOC 302 (TCCN: SOCI 1301)","name":"Introduction to the Study of Society","description":"The nature of human societies, social processes, social interaction, and the sociological approach. Three lecture hours or two lecture hours and one discussion hour a week for one semester.","upper":false},{"key":"SOC 307C","name":"American Families Past and Present","description":"Examines trends over time in specific aspects of family life, including marriage, cohabitation, mate selection, divorce, parenthood, family structure, and work-family balance. Study of the methods that sociologists and demographers use to study the family. Three lecture hours a week for one semester. Sociology 307C and 308 (Topic: American Families Past and Present) may not both be counted.","upper":false},{"key":"SOC 307D","name":"Capital Punishment in America","description":"Uses various historical, legal and social perspectives to examine the shifting rationales and nature of contemporary United States death penalty debates: public opinion; racial disparities and the historical legacy of lynching; United States Supreme Court decisions; the death penalty's efficacy as a criminal punishment, its personal impacts, and contemporary problems with its current application. Three lecture hours a week for one semester. Sociology 307D and 308 (Topic: Capital Punishment in America) may not both be counted.","upper":false},{"key":"SOC 307E","name":"Contemporary United States Social Problems","description":"Examines contemporary social issues confronting the United States, using sociological concepts and perspectives to analyze the nation's most pressing social problems, ranging from social inequality to crime, terrorism and war, and environmental degradation. Three lecture hours a week for one semester. Sociology 307E and 308 (Topic: Contemporary United States Social Problems) may not both be counted.","upper":false},{"key":"SOC 307F","name":"Diversity in American Families","description":"Same as Women's and Gender Studies 301 (Topic 19). Examination of the diversity of American families and current debates on family life from a sociological perspective with an emphasis on how diverse family forms came to exist and what these changes mean for adults and children in contemporary society. Study of recent trends in several aspects of family life, including dating and courtship, cohabitation, marriage, divorce, parenthood, family structure, and work-family balance. Overview of theoretical perspectives on family life with a focus on gender, race/ethnicity, and sexuality. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 315 (Topic: Diversity in American Families), Sociology 307F, 308 (Topic: Diversity in American Families), Women's and Gender Studies 301 (Topic: Diversity in American Families), 301 (Topic 19).","upper":false},{"key":"SOC 307G","name":"Culture and Society in the United States","description":"Introduction to theoretical perspectives, methodological issues, and empirical work in the sociological study of culture. Examination of sociological accounts of the production, reproduction, and reception of culture, with an emphasis on a critical understanding of culture in relation to other sociological phenomena such as power, inequality, and identities. Three lecture hours a week for one semester. Sociology 307G and 308 (Topic: Culture and Society in the United States) may not both be counted.","upper":false},{"key":"SOC 307J","name":"Education and Society","description":"Further study of the ways that schooling shapes the opportunities available to children and youth, and how educational attainment influences the lives and well-being of adults. Subjects include historical development and organization of the American educational system; factors that shape achievement and learning; differential access to educational opportunities along race, class, and gender lines; and the effects of educational stratification. Three lecture hours a week for one semester. Sociology 307J and 308 (Topic: Education and Society) may not both be counted.","upper":false},{"key":"SOC 307K","name":"Fertility and Reproduction","description":"Same as Women's and Gender Studies 301 (Topic 20). Explores the when, why, how, and with whom Americans bear children, and how the United States compares to other developed and developing countries in the world. Subjects include infertility and its treatments, the ethics of surrogacy and international adoption, voluntary childlessness, the rapid rise of nonmarital childbearing in the United States and other countries, the politics of childbirth, the risks of maternal  morbidity and mortality in developed and developing countries, and the declining populations and rapid aging of rich countries including Japan, Italy, and Spain where many women have stopped having children. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 307K, 308 (Topic: Fertility and Reproduction), Women's and Gender Studies 301 (Topic: Fertility and Reproduction), 301 (Topic 20).","upper":false},{"key":"SOC 307M","name":"Global Inequalities and Health","description":"Overview of the global link between health and inequality, paying particular attention to development and health care delivery systems around the world. Examination of the effect of social inequalities and economic development on health and health care systems. Three lecture hours a week for one semester. Sociology 307M and 308 (Topic: Global Inequalities and Health) may not both be counted.","upper":false},{"key":"SOC 307N","name":"Introduction to the Sociology of Development","description":"Introduction to major concepts and theories in the sociology of development, with a focus on problems of inequality in wealth and well-being from a global, comparative, and historical perspective. Three lecture hours a week for one semester. Sociology 307N and 308 (Topic: Introduction to the Sociology of Development) may not both be counted.","upper":false},{"key":"SOC 307P","name":"Introduction to the Sociology of Health and Well-Being","description":"Examination of the social causes and context of illness, death, longevity, and health care today in the United States. Subjects include historical perspectives on health and mortality, social class, race/ethnicity, gender, religious involvement, marital status, family, age, and psychosocial factors. Emphasis on the tension between individualistic and public health perspectives on illness. Three lecture hours a week for one semester. Sociology 307P and 308 (Topic: Introduction to the Sociology of Health and Well-Being) may not both be counted.","upper":false},{"key":"SOC 307S","name":"Judaism and Christianity in Sociological Perspective","description":"Study of Christianity's historic roots in Judaism, the texts that Jews and Christians share, what Jews believe, how and why the two faiths diverged and evolved, how institutionalized Christianity addresses its Jewish origins, and the relationship between Jews and Christians throughout history. Focus on the social, historical, and intellectual contexts and forces which have shaped these processes up to the present day, as well as religious evolution of how systems and ways of thought and action change, why, and how Christians and Jews have dealt with such changes. Three lecture hours a week for one semester. Only one of the following may be counted: Core Texts and Ideas 304 (Topic: Judaism and Christianity in Sociological Perspective), Sociology 307S, 308 (Topic: Judaism and Christianity in Sociological Perspective), Western Civilization 303 (Topic: Judaism and Christianity in Sociological Perspective).","upper":false},{"key":"SOC 307T","name":"Punishment and Society","description":"Focus on society's responses to crime. Introduction to the sociology of punishment and the death penalty, the American model of criminal punishment, and contextualization of the United States system and critical analysis of penal systems in general. Special emphasis on the nature of penal control in contemporary America. Three lecture hours a week for one semester. Sociology 307T and 308 (Topic: Punishment and Society) may not both be counted.","upper":false},{"key":"SOC 308 (TCCN: SOCI 1306)","name":"Topics in Introductory Sociology","description":"A review of contemporary social topics from a sociological perspective, with the instructor selecting one topic for emphasis. Three lecture hours a week for one semester. Sociology 308 (Topic: Ethnicity and Gender: La Chicana) and 308D may not both be counted. May be repeated for credit when the topics vary.","upper":false},{"key":"SOC 308D","name":"Ethnicity and Gender: La Chicana","description":"Same as Mexican American Studies 319 (Topic 1: Ethnicity and Gender: La Chicana) and Women's and Gender Studies 301 (Topic 6: Ethnicity and Gender: La Chicana).  Three lecture hours a week for one semester.","upper":false},{"key":"SOC 308F","name":"Religion and Gender in America","description":"Same as Women's and Gender Studies 301 (Topic 18). Examines the complex relationship between religious involvement and gender and sexuality in American society with a focus on the historic relationship between religious engagement and women's movements as well as more contemporary issues. Exploration of several major religious traditions in the United States today, including Evangelical Christianity, Catholicism, and Judaism. Examination of smaller religious groups and their attempt to confront the complex and contradictory relationship between gender roles and belief. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 308 (Topic: Religion and Gender in America), 308F, Women's and Gender Studies 301 (Topic 18).","upper":false},{"key":"SOC 308G","name":"The Rich and the Poor in America: Sociological Perspective","description":"Review of classical and contemporary theories of inequality and stratification; examination of recent ethnographic accounts of experiences of the rich and poor in United States society. Development of critical thinking about social class in contemporary society, and study of how one's own experiences are both the products and producers of larger stratification systems. Three lecture hours a week for one semester. Sociology 308 (Topic: Rich and Poor in America) and 308G may not both be counted.","upper":false},{"key":"SOC 308J","name":"Romantic Relationships and Family Formation","description":"Same as Women's and Gender Studies 301 (Topic 23). Examination of romantic relationships and family formation from a cultural framework. Subjects include: historical transformations of romance; socioeconomic perspectives on sexual relationships and family formation; the impact of demographic transitions on the emergence of cohabitation as a relationship form; the economics undergirding relationship decision making; common narratives, practices, and gender differences about entry into marriage in the West; and population-level implications of contemporary patterns. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 308 (Topic: Romantic Relationships and Family Formation), 308J, Women's and Gender Studies 301 (Topic 23).","upper":false},{"key":"SOC 308K","name":"Social Change and the Future","description":"Study of the effects of conflict on society, culture, technology, and economy practices through comparative analysis and historical dimension with a focus on institutions responsible for managing and handling conflict such as warfare and the military. Conflict-related issues include social institutions, gender identities and roles, economy, health issues, technological changes, collective memory, and culture. Three lecture hours a week for one semester. Sociology 308 (Topic: Social Change and the Future) and 308K may not both be counted.","upper":false},{"key":"SOC 308L","name":"Social Transformation of Love and Relationships","description":"Same as Middle Eastern Studies 310 (Topic 4). Examination of the social, psychological, and spiritual perspectives toward the ideas of love and intimacy; how love and intimacy interact with rapid social, economic, and cultural change; and how the subsequent change transformed the social world and the meaning of love. Subjects include the aspects of self and identity; differentiation in the context of love in the modern age; the family and the individual; the impact of industrialization on private lives and the public order; gender, communication, love; intercultural love and intimacy; and personal choice and arranged marriages. Three lecture hours a week for one semester. Only one of the following may be counted: Middle Eastern Studies 310 (Topic: Social Transformation of Love and Relationships), 310 (Topic 4), Sociology 308 (Topic: Social Transformation of Love and Relationships), 308L.","upper":false},{"key":"SOC 308M","name":"Sociology of Identity","description":"Examination of the ways that identities are socially produced and the study of how that social construction results in power and privilege for some groups at the expense of others. Three lecture hours a week for one semester. Sociology 308 (Topic: Sociology of Identity) and 308M may not both be counted.","upper":false},{"key":"SOC 308S","name":"Introduction to Health and Society","description":"Same as Health and Society 301. A broad, multidisciplinary overview that introduces students to the study of health and society. Three lecture hours a week for one semester. Only one of the following may be counted: Health and Society 301, Sociology 308 (Topic: Introduction to Health and Society), 308S.","upper":false},{"key":"SOC 309","name":"Chicanos in American Society","description":"Same as Mexican American Studies 310. Introduction to the study of American character and its bearing on the Chicano experience. Three lecture hours a week for one semester.","upper":false},{"key":"SOC 310S","name":"Women's Reproductive Health for Nonscience Majors","description":"Same as Nursing 307 (Topic 1) and Women's and Gender Studies 301 (Topic 7). Overview of contemporary women's reproductive health issues, with emphasis on historical, physiological, psychosocial, and cultural influences that affect the reproductive health of women during adolescence, the childbearing years, and midlife. Three lecture hours a week for one semester. Only one of the following may be counted: Nursing 307 (Topic 1), Sociology 308 (Topic 2), 310S, Women's and Gender Studies 301 (Topic 7). Prerequisite: One year of high school biology, or Biology 301L or 309D.","upper":false},{"key":"SOC 313K","name":"Introduction to the Sociology of Religion","description":"Introduction to sociological methods in the study of religion. Three lecture hours a week for one semester. Only one of the following may be counted: Asian Studies 301M (Topic 5: Introduction to the Study of Religion), Religious Studies 310, Sociology 313K.","upper":false},{"key":"SOC 317L","name":"Introduction to Social Statistics","description":"Restricted to sociology majors. Measures of central tendency and dispersion, the binomial and chi-square distributions, tests of hypotheses and parameter estimation, and simple correlation and regression. Three lecture hours and one laboratory hour a week for one semester. Required of all sociology majors.","upper":false},{"key":"SOC 317M","name":"Introduction to Social Research","description":"Students may not enroll in Sociology 317M more than twice. To enroll for the second time, students must receive consent of the undergraduate adviser. The logic of scientific research, general methods of data collection and analysis, and computer applications. Two lecture hours and two laboratory hours a week for one semester. Required of all sociology majors. Prerequisite: One of the following courses with a grade of at least C: Mathematics 316, Statistics and Scientific Computation 303, 304, 305, or 306; or Sociology 317L.","upper":false},{"key":"SOC 318 (TCCN: SOCI 2339)","name":"Juvenile Delinquency","description":"Environments in which juvenile delinquency develops; delinquent subcultures and peer groups; societal reactions in schools, courts, and other agencies. Three lecture hours a week for one semester.","upper":false},{"key":"SOC 319","name":"Introduction to Social Demography","description":"Social consequences of changes in fertility, mortality, migration, population growth and composition. Three lecture hours a week for one semester.","upper":false},{"key":"SOC 320K","name":"Political Sociology","description":"Same as Government 355P. A survey of approaches to the study of the state as a social structure; political power and power systems; ideology; political parties and elites. Three lecture hours a week for one semester. Only one of the following may be counted:  Government 355M (Topic: Political Sociology), 355P, Sociology 320K. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321C","name":"Consumption in Latin America","description":"Same as Latin American Studies 325 (Topic 5). Study of the role consumption plays in social, economic, and political relations in Latin America, as well as contesting ideas about this role. Three lecture hours a week for one semester. Only one of the following may be counted: Latin American Studies 325 (Topic: Consumption in Latin America), Latin American Studies 325 (Topic 5), Sociology 321C, Sociology 321K (Topic: Consumption in Latin America). Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321D","name":"Demography of Crime and Punishment","description":"Intensive seminar exploring data sources and conceptual and measurement issues surrounding the study of racial and ethnic differences in crime and punishment, with a particular focus on how the distinct neighborhood and school contexts in which different racial and ethnic groups participate explain variations in criminal outcomes. Special emphasis on the role of the criminal justice system in producing and eliminating disparities in criminal justice outcomes. Three lecture hours a week for one semester. Sociology 321D and 321K (Topic: Demography of Crime and Punishment) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321G","name":"Global Health Issues and Health Systems","description":"Overview of current global health challenges and issues from biological, cultural, and environmental perspectives. Examination, comparison, and contrasting of various health systems in the six World Health Organization geographic regions and countries within those regions, with regard to the specific health challenges they face. Three lecture hours a week for one semester. Sociology 321G and 321K (Topic: Global Health Issues and Health Systems) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321K","name":"Contemporary Issues in Sociology: Special Topics","description":"Three lecture hours a week for one semester.  May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"SOC 321L","name":"Sociology of Education","description":"Same as African and African Diaspora Studies 321L and Women's and Gender Studies 345 (Topic 23: Sociology of Education). Education as a societal institution, with emphasis on the United States educational system: how the system works; the effects of the system; recent changes. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321P","name":"Politics and Society in Latin America","description":"Same as Latin American Studies 325 (Topic 4). Introduction to present-day Latin American politics and society with a focus on drug-trafficking and urban destitution in Brazil; party politics, protest, and collective violence in Argentina; the current political situation in Venezuela; and migration from Central America and the Caribbean to the United States. Also includes a general overview of revolutions and revolutionary movements in Latin America, and the effects of United States intervention in the region during the twentieth century. Three lecture hours a week for one semester. Only one of the following may be counted: Latin American Studies 325 (Topic: Politics and Society in Latin America), Latin American Studies 325 (Topic 4), Sociology 321K (Topic: Politics and Society in Latin America), Sociology 321P. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321Q","name":"Social Inequality","description":"Study of social inequality as the unequal distribution of scarce but commonly desired resources and the processes by which these resources are allocated to individuals and groups. Examination of income and wealth inequality, occupational and class hierarchies, inequality of educational opportunity, poverty, social mobility between and within generations, gender and racial/ethnic inequality, and the consequences of inequality. Overview of the concepts, theories, facts, and methods of analysis used by sociologists to understand the social production and reproduction of inequality. Three lecture hours a week for one semester. Sociology 321K (Topic: Social Inequality) and 321Q may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321R","name":"The Sociology of Race and Work","description":"Same as Asian American Studies 330 (Topic 4) and Women's and Gender Studies 322 (Topic 6). Critical examination of work in the United States over the twentieth and twenty-first centuries through a gendered, Asian American lens, using a comparative race perspective. Subjects include the sociological examination of concepts such as labor markets, globalization, care work, and gender/racial segregation in the workplace along with the ways race and gender shape how and where individuals are fitted into the workplace, how skills are evaluated, and how labor markets emerge. Three lecture hours a week for one semester. Only one of the following may be counted: Asian American Studies 330 (Topic: Sociology of Race and Work), 330 (Topic 4), Sociology 321K (Topic: Sociology of Race and Work), 321R, Women's and Gender Studies 322 (Topic: Sociology of Race and Work), 322 (Topic 6). Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321S","name":"Anti-Semitism","description":"Same as History 366N (Topic 15) and Jewish Studies 365 (Topic 13). Surveys trends in Judeophobia/anti-Semitism over 2,500 years in both Christian and non-Christian societies. Designed to use anti-Semitism as way to explore more general ideas in social theory such as boundary making; models of racial, ethnic, and cultural conflict; and the role of intellectual and scientific elites. Three lecture hours a week for one semester. Only one of the following may be counted: History 366N (Topic: Anti-Semitism), 366N (Topic 15), Jewish Studies 365 (Topic: Anti-Semitism), 365 (Topic 13), Sociology 321K (Topic: Anti-Semitism), 321S. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321T","name":"Sociology of Africa","description":"An introduction to the sociological study of sub-Saharan Africa. Major themes include: sources of knowledge about Africa; characteristics of African states and societies, from origin to internal social boundaries (religion, ethnicity, class); kinship and family; and development and change. Three lecture hours a week for one semester. Only one of the following may be counted: African and African Diaspora Studies 374C (Topic: Sociology of Africa), Sociology 321K (Topic: Sociology of Africa), 321T. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321U","name":"Urban Sociology","description":"Same as Urban Studies 354 (Topic 11). Introduction to the study of the city and the suburbs. Specific focus on inequality in urban space, with emphasis on three major United States cities (New York, Chicago, and Los Angeles) and on several third world cities. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 321K (Topic: Urban Sociology), 321U, Urban Studies 354 (Topic: Urban Sociology), 354 (Topic 11). Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 321V","name":"Environmental Sociology","description":"Investigation of the ways human social patterns and ideologies shape the environment, how the environment shapes human lives, and the ways humans and the natural environment interrelate. The city of Austin will be used as a case study to examine the relationship between the natural and built environments (city space). Special emphasis on the process of global warming and its effects on human society and these relationships. Three lecture hours a week for one semester. Sociology 321K (Topic: Environmental Sociology) and 321V may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 322C","name":"Sociology of Creativity","description":"Introduction to varying aspects of creative insights, human consciousness, social processes, and the 'invention of reality.' Use of the elements of mindfulness, intuition, and creativity at individual, organizational, societal, and environmental levels, drawing on lectures, group discussions, books, articles, artistic films, and documentaries in order to better understand and appreciate the interconnectedness and interrelationship between 'inner' (personal) reality and 'other' (social) reality. Three lecture hours a week for one semester. Sociology 321K (Topic: Sociology of Creativity) and 322C may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 322D","name":"Race and the Digital","description":"Same as African and African Diaspora Studies 322D and Women's and Gender Studies 322 (Topic 7). Review of theoretical developments in the sociological study of \"race,\" including an examination of processes of racialization and cultural texts, in order to better understand the ways in which identities are socially produced. Attention will be placed on forms of popular culture, black cultural production, and political action to question how such practices are shaped by migrations within the African diaspora. Only one of the following may be counted: African and African Diaspora Studies 322D, 374E (Topic: Race, Culture, and Migration), Sociology 321K (Topic: Race, Culture, and Migration), 322D, Women's and Gender Studies 322 (Topic: Race, Culture, and Migration), 322 (Topic 7). Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 322E","name":"Entrepreneurship and Innovation","description":"Overview of entrepreneurship, with a special emphasis on technology transfer and wealth creation. Examination of \"how\" and \"why\" entrepreneurship takes place, focusing on the entrepreneurial process, the history (elements from the ancient world), and theoretical aspects of new venture developments. Three lecture hours a week for one semester. Only on of the following may be counted: Management 337 (Topic: Entrepreneurship and Innovation), Sociology 321K (Topic: Entrepreneurship and Innovation), 322E. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 322M","name":"Sociology of Masculinities","description":"Same as Women's and Gender Studies 322 (Topic 3). Sociological examination of the most important debates and discussions about men's experiences of masculinity in contemporary patriarchal societies. Exploration of social and individual meanings of masculinity, the dominant paradigms of masculinity that are taken as the norm, and the problems, contradictions, and paradoxes men experience in modern society. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 321K (Topic: Sociology of Masculinities), 322M, Women's and Gender Studies 322 (Topic: Sociology of Masculinities), 322 (Topic 3). Prerequisite: Upper-division standing, three hours of coursework in sociology, and three hours of coursework in women's and gender studies.","upper":true},{"key":"SOC 322P","name":"Sex and Violence in Popular Culture","description":"Same as Women's and Gender Studies 322 (Topic 10). Overview of the cultural framing of sex and violence through realistic and hyper-realistic representations of sex, love, violence, and war in popular culture. Examination of the ethical implications, including the ways in which these representations rely on and further social inequalities and the sociological concepts, methods, and theoretical approaches to understanding sex and violence in popular culture. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 321K (Topic: Sex and Violence in Popular Culture), 322P, Women's and Gender Studies 322 (Topic 10), 345 (Topic: Sex and Violence in Popular Culture). Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 322S","name":"The Sociology of Sport","description":"Examines the place of sport within social theory, with particular emphasis on the understanding of sport and society found in functionalist, Weberian, Marxist, figurational, feminist, and postmodernist accounts. This theoretical framework is used to explore key social issues in sport, including gender and representation, violence and deviancy, commercialization and college sport, race and inequality, and nationalism and identity. Three lecture hours a week for one semester. Sociology 321K (Topic 7: The Sociology of Sport) and 322S and may not both be counted. Prerequisite: Upper-division standing and Sociology 302.","upper":true},{"key":"SOC 323","name":"The Family","description":"Same as Women's and Gender Studies 345 (Topic 2). The American family in historical and comparative perspective. Family history and origins; comparative family systems; social antecedents of family structure and process; family formation and dissolution; family and society; recent family changes and prospects for the future. Three lecture hours a week for one semester. Sociology 323 and Women's and Gender Studies 345 (Topic 2) may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 323M","name":"Sport and English Society","description":"Same as European Studies 346 (Topic 6). Restricted to students in the Maymester Abroad Program; contact the University's Study Abroad Office for permission to register for this class. Uses the context of sport to explore the internal divisions around class and region that are central to understanding English identity, particularly the tensions between \"the north\" and \"the south,\" as well as to discover the origins of American sports such as football and baseball. The equivalent of three lecture hours a week for one semester. Taught in Leeds, England. Only one of the following may be counted: European Studies 346 (Topic: Sport and English Society), 346 (Topic 6), Kinesiology 350, Sociology 321K (Topic: Sport and English Society), 323M. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 324K","name":"Social Change in Developing Nations","description":"Overview of changing social structure in the Third World. Three lecture hours a week for one semester. Latin American Studies 325 (Topic 2: Social Change in Developing Nations) and Sociology 324K may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 325K","name":"Criminology","description":"An investigation into the nature of criminal events, including homicide, rape, robbery, property crimes, and white-collar crimes. Also examines the United States criminal justice system. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and completion of six semester hours of coursework in sociology.","upper":true},{"key":"SOC 325L","name":"Sociology of Criminal Justice","description":"Same as Urban Studies 354 (Topic 12). Examination of the police, courts, and prisons: how they work, their impact on those who pass through them. Introduction to the American criminal justice system, its policies and procedures. The primary focus will be on the roles and functions of the police, the courts, and corrections, with a special emphasis on how well or not so well the system operates. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 325L, Urban Studies 354 (Topic: Sociology of Criminal Justice), 354 (Topic 12). Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 329","name":"Social Stratification","description":"The types and levels of social inequality; the institutional and group processes that generate inequality; the interplay of social, organizational, economic, and political forces that affect the degree of differential opportunities and rewards in society. Three lecture hours a week for one semester. Prerequisite: Upper-division standing. Completion of Sociology 317L or another statistics course is recommended, but not required.","upper":true},{"key":"SOC 330C","name":"Death and Dying: Sociological Perspectives","description":"Sociological perspectives on definitions of death; group differences in mortality rates and causes of death; social meanings of death and dying; treatment of the dying and the dead; and grief and bereavement. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 330P","name":"Sociology and Social Psychology","description":"Examines how individuals perceive, interact with, and affect other individuals from the perspectives of both psychology and sociology. Three lecture hours a week for one semester. Sociology 321K (Topic: Sociology and Social Psychology) and 330P may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 333K","name":"Sociology of Gender","description":"Same as Women's and Gender Studies 322 (Topic 1: Sociology of Gender). Inequality between the sexes; men's and women's changing roles in society. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 335","name":"Society of Modern Mexico","description":"Same as Latin American Studies 325 (Topic 1: Society of Modern Mexico) and Urban Studies 354 (Topic 2: Society of Modern Mexico). Family, community, industrialization, and urbanization in modern Mexico. Three lecture hours a week for one semester.","upper":true},{"key":"SOC 336C","name":"American Dilemmas","description":"Same as Urban Studies 354 (Topic 13) and Women's and Gender Studies 345 (Topic 26). Examination of critical American social problems, including problems in the economic, political, and health care systems, as well as inequities based on income, gender, and race. Exploration of how these problems are a natural outgrowth of the existing social structure. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 336C, Urban Studies 354 (Topic: American Dilemmas), 354 (Topic 13), Women's and Gender Studies 345 (Topic 26). Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 336G","name":"Gender Politics in the Islamic World","description":"Same as Islamic Studies 373 (Topic 11), Middle Eastern Studies 341 (Topic 7), Religious Studies 358 (Topic 8),  and Women's and Gender Studies 340 (Topic 44). Study of the Islamic world and major sociological concepts such as gender, social organizations, culture, and politics. Examines how culture is mediated by politics, resulting in diverse interpretations of Islam and in different policies with respect to women's rights. Three lecture hours a week for one semester. Only one of the following may be counted: Islamic Studies 373 (Topic: Gender Politics in the Islamic World), 373 (Topic 11), Middle Eastern Studies 322K (Topic: Gender Politics in the Islamic World), 341 (Topic: Gender Politics in the Islamic World), 341 (Topic 7), Religious Studies 358 (Topic: Gender Politics in the Islamic World), 358 (Topic 8), Sociology 321K (Topic: Gender Politics in the Islamic World), 336G, Women's and Gender Studies 340 (Topic: Gender Politics in the Islamic World), 340 (Topic 44). Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 336P","name":"Social Psychology and the Law","description":"How courts make use of social science, as well as how social scientists study the legal system. Considers the uses of social science across multiple types of legal domains, such as eyewitnesses to crime, jury trials, punishment, children in the courts, and a variety of public policy issues. Three lecture hours a week for one semester. Sociology 321K (Topic: Social Psychology and the Law) and 336P may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 340C","name":"Globalization","description":"Same as European Studies 346 (Topic 7). A sociological analysis of the interrelated economic, political, and cultural aspects of globalization. Examines the consequences of globalization for nations around the world and for groups within these nations. Three lecture hours a week for one semester. Only one of the following may be counted: European Studies 346 (Topic: Globalization), 346 (Topic 7), Sociology 321K (Topic: Globalization), 340C. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 340D","name":"Violence","description":"An overview of the different theories of interpersonal and group violence. Includes criminological theories of violent crime, as well as feuding, ethnic and nationalist violence, political violence, and aggression in intimate relations. Three lecture hours a week for one semester. Sociology 321K (Topic: Violence) and 340D may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 340G","name":"Sociology of Sexualities","description":"Same as Women's and Gender Studies 322 (Topic 5). Review of sociological perspectives on sexuality. Examines how social institutions in United States society shape sexual values, beliefs, and practices. Subjects include changing cultural images of sexuality, sexual identities, and social movements. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 321K (Topic: Sociology of Sexuality), 340G, Women's and Gender Studies 322 (Topic: Sociology of Sexuality), 322 (Topic 5). Prerequisite: Upper-division standing; Sociology 302; and Sociology 333K or three semester hours of coursework in women's and gender studies.","upper":true},{"key":"SOC 340L","name":"Aging and the Life Course","description":"The biological, social, and psychological aspects of human aging from adolescence until death, with special emphasis on cultural norms and the social and demographic context in which aging occurs. Includes the challenges and problems of adjustment at each life stage, and the social, political, and economic consequences of increased longevity and changes in the age structure of the populations of modern societies. Three lecture hours a week for one semester. Sociology 321K (Topic: Aging and the Life Course) and 340L may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 344","name":"Racial and Ethnic Relations","description":"Contemporary racial and ethnic problems; emphasis on minority groups in the United States. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 350M","name":"Sociology Internship Seminar","description":"Restricted to students in the College of Liberal Arts. Students serve as supervised, unpaid interns in an agency, organization, or business. Provides an opportunity for students to apply the knowledge and skills acquired in sociology and other liberal arts courses. Three lecture hours and at least nine hours of fieldwork a week for one semester. Prerequisite: Upper-division standing and credit or registration for six semester hours of coursework in sociology.","upper":true},{"key":"SOC 350N","name":"Research Internship","description":"Fieldwork in research and analysis on sociological problems and institutions. About ten hours of fieldwork a week for one semester. Additional lecture hours may be required.  May be repeated for credit. Prerequisite: Nine semester hours of coursework in sociology, a University grade point average of at least 3.00, upper-division standing, and consent of the faculty undergraduate adviser.","upper":true},{"key":"SOC 352","name":"Social Movements","description":"Same as American Studies 321 (Topic 7). Characteristics of crowds, publics, and social movements; their role in social organization and social change. Three lecture hours a week for one semester. Only one of the following may be counted: American Studies 321 (Topic: Social Movements), American Studies 321 (Topic 7), Sociology 352. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 352D","name":"Boundaries and Dilemmas","description":"Designed to explore policy issues linked to universal moral imperatives, violations of these imperatives, and how violations are justified. The objective is to clarify how students think about matters of life and death and help students develop research skills in a subject of significant policy importance. Three lecture hours a week for one semester. Only one of the following may be counted: Liberal Arts Honors 350 (Topic: Boundaries and Dilemmas), Sociology 352M (Topic: Boundaries and Dilemmas), 352D. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 352E","name":"Media Industries and Entrepreneurship","description":"Same as Radio-Television-Film 365 (Topic 9). Examination of the social, political, and economic contexts in which media and culture are produced, distributed, and monetized. Emphasis on new media and communication technologies. Three lecture hours a week for one semester. Only one of the following may be counted: Radio-Television-Film 365 (Topic: Media Industries and Entrepreneurship), 365 (Topic 9), Sociology 352E, 352M (Topic: Media Industries and Entrepreneurship). Prerequisite: For radio-television-film majors, upper-division standing and twelve semester hours of lower-division coursework in radio-television-film; for others, consent of instructor.","upper":true},{"key":"SOC 352M","name":"Topics in Interdisciplinary Social Science","description":"An interdisciplinary analysis of significant social, economic, and political issues. Three lecture hours a week for one semester. Some topics are offered on the letter-grade basis only. May be repeated for credit when the topics vary. Prerequisite: Varies with the topic and is given in the Course Schedule.","upper":true},{"key":"SOC 352S","name":"Globalization and Social Media","description":"Same as Radio-Television-Film 365 (Topic 10). Issues surrounding the hype, myth, paradox, and reality of social media in a global context. Three lecture hours a week for one semester. Only one of the following may be counted: Asian American Studies 320 (Topic: Globalization and Social Media), Journalism 349T (Topic: Globalization and Social Media), Radio-Television-Film 331M (Topic: Globalization and Social Media), 365 (Topic 10), Sociology 321K (Topic: Globalization and Social Media), 352S. Prerequisite: For radio-television-film majors, upper-division standing and twelve semester hours of lower-division coursework in radio-television-film; for others, consent of instructor.","upper":true},{"key":"SOC 354K","name":"Sociology of Health and Illness","description":"Application of sociological concepts and principles to the study of health professions, medical institutions, community medical organization, and the distribution of illness. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 358D","name":"Health Policy and Health Systems","description":"Covers the essentials of health policy and law, including the ways that policy and legal issues impact health care and public health systems. Three lecture hours a week for one semester. Public Health 358D and Sociology 358D may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 359","name":"Labor and Labor Movements","description":"Overview of work organizations in the United States, with emphasis on globalization, inequality, and labor movements. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 366","name":"Deviance","description":"Analysis of social norms, conformity, and reactions to norm violations. Topics include behavioral forms of deviance such as suicide and drug abuse and nonbehavioral forms of deviance such as physical abnormality. Three lecture hours a week for one semester. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 368D","name":"Social Context of Public Health","description":"An introduction to the social and behavioral theories that inform the discipline of public health, including practical examples of the ways that these theories are used to understand health-related behaviors and health promotion. Includes data on population distributions of mortality and morbidity, health inequalities, and how underlying social structures impact the health of individuals and communities. Three lecture hours a week for one semester. Public Health 368D and Sociology 368D may not both be counted. Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 369K","name":"Population and Society","description":"Same as Women's and Gender Studies 322 (Topic 2). The study of populations, including their growth, age structure, and patterns of fertility, mortality, and migration; the social causes and consequences of these phenomena. Three lecture hours a week for one semester. Only one of the following may be counted: Sociology 369K, Women's and Gender Studies 322 (Topic: Population and Society), 322 (Topic 2). Prerequisite: Upper-division standing.","upper":true},{"key":"SOC 369L","name":"Analytical Demography","description":"Formal demography; stable population theory; life tables and techniques of mortality estimation; estimates and projections. Three lecture hours a week for one semester. Prerequisite: Upper-division standing and college algebra or the equivalent.","upper":true},{"key":"SOC 679H","name":"Honors Tutorial Course","description":"Research into and development of a thesis topic and proposal followed by the writing and defense of a thesis. The equivalent of three lecture hours a week for two semesters. Prerequisite: For 679HA, upper-division standing and admission to the Sociology Honors Program; for 679HB, Sociology 679HA.","upper":true},{"key":"SOC 379M","name":"Sociological Theory","description":"Restricted to sociology majors. Critical examination of major sociological theories and their relevance to current research and social conditions. Three lecture hours a week for one semester. Prerequisite: Upper-division standing, and six semester hours of coursework in sociology or consent of instructor.","upper":true},{"key":"SOC 379N","name":"Conference Course","description":"Supervised individual study of selected problems in sociology. Conference course.  May be repeated for credit. Prerequisite: Upper-division standing, Sociology 302 or the equivalent, nine semester hours of upper-division coursework in sociology or related fields, a University grade point average of at least 3.00, and consent of the faculty undergraduate adviser.","upper":true},{"key":"SOC 379P","name":"Undergraduate Research Opportunity","description":"Restricted to sociology majors. Students participate in research-related activities with faculty members in the Department of Sociology. Activities may include collecting interview or survey data, analyzing statistics, synthesizing research literature, and coding qualitative data. Five to seven hours a week for one semester. May be repeated for credit but may only be taken once on the letter-grade basis. Prerequisite: Upper-division standing, Sociology 302 or the equivalent, nine semester hours of upper-division coursework in sociology or related fields, a University grade point average of at least 3.00, and consent of the faculty undergraduate adviser.","upper":true}]